const t=[{id:"2009-a41",type:"applied",year:2009,no:41,subject:"数据结构",paper:"408",stem:`带权图（权值非负，表示边连接的两顶点间的距离）的最短路径问题是找出从初始顶点到目标顶点之间的一条最短路径。假设从初始顶点到目标顶点之间存在路径，现有一种解决该问题的方法：

(1) 设最短路径初始时仅包含初始顶点, 令当前顶点  $u$  为初始顶点;
(2) 选择离u最近且尚未在最短路径中的一个顶点v，加入到最短路径中，修改当前顶点u=v；
③ 重复步骤②，直到u是目标顶点时为止。

请问上述方法能否求得最短路径？若该方法可行，请证明之；否则，请举例说明。`,explanation:"",totalScore:10,parts:[{no:1,stem:`带权图（权值非负，表示边连接的两顶点间的距离）的最短路径问题是找出从初始顶点到目标顶点之间的一条最短路径。假设从初始顶点到目标顶点之间存在路径，现有一种解决该问题的方法：

(1) 设最短路径初始时仅包含初始顶点, 令当前顶点  $u$  为初始顶点;
(2) 选择离u最近且尚未在最短路径中的一个顶点v，加入到最短路径中，修改当前顶点u=v；
③ 重复步骤②，直到u是目标顶点时为止。

请问上述方法能否求得最短路径？若该方法可行，请证明之；否则，请举例说明。`,answer:`该方法不一定能（或不能）求得最短路径。

例如，对于下图所示的带权图，如果按照题中的原则，从A到C的最短路径是  $\\mathrm{A - > B - > C}$  ，事实上其最短路径是  $\\mathrm{A - > D - > C}$  。

![](https://408.foreverlink.love/images/4d355a4adb3cdd0427ca62a0716b9bac.jpg)`,score:10}]},{id:"2009-a42",type:"applied",year:2009,no:42,subject:"数据结构",paper:"408",stem:`已知一个带有表头结点的单链表，结点结构为：

<table><tr><td>data</td><td>link</td></tr></table>

假设该链表只给出了头指针 list。在不改变链表的前提下，请设计一个尽可能高效的算法，查找链表中倒数第  $k$  个位置上的结点(  $k$  为正整数)。若查找成功，算法输出该结点的 data 域的值，并返回 1；否则，只返回 0。要求：`,explanation:"",totalScore:15,parts:[{no:1,stem:"描述算法的基本设计思想；",answer:`算法的基本设计思想（5分）：
问题的关键是设计一个尽可能高效的算法，通过链表的一趟遍历，找到倒数第k个结点的位置。算法的基本设计思想是：定义两个指针变量p和q，初始时均指向头结点的下一个结点（链表的第一个结点）。p指针沿链表移动；当p指针移动到第k个结点时，q指针开始与p指针同步移动；当p指针移动到最后一个结点时，q指针所指示结点为倒数第k个结点。以上过程对链表仅进行一遍扫描。`,score:null},{no:2,stem:"描述算法的详细实现步骤；",answer:`算法的详细实现步骤（5分）：
① count=0，p 和 q 指向链表表头结点的下一个结点；
$②$  若  $\\mathfrak{p}$  为空，转  $⑤$
③ 若count等于k，则q指向下一个结点；否则，count=count+1;
④ p指向下一个结点，转②；
⑤ 若 count 等于 k，则查找成功，输出该结点的 data 域的值，返回 1；否则，说明 k 值超过了线性表的长度，查找失败，返回 0;
⑥ 算法结束。`,score:null},{no:3,stem:"根据设计思想和实现步骤，采用程序设计语言描述算法（使用 C、C++或 Java 语言实现），关键之处请给出简要注释。",answer:`算法实现（5分）：
\`\`\`txt
typedef int ElemType; //链表数据的类型定义
typedef struct LNode{ //链表结点的结构定义ElemType data; //结点数据struct Lnode \\*link; //结点链接指针\\} \\*LinkList;
int Search_k(LinkList list, int k){
//查找链表list倒数第k个结点，并输出该结点data域的值LinkList p = list->link, q = list->link; //指针p、q指示第一个结点
\`\`\`

\`\`\`c
int count = 0;
while (p != NULL) { //遍历链表直到最后一个结点
    if (count < k) count++; //计数，若 count < k 只移动 p
    else q = q->link; p = p->link; //之后让 p、q 同步移动
} //while
if (count < k)
    return 0; //查找失败返回 0
else { //否则打印并返回 1
    printf("%d", q->data);
    return 1;
}
} //Search_k
\`\`\`

提示：算法程序题，如果能够写出数据结构类型定义、正确的算法思想都会至少给一半以上分数，如果能用伪代码写出自然更好，比较复杂的地方可以直接用文字表达。

若所给出的算法采用一遍扫描方式就能得到正确结果，可给满分15分；若采用两遍或多遍扫描才能得到正确结果的，最高分10分。若采用递归算法得到正确结果的，最高给10分；若实现算法的空间复杂度过高（使用了大小与k有关的辅助数组），但结果正确，最高给10分。`,score:null}]},{id:"2009-a43",type:"applied",year:2009,no:43,subject:"计算机组成原理",paper:"408",stem:`某计算机的 CPU 主频为  $500 \\mathrm{MHz}$ , CPI 为 5 (即执行每条指令平均需 5 个时钟周期)。假定某外设

的数据传输率为  $0.5 \\mathrm{MB} / \\mathrm{s}$ , 采用中断方式与主机进行数据传送, 以 32 位为传输单位, 对应的中断服务程序包含 18 条指令, 中断服务的其他开销相当于 2 条指令的执行时间。请回答下列问题, 要求给出计算过程。1) 在中断方式下, CPU 用于该外设 I/O 的时间占整个 CPU 时间的百分比是多少?

2）当该外设的数据传输率达到  $5\\mathrm{MB / s}$  时，改用DMA方式传送数据。假定每次DMA传送块大小为5000B，且DMA预处理和后处理的总开销为500个时钟周期，则CPU用于该外设I/O的时间占整个CPU时间的百分比是多少？（假设DMA与CPU之间没有访存冲突）`,explanation:"",totalScore:8,parts:[{no:1,stem:`某计算机的 CPU 主频为  $500 \\mathrm{MHz}$ , CPI 为 5 (即执行每条指令平均需 5 个时钟周期)。假定某外设

的数据传输率为  $0.5 \\mathrm{MB} / \\mathrm{s}$ , 采用中断方式与主机进行数据传送, 以 32 位为传输单位, 对应的中断服务程序包含 18 条指令, 中断服务的其他开销相当于 2 条指令的执行时间。请回答下列问题, 要求给出计算过程。1) 在中断方式下, CPU 用于该外设 I/O 的时间占整个 CPU 时间的百分比是多少?

2）当该外设的数据传输率达到  $5\\mathrm{MB / s}$  时，改用DMA方式传送数据。假定每次DMA传送块大小为5000B，且DMA预处理和后处理的总开销为500个时钟周期，则CPU用于该外设I/O的时间占整个CPU时间的百分比是多少？（假设DMA与CPU之间没有访存冲突）`,answer:`(1) 按题意，外设每秒传送  $0.5 \\mathrm{MB}$ ，中断时每次传送 4B。中断方式下，CPU 每次用于数据传送的时钟周期为： $5 \\times 18 + 5 \\times 2 = 100$ 。

为达到外设  $0.5\\mathrm{MB / s}$  的数据传输率，外设每秒申请的中断次数为：  $0.5\\mathrm{MB} / 4\\mathrm{B} = 125000$

1秒钟内用于中断的开销：  $100\\times 125000 = 12500000 = 12.5\\mathrm{M}$  个时钟周期。

CPU用于外设I/O的时间占整个CPU时间的百分比：  $12.5\\mathrm{M} / 500\\mathrm{M} = 2.5\\%$

(2) 当外设数据传输率提高到  $5 \\mathrm{MB} / \\mathrm{s}$  时改用 DMA 方式传送，每次 DMA 传送 5000B，1 秒钟内需产生的 DMA 次数： $5 \\mathrm{MB} / 5000 \\mathrm{~B} = 1000$ 。

CPU 用于 DMA 处理的总开销： $1000 \\times 500 = 500000 = 0.5\\mathrm{M}$  个时钟周期。

CPU 用于外设 I/O 的时间占整个 CPU 时间的百分比： $0.5\\mathrm{M} / 500\\mathrm{M} = 0.1\\%$ 。`,score:8}]},{id:"2009-a44",type:"applied",year:2009,no:44,subject:"计算机组成原理",paper:"408",stem:`某计算机字长16位，采用16位定长指令字结构，部分数据通路结构如下图所示，图中所有控制信号为1时表示有效、为0时表示无效。例如控制信号MDRinE为1表示允许数据从DB打入MDR，MDRin为1表示允许数据从内总线打入MDR。假设MAR的输出一直处于使能状态。加法指令“ADD(R1)，R0”的功能为  $(\\mathrm{R0}) + ((\\mathrm{R1}))\\rightarrow (\\mathrm{R1})$  ，即将R0中的数据与R1的内容所指主存单元的数据相加，并将结果送入R1的内容所指主存单元中保存。

![](https://408.foreverlink.love/images/442bf4bfe6200cb41b6cdbbc78d90547.jpg)

下表给出了上述指令取指和译码阶段每个节拍(时钟周期)的功能和有效控制信号，请按表中描述方式用表格列出指令执行阶段每个节拍的功能和有效控制信号。

<table><tr><td>时钟</td><td>功能</td><td>有效控制信号</td></tr><tr><td>C1</td><td>MAR←(PC)</td><td>PCout, MARin</td></tr><tr><td rowspan="2">C2</td><td>MDR←M(MDR)</td><td rowspan="2">MemR, MDRinE, PC+1</td></tr><tr><td>PC←(PC)+1</td></tr><tr><td>C3</td><td>IR←(MDR)</td><td>MDRout, IRin</td></tr><tr><td>C4</td><td>指令译码</td><td>无</td></tr></table>`,explanation:"",totalScore:13,parts:[{no:1,stem:`某计算机字长16位，采用16位定长指令字结构，部分数据通路结构如下图所示，图中所有控制信号为1时表示有效、为0时表示无效。例如控制信号MDRinE为1表示允许数据从DB打入MDR，MDRin为1表示允许数据从内总线打入MDR。假设MAR的输出一直处于使能状态。加法指令“ADD(R1)，R0”的功能为  $(\\mathrm{R0}) + ((\\mathrm{R1}))\\rightarrow (\\mathrm{R1})$  ，即将R0中的数据与R1的内容所指主存单元的数据相加，并将结果送入R1的内容所指主存单元中保存。

![](https://408.foreverlink.love/images/442bf4bfe6200cb41b6cdbbc78d90547.jpg)

下表给出了上述指令取指和译码阶段每个节拍(时钟周期)的功能和有效控制信号，请按表中描述方式用表格列出指令执行阶段每个节拍的功能和有效控制信号。

<table><tr><td>时钟</td><td>功能</td><td>有效控制信号</td></tr><tr><td>C1</td><td>MAR←(PC)</td><td>PCout, MARin</td></tr><tr><td rowspan="2">C2</td><td>MDR←M(MDR)</td><td rowspan="2">MemR, MDRinE, PC+1</td></tr><tr><td>PC←(PC)+1</td></tr><tr><td>C3</td><td>IR←(MDR)</td><td>MDRout, IRin</td></tr><tr><td>C4</td><td>指令译码</td><td>无</td></tr></table>`,answer:`一条指令的执行过程通常由取指、译码和执行3个步骤完成，本题中取指用3个节拍、译码用1个节拍，执行加法运算并把结果写入主存如何完成呢？包括划分执行步骤、确定完成的功能、要提供的控制信号，这是本题要测试的内容。为回答这个问题，首先要看清图中给出的部件组成情况和信息传送的路径。

要完成的功能时（R0）+（（R1)）  $\\longrightarrow$  （R1)，从图中看到：

(1) R0、R1 都有送自己内容到内总线的路径，控制信号分别是 R0out 和 R1out；
(2)ALU加运算，2个数据由工作寄存器A和内总线提供，控制信号是Add；A只接收内总线的内容，控制信号是Ain；结果需存AC，控制信号是ACin；AC的内容可送内总线，控制信号是ACout;
(3)PC可接收内总线的内容，还可增1，控制信号是PCin和  $\\mathrm{PC + 1,PC}$  的内容可送内总线，控制信号是PCout；
(4) 指令寄存器 IR 可接收内总线的内容，控制信号是 IRin；
(5) 读写存储器时, 地址由 MAR 经 AB 提供, MAR 只接收总线上的信息, 控制信号是 MARin;
(6) 读存储器，提供读命令 MemR，并通过 DB 送入 MDR，控制信号是 MDRinE;MDR 的内容可送入总线，控制信号是 MDRout;
(7) 写存储器, 提供写命令 MemW, 数据由 MDR 通过 DB 送到存储器的数据引脚, 控制信号是 MDRoutE;

然后是划分执行步骤、确定每一步完成的功能、需要提供的控制信号。这是由指令应完成的功能和计算机硬件的实际组成情况和信息传送的可用路径共同决定的，基本原则是步骤越少越好。硬件电路要能支持，可以有多种方案，解题时应参照以给出的答题格式，即取指和译码阶段的那张表的内容，但不必把表已有的内容再抄一遍。

划分指令执行步骤，确定每一步完成的功能、给出需要提供的控制信号：

请注意， $(R0) + ((R1))$  表示：R0寄存器的内容与R1作地址从主存中读出来的数据完成加法运算；而  $\\rightarrow$  （R1）表示把R1的内容作为主存储器的地址完成写主存操作。为防止出现误解，题中还特地对此作了文字说明。这条指令的功能是先到主存储器取一个数，之后运算，再将结果写回主存储器。

(1) 执行相加运算, 需把存储器中的数据读出, 为此首先送地址, 将 R1 的内容送 MAR, 控制信号是 R1out、MARin。
(2) 启动读主存操作，读出的内容送入MDR，控制信号是MemR、MDRinE。还可同时把R0的内容经内总线送入A，用到的控制信号是R0out、Ain。
(3) 执行加法运算，即 A 的内容与 MDR 的内容相加，结果保存到 AC，控制信号是 MDRout、Add、Acin。
(4) 要把 AC 的内容写入主存，由于 R1 的内容已经在 MAR 中，地址已经有了，但需要把写入的数据（已经在 AC 中）经内总线送入 MDR，控制信号是 AOut、MDRin。
(5) 给出写主存的命令, 把MDR的内容经DB送存储器的数据线引脚, 执行写操作, 控制信号是MDRoutE、MemW。

这几个步骤是有先后次序的，前面的完成了，下一步才可以执行，也保证了不会产生硬件线路的冲突。请注意，使用最为频繁的是内总线，它在任何时刻只能接收一个输入数据，并且向内总线发送信息的电路只能以三态门器件连接到内总线，5个向内总裁发送信息的控制信号（ACout，PCout，R0out，R1out，MDRout）最多只能有一个为1，其他4个必须全为0，或者5个全为0.

仔细看一下，发现可以把第2个步骤的操作划分到两个步骤中完成，一个步骤中安排MDR接收从存储器中读出的内容，到另外一个步骤实现R0的内容送入A，这多用了一个操作步骤，指令的执行速度会变慢。有些解题者在写存储器之前，还会再执行一次把R1的内容送MAR，尽管无此必要，但不属于原理上的错误。

当然还可以有其他的设计结果。

解题时这些叙述内容不必写出来（这里写出这些内容是希望帮助大家领会本题要测试的知识点和指令的执行过程），直接按照已经给出的表格的形式、按照提供的填写办法把设计的表格及其内容填好就可以了。

请注意，题目表格内容（告诉你答题的格式和答题内容的表达方式）与你答题的表格内容合在一起才是这条指令的完整的执行过程，千万不要产生任何错觉。

参考答案一：

<table><tr><td>时钟</td><td>功能</td><td>有效控制信号</td></tr><tr><td>C5</td><td>MAR←(R1)</td><td>R1out,MARin</td></tr><tr><td rowspan="2">C6</td><td>MDR←M(MAR)</td><td>MemR,MDRinE,</td></tr><tr><td>A←(R0)</td><td>R0out,Ain</td></tr><tr><td>C7</td><td>AC←(MDR)+(A)</td><td>MDRout,Add,ACin</td></tr><tr><td>C8</td><td>MDR←(AC)</td><td>ACout,MDRin</td></tr><tr><td>C9</td><td>M(MAR)←(MDR)</td><td>MDRout,E,MemW</td></tr></table>

“A←(R0)”也可在C7：“AC←（MDR）+（A）”之前单列的一个时钟周期内执行。

参考答案二：

<table><tr><td>时钟</td><td>功能</td><td>有效控制信号</td></tr><tr><td>C5</td><td>MAR←(R1)</td><td>Rlout,MARin</td></tr><tr><td>C6</td><td>MDR←M(MAR)</td><td>MemR,MDRinE</td></tr><tr><td>C7</td><td>A←(MDR)</td><td>MDRout,Ain</td></tr><tr><td>C8</td><td>AC←(A)+(R0)</td><td>R0out,Add,ACin</td></tr><tr><td>C9</td><td>MDR←(AC)</td><td>ACout,MDRin</td></tr><tr><td>C10</td><td>M(MAR)←(MDR)</td><td>MDRout,E,MemW</td></tr></table>`,score:13}]},{id:"2009-a45",type:"applied",year:2009,no:45,subject:"操作系统",paper:"408",stem:"三个进程P1、P2、P3互斥使用一个包含  $\\mathrm{N}(\\mathrm{N} > 0)$  个单元的缓冲区。P1每次用produce()生成一个正整数并用put()送入缓冲区某一空单元中；P2每次用getodd()从该缓冲区中取出一个奇数并用countodd()统计奇数个数；P3每次用geteven()从该缓冲区中取出一个偶数并用counteven()统计偶数个数。请用信号量机制实现这三个进程的同步与互斥活动，并说明所定义信号量的含义。要求用伪代码描述。",explanation:"",totalScore:7,parts:[{no:1,stem:"三个进程P1、P2、P3互斥使用一个包含  $\\mathrm{N}(\\mathrm{N} > 0)$  个单元的缓冲区。P1每次用produce()生成一个正整数并用put()送入缓冲区某一空单元中；P2每次用getodd()从该缓冲区中取出一个奇数并用countodd()统计奇数个数；P3每次用geteven()从该缓冲区中取出一个偶数并用counteven()统计偶数个数。请用信号量机制实现这三个进程的同步与互斥活动，并说明所定义信号量的含义。要求用伪代码描述。",answer:`定义信号量 odd 控制 P1 与 P2 之间的同步；even 控制 P1 与 P3 之间的同步；empty 控制生产者与消费者之间的同步；mutex 控制进程间互斥使用缓冲区。程序如下：

\`\`\`txt
semaphore odd  $= 0$  ,even  $= 0$  ,empty  $= \\mathrm{N}$  ,mutex  $= 1$
P1(）
 $\\begin{array}{rl} & {\\mathrm{x} = \\mathrm{produce};\\quad \\mathrm{/}\\mathrm{生成一个数}}\\\\ & {\\mathrm{P}(\\mathrm{empty});\\quad \\mathrm{/}\\mathrm{判断缓冲区是否有空单元}}\\\\ & {\\mathrm{P}(\\mathrm{mutex});\\quad \\mathrm{/}\\mathrm{缓冲区是否被占用}}\\\\ & {\\mathrm{Put();}}\\\\ & {\\mathrm{V}(\\mathrm{mutex});\\quad \\mathrm{/}\\mathrm{释放缓冲区}}\\\\ & {\\mathrm{if(x\\%2 == 0)}}\\\\ & {\\mathrm{V}(\\mathrm{even});\\quad \\mathrm{/}\\mathrm{如果是偶数，向P3发出信号}}\\\\ & {\\mathrm{else}}\\\\ & {\\mathrm{V}(\\mathrm{odd});\\quad \\mathrm{/}\\mathrm{如果是奇数，向P2发出信号}}\\\\ & {} \\end{array}$ $\\} \\qquad$
P2（）
 $\\{$ $\\begin{array}{ll}\\mathrm{P}(\\mathrm{odd}); & \\mathrm{/}\\mathrm{收到P1发来的信号，已产生一个奇数}\\\\ \\mathrm{P}(\\mathrm{mutex}); & \\mathrm{/}\\mathrm{缓冲区是否被占用}\\\\ \\mathrm{getodd();} & \\\\ \\mathrm{V}(\\mathrm{mutex}); & \\mathrm{/}\\mathrm{释放缓冲区}\\\\ \\mathrm{V}(\\mathrm{empty}); & \\mathrm{/}\\mathrm{向P1发信号，多出一个空单元}\\\\ \\mathrm{countodd();} & \\\\ \\end{array}$ $\\} \\qquad$
P3（）
 $\\{$ $\\begin{array}{ll}\\mathrm{P}(\\mathrm{even}); & \\mathrm{/}\\mathrm{收到P1发来的信号，已产生一个偶数}\\\\ \\mathrm{P}(\\mathrm{mutext}); & \\mathrm{/}\\mathrm{缓冲区是否被占用}\\\\ \\mathrm{geteven();} & \\\\ \\mathrm{V}(\\mathrm{mutex}); & \\mathrm{/}\\mathrm{释放缓冲区}\\\\ \\mathrm{V}(\\mathrm{empty}); & \\mathrm{/}\\mathrm{向P1发信号，多出一个空单元}\\\\ \\mathrm{counteven();} & \\\\ \\end{array}$
\`\`\``,score:7}]},{id:"2009-a46",type:"applied",year:2009,no:46,subject:"操作系统",paper:"408",stem:`请求分页管理系统中，假设某进程的页表内容如下表所示：

<table><tr><td>页号</td><td>页框(Page Frame)号</td><td>有效位(存在位)</td></tr><tr><td>0</td><td>101H</td><td>1</td></tr><tr><td>1</td><td>—</td><td>0</td></tr><tr><td>2</td><td>254H</td><td>1</td></tr></table>

页面大小为 4KB，一次内存的访问时间是  $100\\mathrm{ns}$ ，一次快表(TLB)的访问时间是  $10\\mathrm{ns}$ ，处理一次缺页的平均时间  $10^{8}\\mathrm{ns}$ （已含更新 TLB 和页表的时间），进程的驻留集大小固定为 2，采用最近最少使用置换算法(LRU)和局部淘汰策略。假设①TLB 初始为空；②地址转换时先访问 TLB，若 TLB 未命中，再访问页表(忽略访问页表之后的 TLB 更新时间)；③有效位为 0 表示页面不在内存，产生缺页中断，缺页中断处理后，返回到产生缺页中断的指令处重新执行。设有虚地址访问序列  $2362\\mathrm{H}$ 、 $1565\\mathrm{H}$ 、 $25\\mathrm{A}5\\mathrm{H}$ ，请问：`,explanation:"",totalScore:8,parts:[{no:1,stem:"依次访问上述三个虚地址，各需多少时间？给出计算过程。",answer:`根据页式管理的工作原理，应先考虑页面大小，以便将页号和页内位移分解出来。页面大小为 4KB，
即  $2^{12}$ ，则得到页内位移占虚地址的低12位，页号占剩余高位。可得三个虚地址的页号P如下（十六进制的一位数字转换成4位二进制，因此，十六进制的低三位正好为页内位移，最高位为页号）：

2362H：P=2，访问快表10ns，因初始为空，访问页表100ns得到页框号，合成物理地址后访问主存100ns，共计  $10\\mathrm{ns} + 100\\mathrm{ns} + 100\\mathrm{ns} = 210\\mathrm{ns}$  。

1565H：P=1，访问快表10ns，落空，访问页表100ns落空，进行缺页中断处理  $10^{8}\\mathrm{ns}$ ，访问快表10ns，合成物理地址后访问主存100ns，共计  $10\\mathrm{ns} + 100\\mathrm{ns} + 10^{8}\\mathrm{ns} + 10\\mathrm{ns} + 100\\mathrm{ns} = 100000220\\mathrm{ns}$ 。

25A 5H： $\\mathrm{P} = 2$ ，访问快表，因第一次访问已将该页号放入快表，因此花费 10ns 便可合成物理地址，访问主存 100ns，共计 10ns+100ns=110ns。`,score:null},{no:2,stem:"基于上述访问序列，虚地址  $1565\\mathrm{H}$  的物理地址是多少？请说明理由。",answer:"当访问虚地址 1565H 时，产生缺页中断，合法驻留集为 2，必须从页表中淘汰一个页面，根据题目的置换算法，应淘汰 0 号页面，因此 1565H 的对应页框号为 101H。由此可得 1565H 的物理地址为 101565H。",score:null}]},{id:"2009-a47",type:"applied",year:2009,no:47,subject:"计算机网络",paper:"408",stem:`某网络拓扑如下图所示，路由器R1通过接口E1、E2分别连接局域网1、局域网2，通过接口L0连接路由器R2，并通过路由器R2连接域名服务器与互联网。R1的L0接口的IP地址是202.118.2.1；R2的L0接口的IP地址是202.118.2.2，L1接口的IP地址是130.11.120.1，E0接口的IP地址是202.118.3.1；域名服务器的IP地址是202.118.3.2。

![](https://408.foreverlink.love/images/ba9a69497bbf1dff86269d776fa1f642.jpg)

R1和R2的路由表结构为：

<table><tr><td>目的网络IP地址</td><td>子网掩码</td><td>下一跳IP地址</td><td>接口</td></tr></table>`,explanation:"",totalScore:9,parts:[{no:1,stem:"将 IP 地址空间 202.118.1.0/24 划分为 2 个子网, 分别分配给局域网 1、局域网 2, 每个局域网需分配的 IP 地址数不少于 120 个。请给出子网划分结果, 说明理由或给出必要的计算过程。",answer:`CIDR中的子网号可以全0或全1，但主机号不能全0或全1。
因此若将IP地址空间202.118.1.0/24划分为2个子网，且每个局域网需分配的IP地址个数不少于120个，子网号至少要占用一位。

由  $2^{6} - 2 < 120 < 2^{7} - 2$  可知，主机号至少要占用7位。

由于源IP地址空间的网络前缀为24位，因此主机号位数  $+$  子网号位数  $= 8$  。

综上可得主机号位数为7，子网号位数为1。

因此子网的划分结果为：子网1：202.118.1.0/25，子网2：202.118.1.128/25。

地址分配方案：子网1分配给局域网1，子网2分配给局域网2，或子网1分配给局域网2，子网2分配给局域网1。`,score:null},{no:2,stem:"请给出 R1 的路由表，使其明确包括到局域网 1 的路由、局域网 2 的路由、域名服务器的主机路由和互联网的路由。",answer:`由于局域网1和局域网2分别与路由器R1的E1、E2接口直接相连，因此在R1的路由表中，目的网络为局域网1的转发路径是直接通过接口E1转发，目的网络为局域网2的转发路径是直接通过接口E1转发。由于局域网1、2的网络前缀均为25位，因此它们的子网掩码均为255.255.255.128。
根据题意，R1专门为域名服务器设定了一个特定的路由表项，因此该路由表项中的子网掩码应为255.255.255.255。对应的下一跳转发地址是202.118.2.2，转发接口是L0。

根据题意，到互联网的路由实质上相当于一个默认路由，默认路由一般写作  $0 / 0$  ，即目的地址为0.0.0.0，子网掩码为0.0.0.0。对应的下一跳转发地址是202.118.2.2，转发接口是L0。

综上可得到路由器R1的路由表为：

(若子网 1 分配给局域网 1, 子网 2 分配给局域网 2)

<table><tr><td>目的网络IP地址</td><td>子网掩码</td><td>下一跳IP地址</td><td>接口</td></tr><tr><td>202.118.1.0</td><td>255.255.255.128</td><td>—</td><td>E1</td></tr><tr><td>202.118.1.128</td><td>255.255.255.128</td><td>—</td><td>E2</td></tr><tr><td>202.118.3.2</td><td>255.255.255.255</td><td>202.118.2.2</td><td>L0</td></tr><tr><td>0.0.0.0</td><td>0.0.0.0</td><td>202.118.2.2</td><td>L0</td></tr></table>

（若子网1分配给局域网2，子网2分配给局域网1）

<table><tr><td>目的网络 IP 地址</td><td>子网掩码</td><td>下一跳 IP 地址</td><td>接口</td></tr><tr><td>202.118.1.128</td><td>255.255.255.128</td><td>—</td><td>E1</td></tr><tr><td>202.118.1.0</td><td>255.255.255.128</td><td>—</td><td>E2</td></tr><tr><td>202.118.3.2</td><td>255.255.255.255</td><td>202.118.2.2</td><td>L0</td></tr><tr><td>0.0.0.0</td><td>0.0.0.0</td><td>202.118.2.2</td><td>L0</td></tr></table>`,score:null},{no:3,stem:"请采用路由聚合技术，给出 R2 到局域网 1 和局域网 2 的路由。",answer:`局域网 1 和局域网 2 的地址可以聚合为 202.118.1.0/24，而对于路由器 R2 来说，通往局域网 1 和 2 的
转发路径都是从L0接口转发，因此采用路由聚合技术后，路由器R2到局域网1和局域网2的路由为：

<table><tr><td>目的网络 IP 地址</td><td>子网掩码</td><td>下一跳 IP 地址</td><td>接口</td></tr><tr><td>202.118.1.0</td><td>255.255.255.0</td><td>202.118.2.1</td><td>L0</td></tr></table>

2009年全国硕士研究生入学统一考试

计算机学科专业基础综合试题——选择题部分解析

一、单项选择题

1. 考查栈和队列的特点及应用。

C和D直接排除，缓冲区的特点需要先进先出，若用栈，则先进入缓冲区的数据则要排队到最后才能打印，不符题意，所以只有队列符合题意。

2. 考查栈的最大递归深度。

时刻注意栈的特点是先进后出。下面是出入栈的详细过程：

<table><tr><td>序号</td><td>说明</td><td>栈内</td><td>栈外</td><td>序号</td><td>说明</td><td>栈内</td><td>栈外</td></tr><tr><td>1</td><td>a入栈</td><td>a</td><td></td><td>8</td><td>e入栈</td><td>ae</td><td>bdc</td></tr><tr><td>2</td><td>b入栈</td><td>ab</td><td></td><td>9</td><td>f入栈</td><td>aef</td><td>bdc</td></tr><tr><td>3</td><td>b出栈</td><td>a</td><td>b</td><td>10</td><td>f出栈</td><td>ae</td><td>bdcf</td></tr><tr><td>4</td><td>c入栈</td><td>ac</td><td>b</td><td>11</td><td>e出栈</td><td>a</td><td>bdcfe</td></tr><tr><td>5</td><td>d入栈</td><td>acd</td><td>b</td><td>12</td><td>a出栈</td><td></td><td>bdcfea</td></tr><tr><td>6</td><td>d出栈</td><td>ac</td><td>bd</td><td>13</td><td>g入栈</td><td>g</td><td>bdcfea</td></tr><tr><td>7</td><td>c出栈</td><td>a</td><td>bdc</td><td>14</td><td>g出栈</td><td></td><td>bdcfeag</td></tr></table>

栈内的最大深度为3，故栈S的容量至少是3。

3. 考查二叉树的特殊遍历。

分析遍历后的结点序列，可以看出根结点是在中间被访问的，而且右子树结点在左子树之前，则遍历的方法是 RNL。本题考查的遍历方法并不是二叉树遍历的三种基本遍历方法，对于考生而言，重要的是要掌握遍历的思想。

4. 考查平衡二叉树的定义。

根据平衡二叉树的定义有，任意结点的左右子树高度差的绝对值不超过1。而其余三个答案均可以找到不符合的结点。

5. 考查完全二叉树的特点。

完全二叉树比起满二叉树只是在最下面一层的右边缺少了部分叶结点，而最后一层之上是个满二叉树，并且只有最后两层上有叶结点。第6层有叶结点则完全二叉树的高度可能为6或7，显然树高为7时结点更多。若第6层上有8个叶结点，则前六层为满二叉树，而第7层缺失了  $8 \\times 2 = 16$  个叶结点，故完全二叉树的结点个数最多为  $2^{7} - 1 - 16 = 111$  个结点。

6. 考查森林和二叉树的转换。

森林与二叉树的转换规则为“左孩子右兄弟”。在最后生成的二叉树中，父子关系在对应森林关系中可能是兄弟关系或原本就是父子关系。

情形I：若结点  $\\mathsf{v}$  是结点u的第二个孩子结点，在转换时，结点  $\\mathsf{v}$  就变成结点u第一个孩子的右孩子，符合要求。

情形II：结点u和v是兄弟结点的关系，但二者之中还有一个兄弟结点k，则转换后，结点v就变为结点k的右孩子，而结点k则是结点u的右孩子，符合要求。

情形III：结点  $\\mathsf{v}$  的父结点要么是原先的父结点或兄弟结点。若结点  $\\mathsf{u}$  的父结点与  $\\mathsf{v}$  的父结点是兄弟关系，则转换之后，不可能出现结点  $\\mathsf{u}$  是结点  $\\mathsf{v}$  的父结点的父结点。

7. 考查无向连通图的特性。

每条边都连接了两个结点，则在计算顶点的度之时，这条边都被计算了两次，故所有顶点的度之和

为边数的两倍，显然必为偶数。而 ii 和 iii 则不一定正确，如：对顶点数  $N \\geq 1$  无向完全图不存在一个顶点的度为 1，并且边数与顶点数的差要大于 1。

8. 考查 m 阶 B- 树的定义。

A、B 和 C 都是 B- 树的特点，而选项 D 则是 B+ 树的特点。注意区别 B- 树和 B+ 树各自的特点。

9. 考查小根堆的调整操作。

小顶堆在逻辑上可以用完全二叉树来表示，根据关键序列得到的小顶堆的二叉树形式为下图左图：

![](https://408.foreverlink.love/images/57c27932b4f39242372ed4222739fbbb.jpg)

插入关键字3时，先将其放在小顶堆的末端，再将该关键字向上进行调整，得到的结果上图右边所示。所以，调整后的小顶堆序列为：3，5，12，8，28，20，15，22，19。

10. 考查各排序算法的特点。

解答本题之前要对不同排序算法的特点极为清楚。对于起泡排序和选择排序而言，每一趟过后都能确定一个元素的最终位置，而由题目中所说，前两个元素和后两个元素均不是最小或最大的两个元素并按序排列。答案D中的二路归并排序，第一趟排序结束都可以得到若干个有序子序列，而此时的序列中并没有两两元素有序排列。插入排序在每趟排序结束后能保证前面的若干元素是有序的，而此时第二趟排序后，序列的前三个元素是有序的，符合其特点。

11. 考查指令执行过程。

通常完成一条指令可分为取指阶段和执行阶段。在取指阶段通过访问存储器可将指令取出；在执行阶段通过访问存储器可以将操作数取出。这样，虽然指令和数据都是以二进制代码形式存放在存储器中，但CPU可以判断在取指阶段访问存储器取出的二进制代码是指令；在执行阶段访存取出的二进制代码是数据。

12. 考查符号位的扩展。

结合题干及选项可知，int 为 32 位，short 为 16 位；又 C 语言的数据在内存中为补码形式，故 x、y 的机器数写为 0000007FH、FFF7H;

执行  $z = x + y$  时，由于  $x$  是int型， $y$  为short型，故需将  $y$  的类型强制转换为int，在机器中通过符号位扩展实现，由于  $y$  的符号位为1，故在  $y$  的前面添加16个1，即可将  $y$  强制转换为int型，其十六进制形式为FFFFFF7H;

然后执行加法，即0000007FH+FFFFFF7H=00000076H，其中最高位的进位1自然丢弃。故选D。

13. 考查浮点加法运算。

根据题意，X可记为00,111;00,11101(分号前为阶码，分号后为尾数)，Y可记为00,101;00,10100。

首先对阶，X、Y阶码相减，即00,111-00,101=00,111+11,0111=00,010，可知X的阶码比Y的价码大2，根据小阶向大阶看齐的原则，将Y的阶码加2，尾数右移2位，可得Y为00,111;00,00101。

尾数相加，即00,11101+00,00101=01,00010，尾数相加结果符号位为01，故需进行右规。

规格化，将尾数右移1位，阶码加1，得  $X + Y$  为01,000;00,1000，阶码符号位为01，说明发生溢出。

14. 考查 Cache 与主存之间的映射方式。

由于 Cache 共有 16 块，采用 2 路组相联，因此共有 8 组，0，1，2，...，7。并且主存的某一字块按模 8 映像到 Cache 某组的任一字块中，即主存的第 0，8，16... 字块可以映像到 Cache 第 0 组 2 个字块的任一字块中，而 129 号单元是位于第 4 块主存块中，因此将映射到 Cache 第 4 组 2 个字块的任一字块中。

注意：由于在计算机系统结构中和计算机组成原理的某些教材中介绍的组相联跟此处的组相联并不相同，导致部分考生理解错题目。考生应以真题为准，以后再出现类似题目，应以此种解答为标准。

15. 考查存储器的扩展。

首先确定 ROM 的个数，ROM 区为 4KB，选用  $2K \\times 8$  的 ROM 芯片，需要  $\\frac{4K \\times 8}{2K \\times 8} = 2$  片，采用字扩展方式；60KB 的 RAM 区，选用  $4K \\times 4$  的 RAM 芯片，需要  $\\frac{60K \\times 8}{4K \\times 4} = 30$  片，采用字和位同时扩展方式。

16. 考查相对寻址。

相对寻址  $\\mathrm{EA} = (\\mathrm{PC}) + \\mathrm{A}$ ，首先要求的是取指令后 PC 的值。转移指令由两个字节组成，每取一个字节 PC 自动加 1，因此取指令后 PC 值为 2002H，故  $\\mathrm{EA} = (\\mathrm{PC}) + \\mathrm{A} = 2002\\mathrm{H} + 06\\mathrm{H} = 2008\\mathrm{H}$ 。

17. 考查 RISC 的特性。

相对于CISC计算机，RISC计算机的特点指令条数少；指令长度固定，指令格式和寻址种类少；只有取数/存数指令访问存储器，其余指令的操作均在寄存器之间进行；CPU中通用寄存器多；大部分指令在一个或者小于一个机器周期内完成；以硬布线逻辑为主，不用或者少用微程序控制。

18. 考查流水线中时钟周期的特性。

时钟周期应以最长的执行时间为准，否则用时长的流水段的功能将不能正确完成。

19. 考查硬布线控制器的特点。

硬布线控制器的速度取决于电路延迟，所以速度快；微程序控制器采用了存储程序原理，每条指令都要访控存，所以速度慢。硬布线控制器采用专门的逻辑电路实现，修改和扩展困难。

20. 考查总线的基本概念。

总线带宽是指单位时间内总线上可传输数据的位数，通常用每秒钟传送信息的字节数来衡量，单位可用字节/秒（Bps）表示。根据题意可知，在  $2^{*}1 / 10\\mathrm{MHz}$  秒内传输了4B，所以  $4B^{*}10\\mathrm{MHz} / 2 = 20\\mathrm{MB / S}$  。

21. 考查 Cache 的命中率。

命中率=Cache 命中的次数/所有访问次数，有了这个公式这道题就很容易看出，要注意的一点是看清题，题中说明的是缺失50次，而不是命中50次，仔细审题是做对题的第一步。

22. 考查中断的分类。

选项中能引起外部中断的只能是输入设备键盘。

23. 考查并行性的限定。

单处理机系统中只有一条指令流水线，一个多功能的操作部件，每个时钟周期只能完成一条指令，故进程与进程显然不可以并行。

24. 考查几种基本的调度算法概念。

高响应比优先调度算法，同时考虑每个进程的等待时间和需要的执行时间，从中选出响应比最高的进程投入执行。响应比R定义如下：

响应比  $\\mathsf{R} =$  （等待时间  $^+$  执行时间）/执行时间

25. 考查死锁的条件。

这种题用到组合数学中鸽巢原理的思想，考虑最极端情况，因为每个进程最多需要3台打印机，如果每个进程已经占有了两个打印机，那么只要还有多的打印机，那么总能满足达到3台的条件，所以，将8台打印机分给K个进程，每个进程有2台打印机，这个情况就是极端情况，K为4。

26. 考查分区分配存储管理方式的保护措施。

分区分配存储管理方式的保护措施是设置界地址寄存器。每个进程都有自己独立的进程空间，如果一个进程在运行时所产生的地址在其地址空间之外，则发生地址越界，即当程序要访问某个内存单元时，由硬件检查是否允许，如果允许则执行，否则产生地址越界中断，由操作系统进行相应处理。

27. 考查分段存储管理系统。

段地址为 32 位二进制数，其中 8 位表示段号，则段内位移占用  $32 - 8 = 24$  位二进制数，故最大段长为  $2^{24}$  字节。

28. 考查文件物理结构的特性。

随机访问是索引结构的特性。

29. 考查磁盘的调度算法。

类似于电梯调度的思想。首先，磁头选择与当前磁头所在磁道距离最近的请求作为首次服务的对象（110），当磁头沿途相应访问请求序列直到达到一端末（110,170,180,195），再反向移动响应另一端的访问请求（68,45,35,12）。

30. 考查文件控制块的内容。

在文件控制块中，通常含有以下3类信息，即基本信息、存取控制信息及使用信息。

31. 考查软/硬链接建立的属性。

建立符号链接（软链接）时，引用计数值直接复制；建立硬链接时，引用计数值加1。删除文件时，删除操作对于符号链接是不可见的，这并不影响文件系统，当以后再通过符号链接访问时，发现文件不存在，直接删除符号链接；但是对于硬链接则不可以直接删除，引用计数值减1，若值不为0，则不能删除此文件，因为还有其它硬链接指向此文件。

32. 考查系统调用的设备标识。

用户程序对I/O设备的请求采用逻辑设备名，而在程序实际执行时使用物理设备名。

33. 考查OSI模型中传输层的功能。

传输层提供应用进程间的逻辑通信，即端到端的通信。而网络层提供点到点的逻辑通信。因此选B。

34. 考查奈氏准则和香农定理。

采用4个相位，每个相位有4种幅度的QAM调制方法，每个信号可以有16种变化，传输4bit的数据。根据奈奎斯特定理，信息的最大传输速率为  $2 \\times 3K \\times 4 = 24Kbps$  。

35. 考查后退 N 帧协议的工作原理。

在后退N帧协议中，发送方可以连续发送若干个数据帧，如果收到接收方的确认帧则可以继续发送。若某个帧出错，接收方只是简单的丢弃该帧及其后所有的后续帧，发送方超时后需重传该数据帧及其后续的所有数据帧。这里要注意，连续ARQ协议中，接收方一般采用累积确认的方式，即接收方对按序到达的最后一个分组发送确认，因此题目中收到3的确认帧就代表编号为0、1、2、3的帧已接收，而此时发送方未收到1号帧的确认只能代表确认帧在返回的过程中丢失了，而不代表1号帧未到达接收方。因此需要重传的帧为编号是4、5、6、7的帧。

36. 考查交换机的工作原理。

交换机实质上是一个多端口网桥，工作在数据链路层，数据链路层使用物理地址进行转发，而转发通常都是根据目的地址来决定出端口。

37. 考查CSMA/CD协议的工作原理。

首先由例8可知，若最短帧长减少，而数据传输速率不变，则需要使冲突域的最大距离变短来实现争用期的减少。争用期是指网络中收发结点间的往返时延，因此假设需要减少的最小距离为s，单位是m，则可以得到下式（注意单位的转换）： $2 \\times [s / (2 \\times 10^{8})] = 800 / (1 \\times 10^{9})$ ，因此可得  $s = 80$ ，即最远的两个站点

之间的距离最少需要减少  $80 \\mathrm{~m}$  。

38. 考查TCP的数据编号与确认。

TCP 是面向字节流的，其选择确认（Selective ACK）机制是接收端对字节序号进行确认，其返回的序号是接收端下一次期望接收的序号，因此主机乙接收两个段后返回给主机甲的确认序列号是 1000。

39. 考查TCP的拥塞控制方法。

本题计算原理如图4所示。无论在慢开始阶段还是在拥塞避免阶段，只要发送方判断网络出现拥塞（其根据就是没有按时收到确认），就要把慢开始门限ssthresh设置为出现拥塞时的发送方窗口值的一半（但不能小于2）。然后把拥塞窗口cwnd重新设置为1，执行慢开始算法。这样做的目的就是要迅速减少主机发送到网络中的分组数，使得发生拥塞的路由器有足够时间把队列中积压的分组处理完毕。

因此，在发送拥塞后，慢开始门限ssthresh变为  $16 / 2 = 8\\mathrm{KB}$ ，发送窗口变为1KB。在接下来的3个RTT内，拥塞窗口执行慢开始算法，呈指数形式增加到8KB，此时由于慢开始门限ssthresh为8KB，因此转而执行拥塞避免算法，即拥塞窗口开始“加法增大”。因此第4个RTT结束后，拥塞窗口的大小为9KB。

40. 考查 FTP 协议的特点。

FTP协议是基于传输层TCP协议的。FTP的控制连接使用端口21，用来传输控制信息（如连接请求，传送请求等），数据连接使用端口20，用来传输数据。`,score:null}]},{id:"2010-a41",type:"applied",year:2010,no:41,subject:"数据结构",paper:"408",stem:"将关键字序列 (7、8、30、11、18、9、14) 散列存储到散列表中。散列表的存储空间是一个下标从 0 开始的一维数组, 散列函数为:  $\\mathrm{H}\\left( \\text {key }\\right)  = \\left( {\\text{key} \\times  3}\\right) \\mathrm{{MOD}}7$  ,处理冲突采用线性探测再散列法, 要求装填 (载) 因子为 0.7 。",explanation:"",totalScore:10,parts:[{no:1,stem:"请画出所构造的散列表。",answer:`由装载因子0.7，数据总数为7，得一维数组大小为  $7 / 0.7 = 10$  ，数组下标为  $0\\sim 9$  。所构造的散列函数值如下所示：
<table><tr><td>key</td><td>7</td><td>8</td><td>30</td><td>11</td><td>18</td><td>9</td><td>14</td></tr><tr><td>H(key)</td><td>0</td><td>3</td><td>6</td><td>5</td><td>5</td><td>6</td><td>0</td></tr></table>

采用线性探测再散列法处理冲突，所构造的散列表为：

<table><tr><td>地址</td><td>0</td><td>1</td><td>2</td><td>3</td><td>4</td><td>5</td><td>6</td><td>7</td><td>8</td><td>9</td></tr><tr><td>关键字</td><td>7</td><td>14</td><td></td><td>8</td><td></td><td>11</td><td>30</td><td>18</td><td>9</td><td></td></tr></table>`,score:null},{no:2,stem:"分别计算等概率情况下查找成功和查找不成功的平均查找长度。",answer:`查找成功时，是根据每个元素查找次数来计算平均长度，在等概率的情况下，各关键字的查找次数为：
<table><tr><td>key</td><td>7</td><td>8</td><td>30</td><td>11</td><td>18</td><td>9</td><td>14</td></tr><tr><td>次数</td><td>1</td><td>1</td><td>1</td><td>1</td><td>3</td><td>3</td><td>2</td></tr></table>

故，  $\\mathrm{ASL}_{\\text{成功}} =$  查找次数 / 元素个数  $= (1 + 2 + 1 + 1 + 1 + 3 + 3) / 7 = 12 / 7$

这里要特别防止惯性思维。查找失败时，是根据查找失败位置计算平均次数，根据散列函数 MOD 7，初始只可能在 0~6 的位置。等概率情况下，查找 0~6 位置查找失败的查找次数为：

<table><tr><td>H(key)</td><td>0</td><td>1</td><td>2</td><td>3</td><td>4</td><td>5</td><td>6</td></tr><tr><td>次数</td><td>3</td><td>2</td><td>1</td><td>2</td><td>1</td><td>5</td><td>4</td></tr></table>

故，  $\\mathrm{ASL}_{\\text{不成功}} =$  查找次数/散列后的地址个数  $= (3 + 2 + 1 + 2 + 1 + 5 + 4) / 7 = 18 / 7$`,score:null}]},{id:"2010-a42",type:"applied",year:2010,no:42,subject:"数据结构",paper:"408",stem:"设将  $n(n > 1)$  个整数存放到一维数组R中。试设计一个在时间和空间两方面都尽可能高效的算法。将R中保存的序列循环左移  $p(0 < p < n)$  个位置，即将R中的数据由（X0，X1...Xn-1）变换为（Xp, Xp+1 ...Xn-1, X0, X1...Xp-1）。要求：",explanation:"",totalScore:13,parts:[{no:1,stem:"给出算法的基本设计思想。",answer:`算法的基本设计思想：
可以将这个问题看做是把数组ab转换成数组ba（a代表数组的前p个元素，b代表数组中余下的n-p个元素），先将a逆置得到  $\\mathbf{a}^{-1}\\mathbf{b}$  ，再将b逆置得到  $\\mathrm{a^{-1}b^{-1}}$  ，最后将整个  $\\mathrm{a^{-1}b^{-1}}$  逆置得到  $(\\mathrm{a^{-1}b^{-1}})^{-1} = \\mathrm{ba}$  。设Reverse函数执行将数组元素逆置的操作，对abcdefgh向左循环移动3（  $p = 3$  ）个位置的过程如下：

Reverse(0,p-1)得到cbadefgh;

Reverse(p,n-1)得到cbahgfed;

Reverse(0,n-1)得到defghabc;

注：Reverse中，两个参数分别表示数组中待转换元素的始末位置。`,score:null},{no:2,stem:"根据设计思想，采用C或  $\\mathbf{C} + +$  或JAVA语言描述算法，关键之处给出注释。",answer:`使用c语言描述算法如下：
void Reverse(int R[],int from,int to)  $\\{$

int i, temp;

for  $(\\mathrm{i} = 0;\\mathrm{i} <   (\\mathrm{to - from} + 1) / 2;\\mathrm{i} + + )$

\`\`\`txt
$\\{\\mathrm{temp} = \\mathrm{R[from + i]};\\mathrm{R[from + i]} = \\mathrm{R[to - i]};\\mathrm{R[to - i]} = \\mathrm{temp};\\}$
} // Reverse
void Converse(int R[],int n,int p){ Reverse(R,0,p-1); Reverse(R,p,n-1); Reverse(R,0,n-1);
\`\`\``,score:null},{no:3,stem:"说明你所设计算法的时间复杂度和空间复杂度。",answer:`上述算法中三个Reverse函数的时间复杂度分别为  $\\mathrm{O}(p / 2)$  、  $\\mathrm{O}((n - p) / 2)$  和  $\\mathrm{O}(n / 2)$ ，故所设计的算法的时间复杂度为  $\\mathrm{O}(n)$ ，空间复杂度为  $\\mathrm{O}(1)$ 。
另解，借助辅助数组来实现：

算法思想：创建大小为  $p$  的辅助数组  $S$ ，将  $R$  中前  $p$  个整数依次暂存在  $S$  中，同时将  $R$  中后  $n - p$  个整数左移，然后将  $S$  中暂存的  $p$  个数依次放回到  $R$  中的后续单元。

时间复杂度为  $O(n)$ , 空间复杂度为  $O(p)$  。`,score:null}]},{id:"2010-a43",type:"applied",year:2010,no:43,subject:"计算机组成原理",paper:"408",stem:`某计算机字长为16位，主存地址空间大小为  $128\\mathrm{KB}$ ，按字编址。采用单字长指令格式，指令各字段定义如下：

源操作数
目的操作数

<table><tr><td>15</td><td>12</td><td>11</td><td>6</td><td>5</td><td>0</td></tr><tr><td>OP</td><td>Ms</td><td>Rs</td><td>Md</td><td>Rd</td><td></td></tr></table>

转移指令采用相对寻址方式，相对偏移量用补码表示，寻址方式定义如下：

<table><tr><td>Ms/Md</td><td>寻址方式</td><td>助记符</td><td>含义</td></tr><tr><td>000B</td><td>寄存器直接</td><td>Rn</td><td>操作数=（Rn）</td></tr><tr><td>001B</td><td>寄存器间接</td><td>(Rn)</td><td>操作数=(Rn)</td></tr><tr><td>010B</td><td>寄存器间接、自增</td><td>(Rn)+</td><td>操作数=((Rn),(Rn)+1→Rn</td></tr><tr><td>011B</td><td>相对</td><td>D(Rn)</td><td>转移目标地址=(PC)+(Rn)</td></tr></table>

注：（X）表示存储器地址X或寄存器X的内容。

请回答下列问题：`,explanation:"",totalScore:11,parts:[{no:1,stem:"该指令系统最多可有多少条指令？该计算机最多有多少个通用寄存器？存储器地址寄存器（MAR）和存储器数据寄存器（MDR）至少各需要多少位？",answer:"操作码占4位，则该指令系统最多可有  $2^{4} = 16$  条指令；操作数占6位，寻址方式占3位，于是寄存器编号占3位，则该机最多有  $2^{3} = 8$  个通用寄存器；主存容量128KB，按字编址，计算机字长为16位，划分为 $128\\mathrm{KB} / 2\\mathrm{B} = 2^{16}$  个存储单元，故MDR和MAR至少各需16位。",score:null},{no:2,stem:"转移指令的目标地址范围是多少？",answer:"PC和Rn可表示的地址范围均为  $0\\sim 2^{16} - 1$  ，而主存地址空间为  $2^{16}$  ，故转移指令的目标地址范围是  $0000\\mathrm{H}\\sim$  FFFFH（  $0\\sim 2^{16} - 1$  ）。",score:null},{no:3,stem:"若操作码0010B表示加法操作（助记符为add），寄存器R4和R5的编号分别为100B和101B，R4的内容为1234H，R5的内容为5678H，地址1234H中的内容为5678H，地址5678H中的内容为1234H，则汇编语言为“add（R4），（R5）+”（逗号前为源操作数，逗号后为目的操作数）对应的机器码是什么（用十六进制表示）？该指令执行后，哪些寄存器和存储单元中的内容会改变？改变后的内容是什么？",answer:`汇编语句“add(R4), (R5)+”，对应的机器码为0010001100010101B=2315H。
该指令执行后，寄存器R5和存储单元  $5678\\mathrm{H}$  的内容会改变。执行后，R5的内容从  $5678\\mathrm{H}$  变成  $5679\\mathrm{H}$  。存储单元  $5678\\mathrm{H}$  中的内容变成该加法指令计算的结果  $5678\\mathrm{H} + 1234\\mathrm{H} = 68\\mathrm{ACH}$  。`,score:null}]},{id:"2010-a44",type:"applied",year:2010,no:44,subject:"计算机组成原理",paper:"408",stem:`某计算机的主存地址空间大小为  $256\\mathrm{MB}$ ，按字节编址。指令Cache和数据Cache分离，均有8个Cache行，每个Cache行大小为64B，数据Cache采用直接映射方式。现有两个功能相同的程序A和B，其伪代码如下所示：

\`\`\`c
程序A:
int a[256][256]
......
int sum_array1()
{
    int i, j, sum = 0;
    for (i = 0; i < 256; i++)
        for (j = 0; j < 256; j++)
            sum += a[i][j];
    return sum;
}
\`\`\`

\`\`\`txt
程序B:
int a[256][256]
......
int sum_array2()
{
    int i, j, sum = 0;
    for (j = 0; j < 256; j++)
        for (i = 0; i < 256; i++)
            sum += a[i][j];
    return sum;
}
\`\`\`

假定int类型数据用32位补码表示，程序编译时i，j，sum均分配在寄存器中，数组a按行优先方式存放，其首地址为320（十进制数）。请回答下列问题，要求说明理由或给出计算过程。`,explanation:"",totalScore:12,parts:[{no:1,stem:"若不考虑用于 cache 一致性维护和替换算法的控制位，则数据 Cache 的总容量为多少？",answer:"数据 Cache 有 8 个 Cache 行，每个 Cache 行大小为 64B，Cache 中每个字块的 Tag 字段的位数是  $28 - 9 = 19$  位，此外还需使用一个有效位，合计 20 位。因此，数据 Cache 的总容量应为： $8 \\times (64 + 20 / 8)\\mathrm{B} = 532\\mathrm{B}$ 。",score:null},{no:2,stem:"数组元素 a[0][31] 和 a[1][1] 各自所在的主存块对应的 Cache 行号分别是多少（Cache 行号从 0 开始）？",answer:"数组 a 在主存的存放位置及其与 Cache 之间的映射关系如下图所示：\n数组按行优先方式存放，首地址为320，数组元素占四个字节。a[0][31]所在的主存块对应的Cache行号为：\n\n```txt\n$(320 + 31 \\times 4)$  DIV  $64 = 6$\n```\n\na[1][1]所在的主存块对应的Cache行号为：\n\n```txt\n$(320 + 256 \\times 4 + 1 \\times 4)$  DIV 64 MOD  $8 = 5$  。\n```",score:null},{no:3,stem:"程序 A 和 B 的数据访问命中率各是多少？哪个程序的执行时间更短？",answer:`编译时 i、j、sum 均分配在寄存器中，故数据访问命中率仅考虑数组 a 的情况。
① 该程序的特点是数组中的每一个元素仅被使用一次。数组a按行优先存放，数据Cache正好放下数组半行中的全部元素，即元素的存储顺序与使用次序高度的吻合，每个字块的16个int型元素中，除访问的第一个不会命中，接下来的15个都会命中。访问全部字块都符合这一规律，故命中率为  $15 / 16$  ，即程序A的数据访问命中率是  $93.75\\%$  。
② 程序 B 按照数组的列执行外层循环，在执行内层循环的过程中，将连续访问不同行的同一列的数据，不同行的同一列数组使用的是同一个 Cache 单元，每次都不会命中，故命中率是 0

由于从 Cache 读数据比从主存读数据快很多，所以程序 A 的执行比程序 B 快得多。

注意：本题考查 Cache 容量计算，直接映射方式的地址计算，以及命中率计算（注意：行优先遍历与列优先遍历命中率差别很大）。

![](https://408.foreverlink.love/images/4225d519121193a8b4dfb303cc330070.jpg)`,score:null}]},{id:"2010-a45",type:"applied",year:2010,no:45,subject:"操作系统",paper:"408",stem:"假设计算机系统采用CSCAN（循环扫描）磁盘调度策略，使用2KB的内存空间记录16384个磁盘块的空闲状态。",explanation:"",totalScore:7,parts:[{no:1,stem:"请说明在上述条件下如何进行磁盘块空闲状态的管理。",answer:"用位图表示磁盘的空闲状态。每一位表示一个磁盘块的空闲状态，共需要  $16384 / 32 = 512$  个字  $= 512 \\times 4$  个字节  $= 2\\mathrm{KB}$ ，正好可放在系统提供的内存中。",score:null},{no:2,stem:"设某单面磁盘旋转速度为每分钟 6000 转, 每个磁道有 100 个扇区, 相邻磁道间的平均移动时间为  $1 \\mathrm{~ms}$  。若在某时刻, 磁头位于 100 号磁道处, 并沿着磁道号增大的方向移动 (如下图所示), 磁道号请求队列为 50, 90, 30, 120, 对请求队列中的每个磁道需读取 1 个随机分布的扇区, 则读完这 4 个扇区点共需要多少时间? 要求给出计算过程。",answer:`采用CSCAN调度算法，访问磁道的顺序和移动的磁道数如下表所示：
<table><tr><td>被访问的下一个磁道号</td><td>移动距离（磁道数）</td></tr><tr><td>120</td><td>20</td></tr><tr><td>30</td><td>90</td></tr><tr><td>50</td><td>20</td></tr><tr><td>90</td><td>40</td></tr></table>

移动的磁道数为  $20 + 90 + 20 + 40 = 170$  ，故总的移动磁道时间为  $170\\mathrm{ms}$  。

由于转速为  $6000\\mathrm{r / m}$  ，则平均旋转延迟为  $5\\mathrm{ms}$  ，总的旋转延迟时间  $= 20\\mathrm{ms}$  。

由于转速为  $6000\\mathrm{r / m}$  ，则读取一个磁道上一个扇区的平均读取时间为  $0.1\\mathrm{ms}$  ，总的读取扇区的时间平均读取时间为  $0.1\\mathrm{ms}$  ，总的读取扇区的时间为  $0.4\\mathrm{ms}$  。

综上，读取上述磁道上所有扇区所花的总时间为  $190.4\\mathrm{ms}$  。`,score:null},{no:3,stem:`如果将磁盘替换为随机访问的 Flash 半导体存储器（如 U 盘、SSD 等），是否有比 CSCAN 更高效的磁盘调度策略？若有，给出磁盘调度策略的名称并说明理由；若无，说明理由。
![](https://408.foreverlink.love/images/5cefcc4b821a371bc6ac8f59d5050d10.jpg)`,answer:"采用 FCFS（先来先服务）调度策略更高效。因为 Flash 半导体存储器的物理结构不需要考虑寻道时间和旋转延迟，可直接按 I/O 请求的先后顺序服务。",score:null}]},{id:"2010-a46",type:"applied",year:2010,no:46,subject:"操作系统",paper:"408",stem:`设某计算机的逻辑地址空间和物理地址空间均为 64KB, 按字节编址。若某进程最多需要 6 页 (Page) 数据存储空间, 页的大小为 1KB, 操作系统采用固定分配局部置换策略为此进程分配 4 个页框 (Page Frame)。在时刻 260 前的该进程访问情况如下表所示（访问位即使用位）。

<table><tr><td>页号</td><td>页框号</td><td>装入时刻</td><td>访问位</td></tr><tr><td>0</td><td>7</td><td>130</td><td>1</td></tr><tr><td>1</td><td>4</td><td>230</td><td>1</td></tr><tr><td>2</td><td>2</td><td>200</td><td>1</td></tr><tr><td>3</td><td>9</td><td>160</td><td>1</td></tr></table>

当该进程执行到时刻260时，要访问逻辑地址为17CAH的数据。请回答下列问题：`,explanation:"",totalScore:8,parts:[{no:1,stem:"该逻辑地址对应的页号是多少？",answer:`由于该计算机的逻辑地址空间和物理地址空间均为  $64\\mathrm{KB} = 2^{16}\\mathrm{B}$ , 按字节编址, 且页的大小为  $1\\mathrm{K} = 2^{10}$ , 故逻辑地址和物理地址的地址格式均为:
<table><tr><td>页号/页框号（6位）</td><td>页内偏移量（10位）</td></tr></table>

17CAH=000101111001010B，可知该逻辑地址的页号为  $000101\\mathrm{B} = 5$`,score:null},{no:2,stem:"若采用先进先出（FIFO）置换算法，该逻辑地址对应的物理地址是多少？要求给出计算过程。",answer:"根据 FIFO 算法，需要替换装入时间最早的页，故需要置换装入时间最早的 0 号页，即将 5 号页装入 7 号页框中，所以物理地址为 000111111001010B = 1FCAH。",score:null},{no:3,stem:`若采用时钟（CLOCK）置换算法，该逻辑地址对应的物理地址是多少？要求给出计算过程（设搜索下一页的指针沿顺时针方向移动，且当前指向 2 号页框，示意图如下）。
![](https://408.foreverlink.love/images/114dd6a3b02f1d010b7a7f61b7ac636b.jpg)
图3.15 页框示意图`,answer:`根据 CLOCK 算法，如果当前指针所指页框的使用位为 0，则替换该页；否则将使用位清零，并将指针指向下一个页框，继续查找。根据题设和示意图，将从 2 号页框开始，前 4 次查找页框号的顺序为
$2 \\rightarrow 4 \\rightarrow 7 \\rightarrow 9$  ，并将对应页框的使用位清零。在第5次查找中，指针指向2号页框，因2号页框的使用位为0，故淘汰2号页框对应的2号页，把5号页装入2号页框中，并将对应使用位设置为1，所以对应的物理地址为  $0000101111001010B = 0\\mathrm{BCAH}$  。`,score:null}]},{id:"2010-a47",type:"applied",year:2010,no:47,subject:"计算机网络",paper:"408",stem:"某局域网采用 CSMA/CD 协议实现介质访问控制, 数据传输速率为  $10 \\mathrm{Mbps}$ , 主机甲和主机乙之间的距离为  $2 \\mathrm{~km}$ , 信号传播速度是  $200000 \\mathrm{~km} / \\mathrm{s}$  。请回答下列问题, 要求说明理由或写出计算过程。",explanation:"",totalScore:9,parts:[{no:1,stem:"若主机甲和主机乙发送数据时发生冲突，则从开始发送数据时刻起，到两台主机均检测到冲突时刻止，最短需经过多长时间？最长需经过多长时间（假设主机甲和主机乙发送数据过程中，其他主机不发送数据）？",answer:`当主机甲和主机乙同时向对方发送数据时，信号在信道中发生冲突后，冲突信号继续向两个方向传播。这种情况下两台主机均检测到冲突需要经过的时间最短，等于单程的传播时延  $t_0 = 2km / 200000km / s = 0.01ms$  。
主机甲（或主机乙）先发送一个数据帧，当该数据帧即将到达主机乙（或主机乙）时，主机乙（或主机甲）也开始发送一个数据帧，这时，主机乙（或主机甲）将立刻检测到冲突，而主机甲（或主机乙）要检测到冲突，冲突信号还需要从主机乙（或主机甲）传播到主机甲（或主机乙），因此甲乙两台主机均检测到冲突所需的最长时间等于双程的传播时延  $2^{*}t0 = 0.02ms$  。`,score:null},{no:2,stem:"若网络不存在任何冲突与差错，主机甲总是以标准的最长以太网数据帧（1518字节）向主机乙发送数据，主机乙每成功收到一个数据帧后立即向主机甲发送一个64字节的确认帧，主机甲收到确认帧后方可发送下一个数据帧。此时主机甲的有效数据传输速率是多少（不考虑以太网的前导码）？",answer:`主机甲发送一个数据帧的时间，即发送时延  $t1 = 1518 \\times 8b / 10\\text{Mbps} = 1.2144 \\text{ms}$ ；主机乙每成功收到一个数据帧后，向主机甲发送确认帧，确认帧的发送时延  $t2 = 64 \\times 8b / 10\\text{Mbps} = 0.0512\\text{ms}$ ；主机甲收到确认帧后，即发送下一数据帧，故主机甲的发送周期  $T =$  数据帧发送时延  $t1 +$  确认帧发送时延  $t2 +$  双程传播时延  $= t1 + t2 + 2*t0 = 1.2856 \\text{ms}$ ；于是主机甲的有效数据传输率为
$1500 \\times 8 / T = 12000 b / 1.2856 m s \\approx 9.33 M b p s$  （以太网有效数据1500字节，即以太网帧的数据部分）

2010年全国硕士研究生入学统一考试计算机学科专业基础综合试题——选择题部分解析

一、单项选择题

1. 考查限定条件的出栈序列。

A 可由 in, in, in, in, out, out, in, out, out, in, out, out 得到;
B 可由 in, in, in, out, out, in, out, out, in, out 得到;
C 可由 in, in, out, in, out, out, in, in, out, in, out, out 得到;
D 可由 in, out, in, in, in, in, in, out, out, out, out, out 得到，但题意要求不允许连续三次退栈操作，故 D 错。

2. 考查受限的双端队列的出队序列。

A 可由左入，左入，右入，右入，右入得到 B 可由 左入，左入，右入，左入，右入得到。
D 可由左入, 左入, 左入, 右入, 左入得到 所以不可能得到 C。

3. 考查线索二叉树的基本概念和构造。

题中所给二叉树的后序序列为 dbca。结点 d 无前驱和左子树，左链域空，无右子树，右链域指向其后继结点 b；结点 b 无左子树，左链域指向其前驱结点 d；结点 c 无左子树，左链域指向其前驱结点 b，无右子树，右链域指向其后继结点 a。

4. 考查平衡二叉树的插入算法。

插入48以后，该二叉树根结点的平衡因子由-1变为-2，失去平衡，需进行两次旋转（先右旋后左旋）操作。

5. 考查树结点数的特性。

设树中度为  $i$  （ $i = 0, 1, 2, 3, 4$ ）的结点数分别为  $N_{i}$ ，树中结点总数为  $N$ ，则树中各结点的度之和等于  $N - 1$ ，即  $N = 1 + N_{1} + 2N_{2} + 3N_{3} + 4N_{4} = N_{0} + N_{1} + N_{2} + N_{3} + N_{4}$ ，根据题设中的数据，即可得到  $N_{0} = 82$ ，即树  $T$  的叶结点的个数是 82。

6. 考查哈弗曼树的特性。

哈夫曼树为带权路径长度最小的二叉树，不一定是完全二叉树。哈夫曼树中没有度为1的结点，B正确；构造哈夫曼树时，最先选取两个权值最小的结点作为左右子树构造一棵新的二叉树，C正确；哈夫曼树中任一非叶结点P的权值为其左右子树根结点权值之和，其权值不小于其左右子树根结点的权值，在与结点P的左右子树根结点处于同一层的结点中，若存在权值大于结点P权值的结点Q，那么结点Q的兄弟结点中权值较小的一个应该与结点P作为左右子树构造新的二叉树，综上可知，哈夫曼树中任一非叶结点的权值一定不小于下一层任一结点的权值。

7. 考查图的连通性。

要保证无向图 G 在任何情况下都是连通的，即任意变动图 G 中的边，G 始终保持连通，首先需要 G 的任意六个结点构成完全连通子图 G1，需 15 条边，然后再添一条边将第 7 个结点与 G1 连接起来，共需 16 条边。

8. 考查拓扑排序序列。

题中图有三个不同的拓扑排序序列，分别为abcd，abcd，aebcd。

9. 考查折半查找的过程。

具有  $n$  个结点的判定树的高度为  $\\left\\lfloor \\log_2 n \\right\\rfloor + 1$  ，长度为 16，高度为 5，所以最多比较 5 次。

10. 考查快速排序。

递归次数与各元素的初始排列有关。如果每一次划分后分区比较平衡，则递归次数少，如果划分后分区不平衡，则递归次数多。递归次数与处理顺序无关。

11. 考查各种排序算法的过程。

看第一趟可知仅有88被移到最后

如果是希尔排序，则12，88，10应变为10，12，88。因此排除希尔排序。

如果是归并排序，则应长度为2的子序列是有序的，由此可排除归并。

如果是基数排序，则16，5，10应变为10，5，16，由此排除基数。

可以看到，每一趟都有一个元素移到其最终位置，符合冒泡排序特点。

12. 考查计算机的性能指标。

I.CPU的时钟频率，也就是CPU主频率，一般说来，一个时钟周期内完成的指令数是固定的，所以主频越高，CPU的速度也就快，程序的执行时间就越短。
II. 数据在功能部件之间传送的路径称为数据通路，数据通路的功能是实现 CPU 内部的运算器和寄存器以及寄存器之间的数据交换。优化数据通路结构，可以有效提高计算机系统的吞吐量，从而加快程序的执行。
III.计算机程序需要先转化成机器指令序列才能最终得到执行，通过对程序进行编译优化可以得到更优的指令序列，从而使得程序的执行时间也越短。

13. 考查定点数的运算。

用补码表示时8位寄存器所能表示的整数范围为-128~+127。由于  $r1 = -2$ ， $r2 = -14$ ， $r3 = -112$ ， $r4 = -8$ ，则  $r2 \\times r3 = 1568$ ，结果溢出。

14. 考查不同精度的数在计算机中的表示方法及其相互装换。

由于（int） $f = 1$ ，小数点后面4位丢失，故Ⅱ错。IV的计算过程是先将f转化为双精度浮点数据格式，然后进行加法运算，故（d+f）-d得到的结果为双精度浮点数据格式，而f为单精度浮点数据格式，故Ⅳ错。

15. 考查存储器的组成和设计。

用  $2 \\mathrm{~K} \\times 4$  位的芯片组成一个  $8 \\mathrm{~K} \\times 8$  位存储器，每行中所需芯片数为 2，每列中所需芯片数为 4，各行芯片的地址分配为：

第一行（2个芯片并联） 0000H~07FFH

第二行（2个芯片并联） 0800H~0FFFH

第三行（2个芯片并联） 1000H~17FFH

第四行（2个芯片并联） 1800H~1FFFH

于是地址0B1FH所在芯片的最小地址即为0800H。

16. 考查半导体随机存取存储器。

一般 Cache 采用高速的 SRAM 制作，比 ROM 速度快很多，因此 III 是错误的，排除法即可选 A。RAM 需要刷新，而 ROM 不需要刷新。

17. 考查 TLB、Cache 及 Page 之间的关系。

TLB 即为快表，快表只是慢表（Page）的小小副本，因此 TLB 命中，必然 Page 也命中，而当 Page 命中，TLB 则未必命中，故 D 不可能发生；而 Cache 的命中与否与 TLB、Page 的命中与否并无必然联系。

18. 考查CPU内部寄存器的特性。

汇编程序员可以通过指定待执行指令的地址来设置PC的值，而IR，MAR，MDR是CPU的内部工作寄存器，对程序员不可见。

19. 考查指令流水线的基本概念。

有三种相关可能引起指令流水线阻塞：1. 结构相关，又称资源相关；2. 数据相关；3. 控制相关，主要由转移指令引起。

数据旁路技术，其主要思想是不必待某条指令的执行结果送回到寄存器，再从寄存器中取出该结果，作为下一条指令的源操作数，而是直接将执行结果送到其他指令所需要的地方，这样可以使流水线不发生停顿。

20. 考查典型的总线标准，

目前典型的总线标准有：ISA、EISA、VESA、PCI、PCI-Express、AGP、USB、RS-232C等。

21. 考查中断处理过程。

单级中断系统中，不允许中断嵌套。中断的处理过程为：1. 关中断；2. 保存断点；3. 识别中断源；4. 保存现场；5. 中断事件处理；（开中断、执行中断服务程序、关中断）6. 恢复现场；7. 开中断；8. 中断返回。其中，1~3步由硬件完成，4~8由中断服务程序完成。
22. 考查显示器相关概念。

刷新所需带宽 = 分辨率×色深×帧频 = 1600×1200×24b×85HZ = 3916.8Mbps，显存总带宽的  $50\\%$  用来刷屏，于是需要的显存总带宽为  $3916.8 / 0.5 = 7833.6\\mathrm{Mbps} \\approx 7834\\mathrm{Mbps}$ 。

23. 考查操作系统的接口。

系统调用是能完成特定功能的子程序，当应用程序要求操作系统提供某种服务时，便调用具有相应功能的系统调用。库函数则是高级语言中提供的与系统调用对应的函数（也有些库函数与系统调用无关），目的是隐藏访管指令的细节，使系统调用更为方便抽象。但要注意，库函数属于用户程序而非系统调用，是系统调用的上层。

24. 考查引起创建进程的事件。

引起进程创建的事件有：用户登录、作业调度、提供服务、应用请求等，本题的选项分别对应：I用户登录成功在分时系统中，用户登录成功，系统将为终端建立一个进程。II设备分配设备分配是通过在系统中设置相应的数据结构实现的，不需要创建进程。III启动程序执行典型的引起创建进程的事件。

25. 考查信号量的原理。

信号量表示当前的可用相关资源数。当信号量  $K > 0$  时，表示还有  $K$  个相关资源可用；而当信号量  $K < 0$  时，表示有  $|K|$  个进程在等待该资源。所以该资源可用数是 1，等待该资源的进程数是 0。

26. 考查进程调度。

进程时间片用完，从执行态进入就绪态应降低优先级以让别的进程被调度进入执行状态。B 中进程刚完成 I/O，进入就绪队列后应该等待被处理机调度，故应提高优先权；C 中有类似的情况；D 中不应该在此时降低，应该在时间片用完后降低。

27. 考查进程间通信与Peterson算法。

此算法实现互斥的主要思想在于设置了一个 tum 变量，用于进程间的互相“谦让”。

一般情况下，如果进程 p0 试图访问临界资源，设置 flag[0] = true，表示希望访问。此时如果进程 p1 还未试图访问临界资源，则 flag[1] 在进程上一次访问完临界资源退出临界区后已设置为 false。所以进程 p0 在执行循环判断条件时，第一个条件不满足，进程 p0 可以正常进入临界区，且满足互斥条件。

我们需要考虑的是两个进程同时试图访问临界资源的情况。注意 turn 变量的含义：进程在试图访问时，首先设置自己的 flag 变量为 true，表示希望访问；但又设置 turn 变量为对方的进程编号，表示“谦让”，因为在循环判断条件中 turn 变量不是自己编号时就循环等待。这时两个进程就会互相“谦让”一番，但是这不会造成饥饿的局面，因为 turn 变量会有一个最终值，所以必定有进程可以结束循环进入临界区。实际的情况是，先作出“谦让”的进程先进入临界区，后作出“谦让”的进程则需要循环等待。

其实这里可以想象为两个人进门，每个人进门前都会和对方客套一句“你走先”。如果进门时没别人，就当和空气说句废话，然后大步登门入室；如果两人同时进门，就互相请先，但各自只客套一次，所以先客套的人请完对方，就等着对方请自己，然后光明正大进门。

28. 考查动态分区分配。

考生需对动态分区分配的四种算法加以理解。最佳适配算法是指：每次为作业分配内存空间时，总是找到能满足空间大小需要的最小的空闲分区给作业。可以产生最小的内存空闲分区。下图显示了这个过程的主存空间的变化：

![](https://408.foreverlink.love/images/46e95a36aeee9a857246351cf2f46ec7.jpg)
图2010-28 最佳适配算法分配示意图

图中，灰色部分为分配出去的空间，白色部分为空闲区。这样，容易发现,此时主存中最大空闲分区的大小为9Mb。

29. 考查非连续分配的分页存储管理方式。

页大小为  $2^{10}$  字节，页表项大小为 2 字节，采用二级页表，一页可存放  $2^{9}$  个页表项，逻辑地址空间大小为  $2^{16}$  页，要使表示整个逻辑地址空间的页目录表中包含的的个数最少，则需要  $2^{16} / 2^{9} = 2^{7} = 128$  个页面保存页表项，即页目录表中包含的个数最少为 128。

30. 考查磁盘文件的大小性质。

因每个磁盘索引块和磁盘数据块大小均为256字节。所以4个直接地址索引指向的数据块大小为 $4\\times 256$  字节。2个一级间接索引共包括  $2\\times (256\\div 4)$  个直接地址索引，既其指向的数据块大小为  $2\\times (256\\div 4)$ $\\times 256$  字节。1个二级间接地址索引所包含的直接地址索引数为  $(256\\div 4)\\times (256\\div 4)$  ，即其所指向的数据块大小为  $(256\\div 4)\\times (256\\div 4)\\times 256$  字节。即7个地址项所指向的数据块总大小为  $4\\times 256 + 2\\times (256\\div 4)$ $\\times 256 + (256\\div 4)\\times (256\\div 4)\\times 256 = 1082368$  字节  $= 1057KB$

31. 考查当前目录的作用。

一个文件系统含有许多级时，每访问一个文件，都要使用从树根开始直到树叶为止，包括各中间节点名的全路径名。当前目录又称工作目录，进程对各个文件的访问都相对于当前目录进行，所以检索速度要快于检索全路径名。

32. 考查中断处理。

键盘是典型的通过中断I/O方式工作的外设，当用户输入信息时，计算机响应中断并通过中断处理程序获得输入信息。

33. 考查计算机网络体系结构的基本概念。

我们把计算机网络的各层及其协议的集合称为体系结构。因此A、B、D正确，而体系结构是抽象的，它不包括各层协议及功能的具体实现细节。

34. 考查存储转发机制。

由题设可知，分组携带的数据长度为980B，文件长度为980000B，需拆分为1000个分组，加上头

部后，每个分组大小为1000B，总共需要传送的数据量大小为1MB。由于所有链路的数据传输速度相同，因此文件传输经过最短路径时所需时间最少，最短路径经过2个分组交换机。

当  $t = 1M \\times 8 / 100M$  bps = 80ms 时，H1 发送完最后一个 bit；

由于传输延时，当H1发完所有数据后，还有两个分组未到达目的地，其中最后一个分组，需经过2个分组交换机的转发，在两次转发完成后，所有分组均到达目的主机。每次转发的时间为  $t0 = 1K \\times 8 / 100 \\, \\text{Mbps} = 0.08 \\, \\text{ms}$ 。

所以，在不考虑分组拆装时间和等待延时的情况下，当  $t = 80 \\, \\text{ms} + 2t0 = 80.16 \\, \\text{ms}$  时，H2接收完文件，即所需的时间至少为  $80.16 \\, \\text{ms}$ 。

35. 考查 RIP 路由协议。

RIP 使用距离向量算法的工作过程参见内容精讲部分。

R1在收到信息并更新路由表后，若需要经过R2到达net1，则其跳数为17，由于距离为16表示不可达，因此R1不能经过R2到达net1，R2也不可能到达net1。B、C错误，D正确。而题目中并未给出R1向R2发送的信息，因此A也不正确。

36. 考查ICMP协议。

ICMP差错报告报文有5种，终点不可达、源点抑制、时间超过、参数问题、改变路由（重定向），其中源点抑制是当路由器或主机由于拥塞而丢弃数据报时，就向源点发送源点抑制报文，使源点知道应当把数据报的发送速率放慢。

37. 考查子网划分与子网掩码、CIDR。

由于该网络的IP地址为192.168.5.0/24，因此其网络号为前24位。第25-32位为子网位+主机位。而子网掩码为255.255.255.248，其第25-32位的248用二进制表示为11111000，因此后8位中，前5位用于子网号，后3位用于主机号。

RFC 950 文档规定，对分类的 IPv4 地址进行子网划分时，子网号不能为全 1 或全 0。但随着无分类域间路由选择 CIDR 的广泛使用，现在全 1 和全 0 的子网号也可以使用了，但一定要谨慎使用，要弄清你的路由器所有的路由选择软件是否支持全 0 或全 1 的子网号这种用法。但不论是分类的 IPv4 地址还是无分类域间路由选择 CIDR，其子网中的主机号均不能为全 1 或全 0。因此该网络空间的最大子网个数为  $2^{5} = 32$  个，每个子网内的最大可分配地址个数为  $2^{3} - 2 = 6$  个。

38. 考查网络设备与网络风暴。

物理层设备中继器和集线器既不隔离冲突域也不隔离广播域；网桥可隔离冲突域，但不隔离广播域；网络层的路由器既隔离冲突域，也隔离广播域；VLAN即虚拟局域网也可隔离广播域。对于不隔离广播域的设备，他们互连的不同网络都属于同一个广播域，因此扩大了广播域的范围，更容易产生网络风暴。

39. 考查TCP流量控制与拥塞控制。

发送方的发送窗口的上限值应该取接收方窗口和拥塞窗口这两个值中较小的一个，于是此时发送方的发送窗口为 MIN{4000, 2000} = 2000 字节，由于发送方还没有收到第二个最大段的确认，所以此时主机甲还可以向主机乙发送的最大字节数为 2000 - 1000 = 1000 字节。

40. 考查DNS系统域名解析过程。

当采用递归查询的方法解析域名时，如果主机所询问的本地域名服务器不知道被查询域名的 IP 地址，那么本地域名服务器就以 DNS 客户的身份，向其他根域名服务器继续发出查询请求报文，这种方法用户主机和本地域名服务器发送的域名请求条数均为 1 条。`,score:null}]},{id:"2011-a41",type:"applied",year:2011,no:41,subject:"数据结构",paper:"408",stem:`已知有6个顶点（顶点编号为  $0\\sim 5$  ）的有向带权图G，其邻接矩阵A为上三角

矩阵，按行为主序（行优先）保存在如下的一维数组中。

<table><tr><td>4</td><td>6</td><td>∞</td><td>∞</td><td>∞</td><td>5</td><td>∞</td><td>∞</td><td>∞</td><td>4</td><td>3</td><td>∞</td><td>∞</td><td>3</td><td>3</td></tr></table>

要求：`,explanation:"",totalScore:8,parts:[{no:1,stem:"写出图G的邻接矩阵A。",answer:`图G的邻接矩阵A如下所示。
A = \\left( \\begin{array}{c c c c c c} 0 & 4 & 6 & \\infty & \\infty & \\infty \\\\ \\infty & 0 & 5 & \\infty & \\infty & \\infty \\\\ \\infty & \\infty & 0 & 4 & 3 & \\infty \\\\ \\infty & \\infty & \\infty & 0 & \\infty & 3 \\\\ \\infty & \\infty & \\infty & \\infty & 0 & 3 \\\\ \\infty & \\infty & \\infty & \\infty & \\infty & 0 \\end{array} \\right)`,score:null},{no:2,stem:"画出有向带权图G。",answer:`有向带权图G如下图所示。
![](https://408.foreverlink.love/images/cfe62de729ffa128e0c88dad864026e2.jpg)`,score:null},{no:3,stem:"求图G的关键路径，并计算该关键路径的长度。",answer:`关键路径为  $0 \\rightarrow 1 \\rightarrow 2 \\rightarrow 3 \\rightarrow 5$  （如下图所示粗线表示），长度为  $4 + 5 + 4 + 3 = 16$ 。
![](https://408.foreverlink.love/images/a2933b897b314e3ea618ca40b1b465dc.jpg)`,score:null}]},{id:"2011-a42",type:"applied",year:2011,no:42,subject:"数据结构",paper:"408",stem:`一个长度为  $\\mathrm{L}(\\mathrm{L}\\geqslant 1)$  的升序序列S，处在第  $\\left\\lfloor L / 2\\right\\rfloor$  个位置的数称为S的中位数。

例如，若序列  $S1 = (11, 13, 15, 17, 19)$ ，则S1的中位数是15，两个序列的中位数是含它们所有元素的升序序列的中位数。例如，若  $S2 = (2, 4, 6, 8, 20)$ ，则S1和S2的中位数是11。现在有两个等长升序序列A和B，试设计一个在时间和空间两方面都尽可能高效的算法，找出两个序列A和B的中位数。要求：`,explanation:"",totalScore:15,parts:[{no:1,stem:"给出算法的基本设计思想。",answer:`算法的基本设计思想如下。
分别求出序列A和B的中位数，设为a和b，求序列A和B的中位数过程如下：

1）若  $a = b$  ，则a或b即为所求中位数，算法结束。
2) 若  $a < b$ , 则舍弃序列  $A$  中较小的一半, 同时舍弃序列  $B$  中较大的一半, 要求舍弃的长度相等;
(3) 若  $a > b$ , 则舍弃序列  $A$  中较大的一半, 同时舍弃序列  $B$  中较小的一半, 要求舍弃的

长度相等；

在保留的两个升序序列中，重复过程1)、2)、3)，直到两个序列中只含一个元素时为止，较小者即为所求的中位数。`,score:null},{no:2,stem:"根据设计思想，采用C或  $\\mathrm{C + + }$  或JAVA语言描述算法，关键之处给出注释。",answer:`算法的实现如下：
\`\`\`txt
int M_Search(int A[], int B[], int n) {
    int s1 = 0, d1 = n - 1, m1, s2 = 1, d2 = n - 1, m2;
    //分别表示序列A和B的首位数、末位数和中位数
    while (s1 != d1 || s2 != d2) {
        if (A[m1] == B[m2])
            return A[m1]; //满足条件1)
        if (A[m1] < B[m2]) { //满足条件2)
            if ((s1 + d1) % 2 == 0) { //若元素个数为奇数
                s1 = m1; //舍弃A中间点以前的部分且保留中间点
                d2 = m2; //舍弃B中间点以后的部分且保留中间点
        else {
            //元素个数为偶数
            s1 = m1 + 1; //舍弃A中间点及中间点以前部分
            d2 = m2; //舍弃B中间点以后部分且保留中间点
    else {
        //满足条件3)
        if ((s1 + d1) % 2 == 0) { //若元素个数为奇数
            d1 = m1; //舍弃A中间点以后的部分且保留中间点
            s2 = m2; //舍弃B中间点以前的部分且保留中间点
        else {
            //元素个数为偶数
            d1 = m1 + 1; //舍弃A中间点以后部分且保留中间点
            s2 = m2; //舍弃B中间点及中间点以前部分`,score:null},{no:3,stem:"说明你所设计算法的时间复杂度和空间复杂度。",answer:"算法的时间复杂度为  $0(\\log_2n)$ ，空间复杂度为  $O(1)$ 。",score:null}]},{id:"2011-a43",type:"applied",year:2011,no:43,subject:"计算机组成原理",paper:"408",stem:`假定在一个8位字长的计算机中运行如下类C程序段：

\`\`\`txt
unsigned int  $x = 134$  unsigned int  $\\mathrm{y} = 246$  int  $\\mathbf{m} = \\mathbf{x}$  int  $\\mathrm{n} = \\mathrm{y}$  unsigned int  $\\mathrm{z1} = \\mathrm{x - y};$  unsigned int  $\\mathrm{z2} = \\mathrm{x + y};$  int  $\\mathrm{k1} = \\mathrm{m - n};$  int  $\\mathrm{k2} = \\mathrm{m + n};$

若编译器编译时将8个8位寄存器  $\\mathrm{Rl}\\sim \\mathrm{R8}$  分别分配给变量x、y、m、n、z1、z2、k1和k2。请回答下列问题。（提示：带符号整数用补码表示）`,explanation:"",totalScore:11,parts:[{no:1,stem:"执行上述程序段后, 寄存器 R1、R5 和 R6 的内容分别是什么? (用十六进制表示)",answer:`$\\mathbf{R} 1 = 134 = 86 \\mathrm{H}, \\mathrm{R} 5 = 90 \\mathrm{H}, \\mathrm{R} 6 = 7 \\mathrm{CH}$ ;
134=1000 0110B=86H；x-y=1000 0110B-1111 0110B=1001 0000B=90H；x+y=1000 0110B+1111 0110B=0111 1100B（溢出）`,score:null},{no:2,stem:"执行上述程序段后, 变量 m 和 k1 的值分别是多少? (用十进制表示)",answer:`$\\mathbf{m} = -122, \\mathbf{k1} = -112$
$\\mathrm{m = 10000110B}$  ，做高位为符号位，则  $\\mathfrak{m}$  的原码为  $11111010\\mathrm{B} = -122$  ；  $\\mathrm{n = 11110110B}$  n的原码为  $10001001 = -10$  ；  $\\mathrm{k1 = m - n = -112}$  。`,score:null},{no:3,stem:"上述程序段涉及带符号整数加/减、无符号整数加/减运算, 这四种运算能否利用同一个加法器辅助电路实现? 简述理由。",answer:`无符号数和有符号数都是以补码的形式存储，加减运算没有区别（不考虑溢出情况时），只是输出的时候若是有符号数的最高位是符号位。
减法运算求  $[-x]_{\\text{补}}$  的时候，是连同符号位一起按位取反末位加1，但是如果有溢出情况，这两者是有区别的，所以可以利用同一个加法器实现，但是溢出判断电路不同。`,score:null},{no:4,stem:"计算机内部如何判断带符号整数加/减运算的结果是否发生溢出？上述程序段中，哪些带符号整数运算语句的执行结果会发生溢出？",answer:"判断方法是如果最高位进位和符号位的进位不同，则为溢出；“int k2=m+n；”会溢出；三种方法可以判断溢出，双符号位、最高位进位、符号相同操作数的运算后与原操作数的符号不同则溢出",score:null}]},{id:"2011-a44",type:"applied",year:2011,no:44,subject:"计算机组成原理",paper:"408",stem:`某计算机存储器按字节编址，虚拟（逻辑）地址空间大小为16MB，主存（物理）地址空间大小为1MB，页面大小为4KB；Cache采用直接映射方式，共8行；主存与Cache之间交换的块大小为32B。系统运行到某一时刻时，页表的部分内容和Cache的部分内容分别如题44-a图、题44-b图所示，图中页框号及标记字段的内容为十六进制形式。

题44-a图页表的部分内容

<table><tr><td>虚页号</td><td>有效位</td><td>页框号</td><td>...</td></tr><tr><td>0</td><td>1</td><td>06</td><td>...</td></tr><tr><td>1</td><td>1</td><td>04</td><td>...</td></tr><tr><td>2</td><td>1</td><td>15</td><td>...</td></tr><tr><td>3</td><td>1</td><td>02</td><td>...</td></tr><tr><td>4</td><td>0</td><td>-</td><td>...</td></tr><tr><td>5</td><td>1</td><td>2B</td><td>...</td></tr><tr><td>6</td><td>0</td><td>-</td><td>...</td></tr><tr><td>7</td><td>1</td><td>32</td><td>...</td></tr></table>

题44-b图Cache的部分内容

<table><tr><td>行号</td><td>有效位</td><td>标记</td><td>...</td></tr><tr><td>0</td><td>1</td><td>020</td><td>...</td></tr><tr><td>1</td><td>0</td><td>-</td><td>...</td></tr><tr><td>2</td><td>1</td><td>01D</td><td>...</td></tr><tr><td>3</td><td>1</td><td>105</td><td>...</td></tr><tr><td>4</td><td>1</td><td>064</td><td>...</td></tr><tr><td>5</td><td>1</td><td>14D</td><td>...</td></tr><tr><td>6</td><td>0</td><td>-</td><td>...</td></tr><tr><td>7</td><td>1</td><td>27A</td><td>...</td></tr></table>

请回答下列问题。`,explanation:"",totalScore:12,parts:[{no:1,stem:"虚拟地址共有几位，哪几位表示虚页号？物理地址共有几位，哪几位表示页框号（物理页号）？",answer:`24位、前12位；20位、前8位。
$16\\mathrm{M} = 224$  故虚拟地址24位，  $4\\mathrm{K} = 212$  ，故页内地址12位，所以虚页号为前12位；  $1\\mathrm{M} = 220$  故物理地址20位，  $20 - 12 = 8$  ，故前8位为页框号。`,score:null},{no:2,stem:"使用物理地址访问 Cache 时, 物理地址应划分成哪几个字段? 要求说明每个字段的位数及在物理地址中的位置。",answer:`主存字块标记（12bit）、cache字块标记（3bit）、字块内地址（5bit）

物理地址20位，其中，块大小为  $32\\mathrm{B} = 25\\mathrm{B}$  故块内地址5位；cache共8行，  $8 = 23$  ，故字块标记为3位；  $20 - 5 - 2 = 12$  ，故主存字块标记为12位。`,score:null},{no:3,stem:"虚拟地址 001C60H 所在的页面是否在主存中? 若在主存中, 则该虚拟地址对应的物理地址是什么? 访问该地址时是否 Cache 命中? 要求说明理由。",answer:`在主存中, 04C60H, 不命中, 没有 04C 的标记字段
001C60H中虚页号为  $001\\mathrm{H} = 1$  ，查页表知其有效位为1，在内存中；该物理地址对应的也表项中，页框号为04H故物理地址为04C60H；物理地址04C60H在直接映射方式下，对应的行号为4，有效位为1但是标记位为  $064\\mathrm{H}\\neq 04\\mathrm{CH}$  故不命中。`,score:null},{no:4,stem:`假定为该机配置一个 4 路组相联的 TLB 共可存放 8 个页表项, 若其当前内容 (十六进制) 如题 44-c 图所示, 则此时虚拟地址 024BACH 所在的页面是否存在主存中? 要求说明理由。
组号有效位标记页框号有效位标记页框号有效位标记页框号有效位标记页框号

题44-c图TLB的部分内容

<table><tr><td rowspan="2">01</td><td>0</td><td>-</td><td>-</td><td rowspan="2"></td><td>1</td><td>001</td><td>15</td><td rowspan="2"></td><td>0</td><td>-</td><td>-</td><td rowspan="2"></td><td>1</td><td>012</td><td>1F</td></tr><tr><td>1</td><td>013</td><td>2D</td><td>0</td><td>-</td><td>-</td><td>1</td><td>008</td><td>7E</td><td>0</td><td>-</td><td>-</td></tr></table>`,answer:`在，012 的那个标记是对的。
思路：标记11位组地址1位页内地址12位，前12位为000000100100，组地址位为0，第0组中存在标记为012的页，其页框号为1F，故024BACH所在的页面存在主存中。`,score:null}]},{id:"2011-a45",type:"applied",year:2011,no:45,subject:"操作系统",paper:"408",stem:`某银行提供1个服务窗口和10个供顾客等待的座位。顾客到达银行时，若有空座位，则到取号机上领取一个号，等待叫号。取号机每次仅允许一位顾客使用。当营业员空闲时，通过叫号选取一位顾客，并为其服务。顾客和营业员的活动过程描述如下：

\`\`\`txt
cobegin
{process顾客i{从取号机获取一个号码；等待叫号；获取服务；}process营业员while（TRUE）{叫号；为客户服务；}
}coend

请添加必要的信号量和 P、V（或 wait()、signal()）操作，实现上述过程中的互斥与同步。

要求写出完整的过程，说明信号量的含义并赋初值。`,explanation:"",totalScore:8,parts:[{no:1,stem:`某银行提供1个服务窗口和10个供顾客等待的座位。顾客到达银行时，若有空座位，则到取号机上领取一个号，等待叫号。取号机每次仅允许一位顾客使用。当营业员空闲时，通过叫号选取一位顾客，并为其服务。顾客和营业员的活动过程描述如下：

\`\`\`txt
cobegin
{process顾客i{从取号机获取一个号码；等待叫号；获取服务；}process营业员while（TRUE）{叫号；为客户服务；}
}coend

请添加必要的信号量和 P、V（或 wait()、signal()）操作，实现上述过程中的互斥与同步。

要求写出完整的过程，说明信号量的含义并赋初值。`,answer:`\`\`\`txt
semaphoreseets  $= 10$  ，//有10个坐位的资源信号量
mesh  $= 1$  ，//取号机互斥信号量
haveCustom  $= 0$  ；//顾客与营业员同步，无顾客时营业员休息
process顾客
{P(seets)；//等空位P(mutex)；//申请使用取号机从取号机上取号；V(mutex)；//取号完毕V(haveCustom)；//通知营业员有新顾客到来等待营业员叫号；V(seets)；//离开坐位接受服务;
process营业员
{while(True){P(haveCustom)；//没有顾客则休息叫号；为顾客服务；}`,score:8}]},{id:"2011-a46",type:"applied",year:2011,no:46,subject:"操作系统",paper:"408",stem:"某文件系统为一级目录结构，文件的数据一次性写入磁盘，已写入的文件不可修改，但可多次创建新文件。请回答如下问题。",explanation:"",totalScore:7,parts:[{no:1,stem:"在连续、链式、索引三种文件的数据块组织方式中，哪种更合适？要求说明理由。为定位文件数据块，需要FCB中设计哪些相关描述字段？",answer:"连续更合适,因为一次写入不存在插入问题,连续的数据块组织方式完全可以满足一次性写入磁盘。同时连续文件组织方式减少了其他不必要的空间开销, 而连续的组织方式顺序查找读取速度是最快的。",score:null},{no:2,stem:"为快速找到文件, 对于 FCB, 是集中存储好, 还是与对应的文件数据块连续存储好? 要求说明理由。",answer:"FCB 集中存储好。目录是存在磁盘上的，所以检索目录的时候需要访问磁盘，速度很慢；集中存储是将文件控制块的一部分数据分解出去，存在另一个数据结构中，而在目录中仅留下文件的基本信息和指向该数据结构的指针，这样一来就有效地缩短减少了目录的体积，减少了目录在磁盘中的块数，于是检索目录时读取磁盘的次数也减少，于是就加快了检索目录的次数。",score:null}]},{id:"2011-a47",type:"applied",year:2011,no:47,subject:"计算机网络",paper:"408",stem:`某主机的MAC地址为00-15-C5-C1-5E-28，IP地址为10.2.128.100（私有地址）。题47-a图是网络拓扑，题47-b图是该主机进行Web请求的1个以太网数据帧前80个

字节的十六进制及 ASCII 码内容。

![](https://408.foreverlink.love/images/c5ab2e5f3ba72a4212a890a10bedd4f6.jpg)
图47-a图网络拓扑

<table><tr><td>0000</td><td>00</td><td>21</td><td>27</td><td>21</td><td>51</td><td>ee</td><td>00</td><td>15</td><td>c5</td><td>c1</td><td>5e</td><td>28</td><td>08</td><td>00</td><td>45</td><td>00</td><td>. !||Q... . . .^ (.E.</td><td></td></tr><tr><td>0010</td><td>01</td><td>ef</td><td>11</td><td>3b</td><td>40</td><td>00</td><td>80</td><td>06</td><td>ba</td><td>9d</td><td>0a</td><td>02</td><td>80</td><td>64</td><td>40</td><td>aa</td><td>. . .@ . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .</td><td></td></tr><tr><td>0020</td><td>62</td><td>20</td><td>04</td><td>ff</td><td>00</td><td>50</td><td>e0</td><td>e2</td><td>00</td><td>fa</td><td>7b</td><td>f9</td><td>f8</td><td>05</td><td>50</td><td>18</td><td>b . . .P. . . .{..}P. . . .</td><td></td></tr><tr><td>0030</td><td>fa</td><td>f0</td><td>1a</td><td>c4</td><td>00</td><td>00</td><td>47</td><td>45</td><td>54</td><td>20</td><td>2f</td><td>72</td><td>66</td><td>63</td><td>2e</td><td>68</td><td>. . . .GE T /rfc.h</td><td></td></tr><tr><td>0040</td><td>74</td><td>6d</td><td>6c</td><td>20</td><td>48</td><td>54</td><td>54</td><td>50</td><td>2f</td><td>31</td><td>2e</td><td>31</td><td>0d</td><td>0a</td><td>41</td><td>63</td><td>tmI HTTP /1.1..Ac</td><td></td></tr></table>

请参考图中的数据回答以下问题。`,explanation:"",totalScore:9,parts:[{no:1,stem:"Web 服务器的 IP 地址是什么？该主机的默认网关的 MAC 地址是什么？",answer:`64.170.98.32 00-21-27-21-51-ee

以太网帧头部  $6 + 6 + 2 = 14$  字节，IP数据报首部目的IP地址字段前有  $4*4 = 16$  字节，从以太网数据帧第一字节开始数  $14 + 16 = 30$  字节，得目的IP地址40aa6220(十六进制)，转换为十进制得64.170.98.32。以太网帧的前六字节00-21-27-21-51-ee是目的MAC地址，本题中即为主机的默认网关10.2.128.1端口的MAC地址。`,score:null},{no:2,stem:"该主机在构造题 47-b 图的数据帧时, 使用什么协议确定目的 MAC 地址? 封装该协议请求报文的以太网帧的目的 MAC 地址是什么?",answer:`ARP FF-FF-FF-FF-FF-FF

ARP协议解决IP地址到MAC地址的映射问题。主机的ARP进程在本以太网以广播的形式发送ARP请求分组，在以太网上广播时，以太网帧的目的地址为全1，即FF-FF-FF-FF-FF。`,score:null},{no:3,stem:"假设 HTTP/1.1 协议以持续的非流水线方式工作, 一次请求-响应时间为 RTT, rfc.html 页面引用了 5 个 JPEG 小图像, 则从发出题 47-b 图中的 Web 请求开始到浏览器收到全部内容为止, 需要多少个 RTT?",answer:`6

HTTP/1.1协议以持续的非流水线方式工作时，服务器在发送响应后仍然在一段时间内保持这段连接，客户机在收到前一个响应后才能发送下一个请求。第一个RTT用于请求web页面，客户机收到第一个请求的响应后(还有五个请求未发送)，每访问一次对象就用去一个RTT。故共  $1 + 5 = 6$  个RTT后浏览器收到全部内容。`,score:null},{no:4,stem:`该帧所封装的 IP 分组经过路由器 R 转发时, 需修改 IP 分组头中的哪些字段?
注：以太网数据帧结构和IP分组头结构分别如题47-c图、题47-d图所示。

<table><tr><td>6B</td><td>6B</td><td>2B</td><td>46-1500B</td><td>4B</td></tr><tr><td>目的MAC地址</td><td>源MAC地址</td><td>类型</td><td>数据</td><td>CRC</td></tr></table>

![](https://408.foreverlink.love/images/0bd519f8e17083b53e1a33242b965c41.jpg)
题47-b图以太网数据帧（前80字节）
题47-c图以太网帧结构
题47-d IP分组头结构`,answer:`源IP地址0a 02 80 64改为650c7b0f

生存时间(TTL)减1

校验和字段重新计算

私有地址和Internet上的主机通信时，须有NAT路由器进行网络地址转换，把IP数据报的源IP地址(本题为私有地址10.2.128.100)转换为NAT路由器的一个全球IP地址(本题为101.12.123.15)。因此，源IP地址字段0a 02 80 64变为65 0c 7b 0f。IP数据报每经过一个路由器，生存时间TTL值就减1，并重新计算首部校验和。若IP分组的长度超过输出链路的MTU，则总长度字段、标志字段、片偏移字段也要发生变化。

注意，图47-b中每行前4bit是数据帧的字节计数，不属于以太网数据帧的内容。`,score:null}]},{id:"2012-a41",type:"applied",year:2012,no:41,subject:"数据结构",paper:"408",stem:"设有 6 个有序表 A、B、C、D、E、F，分别含有 10、35、40、50、60 和 200 个数据元素，各表中元素按升序排列。要求通过 5 次两两合并，将 6 个表最终合并成 1 个升序表，并在最坏情况下比较的总次数达到最小。请问答下列问题。",explanation:"",totalScore:10,parts:[{no:1,stem:"给出完整的合并过程，并求出最坏情况下比较的总次数。",answer:`对于长度分别为  $\\mathfrak{m}$ ， $\\mathfrak{n}$  的两个有序表的合并，最坏情况下是一直比较到两个表尾元素，比较次数为  $\\mathrm{m + n - 1}$  次。故，最坏情况的比较次数依赖于表长，为了缩短总的比较次数，根据哈夫曼树（最佳归并树）思想的启发，可采用如图所示的合并顺序。
![](https://408.foreverlink.love/images/9925bd5d94ce4b605ff441668733cc06.jpg)

根据上图中的哈夫曼树，6个序列的合并过程为：

第1次合并：表A与表B合并，生成含有45个元素的表AB；

第2次合并：表AB与表C合并，生成含有85个元素的表ABC；

第3次合并：表D与表E合并，生成含有110个元素的表DE；

第4次合并：表ABC与表DE合并，生成含有195个元素的表ABCDE；

第5次合并：表ABCDE与表F合并，生成含有395个元素的最终表。

由上述分析可知，最坏情况下的比较次数为：第1次合并，最多比较次数  $= 10 + 35 - 1 = 44$  ；第2次合并，最多比较次数  $= 45 + 40 - 1 = 84$  ；第3次合并，最多比较次数  $= 50 + 60 - 1 = 109$  ；第4次合并，最多比较次数  $= 85 + 110 - 1 = 194$  ；第5次合并，最多比较次数  $= 195 + 200 - 1 = 394$  。

故，比较的总次数最多为：  $44 + 84 + 109 + 194 + 394 = 825$`,score:null},{no:2,stem:"根据你的合并过程，描述  $\\mathrm{N}(\\mathrm{N} \\geqslant 2)$  个不等长升序表的合并策略，并说明理由。",answer:`各表的合并策略是：在对多个有序表进行两两合并时，若表长不同，则最坏情况下总的比较次数依赖于表的合并次序。可以借用哈夫曼树的构造思想，依次选择最短的两个表进行合并，可以获得最坏情况下最佳的合并效率。
【1）2）评分说明】

(1)对于用类似哈夫曼树（或最佳归并树）思想进行合并，过程描述正确，给5分。按其他策略进行

合并，过程描述正确，给3分。

②正确算出与合并过程一致的总比较次数，给2分。若计算过程正确，但结果错误，可给1分。
③考生只要说明采用的是类似哈夫曼树（或最佳归并树）的构造方法作为合并策略，即可给3分。如果采用其他策略，只要能够完成合并，给2分。`,score:null}]},{id:"2012-a42",type:"applied",year:2012,no:42,subject:"数据结构",paper:"408",stem:`假定采用带头结点的单链表保存单词，当两个单词有相同的后缀时，则可共享相同的后缀存储空间，例如，“loading”和“being”的存储映像如下图所示。

![](https://408.foreverlink.love/images/cb3a3b6259be9e9127aa44d136dc6840.jpg)

设 str1 和 str2 分别指向两个单词所在单链表的头结点，链表结点结构为 data next，请设计一个时间上尽可能高效的算法，找出由 str1 和 str2 所指向两个链表共同后缀的起始位置（如图中字符 i 所在结点的位置 p）。要求：`,explanation:"",totalScore:13,parts:[{no:1,stem:"给出算法的基本设计思想。",answer:`顺序遍历两个链表到尾结点时，并不能保证两个链表同时到达尾结点。这是因为两个链表的长度不同。假设一个链表比另一个链表长  $\\mathbf{k}$  个结点，我们先在长链表上遍历  $\\mathbf{k}$  个结点，之后同步遍历两个链表，这样就能够保证它们同时到达最后一个结点。由于两个链表从第一个公共结点到链表的尾结点都是重合的，所以它们肯定同时到达第一个公共结点。算法的基本设计思想：
① 分别求出 str1 和 str2 所指的两个链表的长度 m 和 n;
② 将两个链表以表尾对齐：令指针 p、q 分别指向 str1 和 str2 的头结点，若  $m >= n$ ，则使 p 指向链表中的第  $m - n + 1$  个结点；若  $m < n$ ，则使 q 指向链表中的第  $n - m + 1$  个结点，即使指针 p 和 q 所指的结点到表尾的长度相等。
③ 反复将指针 p 和 q 同步向后移动，并判断它们是否指向同一结点。若 p 和 q 指向同一结点，则该点即为所求的共同后缀的起始位置。`,score:null},{no:2,stem:"根据设计思想，采用C或  $\\mathbf{C} + +$  或JAVA语音描述算法，关键之处给出注释。",answer:`算法的C语言代码描述：
\`\`\`txt
LinkNode \\*Find_1st/Common(LinkList strl,LinkList str2){ int len1=Length(str1),len2=Length(str2); LinkNode \\*p,\\*q; for(p=str1;len1>len2;len1--） //使p指向的链表与q指向的链表等长 p=p->next; for(q=str2;len1<len2;len2--）//使q指向的链表与p指向的链表等长 q=q->next; while(p->next!=NULL&&p->next!=q->next){//查找共同后缀起始点 p=p->next; //两个指针同步向后移动 q=q->next; } return p->next; //返回共同后缀的起始点
\`\`\`

【1）2）的评分说明】  $①$  若考生所给算法实现正确，且时间复杂度为  $\\mathrm{O(m + n)}$  ，可给12分；若算法正确，但时间复杂度超过  $\\mathrm{O(m + n)}$  ，则最高可给9分。
②若在算法的基本设计思想描述中因文字表达没有非常清晰反映出算法思路，但在算法实现中能够清晰看出算法思想且正确的，可参照①的标准给分。
③若算法的基本设计思想描述或算法实现中部分正确，可参照①中各种情况的相应给分标准酌情给分。
④参考答案中只给出了使用C语言的版本，使用  $\\mathrm{C} + + /$  JAVA语言的答案视同时用C语言。`,score:null},{no:3,stem:"说明你所设计算法的时间复杂度。",answer:`时间复杂度为：O(len1+len2)或O(max(len1, len2))，其中len1、len2分别为两个链表的长度。
【3）的评分说明】 若考生所估计的时间复杂度与考生所实现的算法一致，可给1分。`,score:null}]},{id:"2012-a43",type:"applied",year:2012,no:43,subject:"计算机组成原理",paper:"408",stem:`假定某计算机的CPU主频为  $80\\mathrm{MHz}$ ，CPI为4，平均每条指令访存1.5次，主存与Cache之间

交换的块大小为16B，Cache的命中率为  $99\\%$  ，存储器总线宽带为32位。请回答下列问题。`,explanation:"",totalScore:10,parts:[{no:1,stem:"该计算机的MIPS数是多少？平均每秒Cache缺失的次数是多少？在不考虑DMA传送的情况下，主存带宽至少达到多少才能满足CPU的访存要求？",answer:`平均每秒CPU执行的指令数为：  $80\\mathrm{M} / 4 = 20\\mathrm{M}$  ，故MIPS数为20；（1分）
平均每条指令访存1.5次，故平均每秒Cache缺失的次数  $= 20\\mathrm{M}\\times 1.5\\times (1 - 99\\%) = 300\\mathrm{k}$  ；（1分）

当 Cache 缺失时，CPU 访问主存，主存与 Cache 之间以块为传送单位，此时，主存带宽为  $16\\mathrm{B} \\times 300\\mathrm{k/s} = 4.8\\mathrm{MB/s}$  。在不考虑 DMA 传输的情况下，主存带宽至少达到  $4.8\\mathrm{MB/s}$  才能满足 CPU 的访存要求。（2 分）`,score:null},{no:2,stem:"假定在Cache缺失的情况下访问主存时，存在  $0.0005\\%$  的缺页率，则CPU平均每秒产生多少次缺页异常？若页面大小为4KB，每次缺页都需要访问磁盘，访问磁盘时DMA传送采用周期挪用方式，磁盘I/O接口的数据缓冲寄存器为32位，则磁盘I/O接口平均每秒发出的DMA请求次数至少是多少？",answer:"题中假定在Cache缺失的情况下访问主存，平均每秒产生缺页中断  $300000 \\times 0.0005\\% = 1.5$  次。因为存储器总线宽度为32位，所以每传送32位数据，磁盘控制器发出一次DMA请求，故平均每秒磁盘DMA请求的次数至少为  $1.5 \\times 4\\mathrm{KB} / 4\\mathrm{B} = 1.5\\mathrm{K} = 1536$ 。（2分）",score:null},{no:3,stem:"CPU和DMA控制器同时要求使用存储器总线时，哪个优先级更高？为什么？",answer:`CPU和DMA控制器同时要求使用存储器总线时，DMA请求优先级更高；（1分）
因为DMA请求得不到及时响应，I/O传输数据可能会丢失。（1分）`,score:null},{no:4,stem:"为了提高性能，主存采用4体低位交叉存储模式，工作时每1/4个存储周期启动一个体。若每个体的存储周期为50ns，则该主存能提供的最大带宽是多少？",answer:"4体交叉存储模式能提供的最大带宽为  $4\\times 4\\mathrm{B} / 50\\mathrm{ns} = 320\\mathrm{MB / s}$  。（2分）",score:null}]},{id:"2012-a44",type:"applied",year:2012,no:44,subject:"计算机组成原理",paper:"408",stem:`某 16 位计算机中，带符号整数用补码表示，数据 Cache 和指令 Cache 分离。题 44 表给出了指令系统中部分指令格式，其中 Rs 和 Rd 表示寄存器，mem 表示存储单元地址，（x）表示寄存器 x 或存储单元 x 的内容。

表 指令系统中部分指令格式

<table><tr><td>名称</td><td>指令的汇编格式</td><td>指令功能</td></tr><tr><td>加法指令</td><td>ADD Rs, Rd</td><td>(Rs)+(Rd)-&gt;Rd</td></tr><tr><td>算术/逻辑左移</td><td>SHL Rd</td><td>2*(Rd)-&gt;Rd</td></tr><tr><td>算术右移</td><td>SHR Rd</td><td>(Rd)/2-&gt;Rd</td></tr><tr><td>取数指令</td><td>LOAD Rd, mem</td><td>mem)-&gt;Rd</td></tr><tr><td>存数指令</td><td>STORE Rs, mem</td><td>(Rs)-&gt;mem</td></tr></table>

该计算机采用5段流水方式执行指令，各流水段分别是取指（IF）、译码/读寄存器（ID）、执行/计算有效地址（EX）、访问存储器（M）和结果写回寄存器（WB），流水线采用“按序发射，按序完成”方式，没有采用转发技术处理数据相关，并且同一个寄存器的读和写操作不能在同一个时钟周期内进行。请回答下列问题：`,explanation:"",totalScore:13,parts:[{no:1,stem:"若int型变量  $\\mathbf{X}$  的值为-513，存放在寄存器R1中，则执行指令“SHLR1”后，R1的内容是多少？（用十六进制表示）",answer:`$\\mathbf{x}$  的机器码为  $[\\mathbf{x}]_{\\text{补}} = 111111011111B$ ，即指令执行前  $(R1) = FDFFH$ ，右移1位后为111111101111111B，即指令执行后  $(R1) = FEFFH$ 。（2分）
【评分说明】仅正确写出指令执行前的(R1)可给1分。`,score:null},{no:2,stem:"若某个时间段中，有连续的4条指令进入流水线，在其执行过程中没有发生任何阻塞，则执行这4条指令所需的时钟周期数为多少？",answer:"至少需要  $4 + (5 - 1) = 8$  个时钟周期数。（2分）",score:null},{no:3,stem:`若高级语言程序中某赋值语句为  $x = a + b$ ， $x$ 、 $a$  和  $b$  均为 int 型变量，它们的存储单元地址分别表示为 [x]、[a] 和 [b]。该语句对应的指令序列及其在指令流水线中的执行过程如下图所示。
I1 LOAD R1，[a]
I2 LOAD R2，[b]
I3 ADD R1，R2
I4 STORE R2，[x]

<table><tr><td></td><td colspan="14">时间单元</td></tr><tr><td>指令</td><td>1</td><td>2</td><td>3</td><td>4</td><td>5</td><td>6</td><td>7</td><td>8</td><td>9</td><td>10</td><td>11</td><td>12</td><td>13</td><td>14</td></tr><tr><td>\\(I_1\\)</td><td>IF</td><td>ID</td><td>EX</td><td>M</td><td>WB</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td>\\(I_2\\)</td><td></td><td>IF</td><td>ID</td><td>EX</td><td>M</td><td>WB</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td>\\(I_3\\)</td><td></td><td></td><td>IF</td><td></td><td></td><td></td><td>ID</td><td>EX</td><td>M</td><td>WB</td><td></td><td></td><td></td><td></td></tr><tr><td>\\(I_4\\)</td><td></td><td></td><td></td><td></td><td></td><td></td><td>IF</td><td></td><td></td><td></td><td>ID</td><td>EX</td><td>M</td><td>WB</td></tr></table>

图指令序列及其执行过程示意图

则这4条指令执行过程中，  $\\mathrm{I}_3$  的ID段和  $\\mathbf{I}_4$  的IF段被阻塞的原因各是什么？`,answer:`$\\mathrm{I}_3$  的ID段被阻塞的原因：因为  $\\mathbf{I}_3$  与  $\\mathbf{I}_1$  和  $\\mathbf{I}_2$  都存在数据相关，需等到  $\\mathbf{I}_1$  和  $\\mathbf{I}_2$  将结果写回寄存器后， $\\mathbf{I}_3$  才能读寄存器内容，所以  $\\mathbf{I}_3$  的ID段被阻塞。（1分）
$\\mathrm{I}_4$  的 IF 段被阻塞的原因：因为  $\\mathbf{I}_4$  的前一条指令  $\\mathrm{I}_3$  在 ID 段被阻塞，所以  $\\mathrm{I}_4$  的 IF 段被阻塞。（1 分）`,score:null},{no:4,stem:`若高级语言程序中某赋值语句为  $\\mathrm{x} = \\mathrm{x}^{*}2 + \\mathrm{a}$ ，x和a均为unsigned int类型变量，它们的存储单元
地址分别表示为[x]、[a]，则执行这条语句至少需要多少个时钟周期？要求模仿题44图画出这条语句对应的指令序列及其在流水线中的执行过程示意图。`,answer:`因  $2^{*}\\mathbf{x}$  操作有左移和加法两种实现方法，故  $\\mathrm{x = x^{\\ast}2 + a}$  对应的指令序列为
I1 LOAD R1，[x]
I2 LOAD R2，[a]
I3 SHL R1 //或者 ADD R1，R1
I4 ADD R1，R2
I5 STORE R2，[x]

【评分说明】指令正确给2分；其他正确答案同样给分；部分正确，酌情给分。

这5条指令在流水线中执行过程如下图所示。（3分）

<table><tr><td></td><td colspan="17">时间单元</td></tr><tr><td>指令</td><td>1</td><td>2</td><td>3</td><td>4</td><td>5</td><td>6</td><td>7</td><td>8</td><td>9</td><td>10</td><td>11</td><td>12</td><td>13</td><td>14</td><td>15</td><td>16</td><td>17</td></tr><tr><td>I1</td><td>IF</td><td>ID</td><td>EX</td><td>M</td><td>WB</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td>I2</td><td></td><td>IF</td><td>ID</td><td>EX</td><td>M</td><td>WB</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td>I3</td><td></td><td></td><td>IF</td><td></td><td></td><td>ID</td><td>EX</td><td>M</td><td>WB</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td>I4</td><td></td><td></td><td></td><td></td><td></td><td>IF</td><td></td><td></td><td></td><td>ID</td><td>EX</td><td>M</td><td>WB</td><td></td><td></td><td></td><td></td></tr><tr><td>I5</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td>IF</td><td></td><td></td><td></td><td>ID</td><td>EX</td><td>M</td><td>WB</td></tr></table>

故执行  $\\mathrm{x} = \\mathrm{x}^{*}2 + \\mathrm{a}$  语句最少需要17个时钟周期。（1分）`,score:null}]},{id:"2012-a45",type:"applied",year:2012,no:45,subject:"操作系统",paper:"408",stem:`某请求分页系统的局部页面置换策略如下：

系统从0时刻开始扫描，每隔5个时间单位扫描一轮驻留集（扫描时间忽略不计），本轮没有被访问过的页框将被系统回收，并放入到空闲页框链尾，其中内容在下一次分配之前不被清空。当发生缺页时，如果该页曾被使用过且还在空闲页链表中，则重新放回进程的驻留集中；否则，从空闲页框链表头部取出一个页框。

假设不考虑其它进程的影响和系统开销。初始时进程驻留集为空。目前系统空闲页框链表中页框号依次为32、15、21、41。进程P依次访问的<虚拟页号，访问时刻>是：  $< 1,1>$  、  $< 3,2>$  、  $< 0,4>$  、  $< 0,6>$  、  $< 1,11>$  、  $< 0,13>$  、  $< 2,14>$  。请回答下列问题。`,explanation:"",totalScore:7,parts:[{no:1,stem:"访问  $<0,4>$  时，对应的页框号是什么？",answer:"页框号为21。（1分）理由：因为起始驻留集为空，而0页对应的页框为空闲链表中的第三个空闲页框（21），其对应的页框号为21。（1分）",score:null},{no:2,stem:"访问  $< 1,11>$  时，对应的页框号是什么？说明理由。",answer:"页框号为32。（1分）理由：因  $11 > 10$  故发生第三轮扫描，页号为1的页框在第二轮已处于空闲页框链表中，此刻该页又被重新访问，因此应被重新放回驻留集中，其页框号为32。（1分）",score:null},{no:3,stem:"访问  $< 2,14>$  时，对应的页框号是什么？说明理由。",answer:"页框号为41。（1分）理由：因为第2页从来没有被访问过，它不在驻留集中，因此从空闲页框链表中取出链表头的页框41，页框号为41。（1分）",score:null},{no:4,stem:"该策略是否适合于时间局部性好的程序？说明理由。",answer:`合适。（1分）理由：如果程序的时间局部性越好，从空闲页框链表中重新取回的机会越大，该
策略的优势越明显。（1分）`,score:null}]},{id:"2012-a46",type:"applied",year:2012,no:46,subject:"操作系统",paper:"408",stem:"某文件系统空间的最大容量为  $4\\mathrm{TB}$  （ $1\\mathrm{TB} = 2^{40}$ ），以磁盘块为基本分配单位。磁盘块大小为  $1\\mathrm{KB}$  。文件控制块（FCB）包含一个512B的索引表区。请回答下列问题。",explanation:"",totalScore:8,parts:[{no:1,stem:"假设索引表区仅采用直接索引结构，索引表区存放文件占用的磁盘块号，索引表项中块号最少占多少字节？可支持的单个文件最大长度是多少字节？",answer:`文件系统中所能容纳的磁盘块总数为  $4\\mathrm{TB} / 1\\mathrm{KB} = 2^{32}$  。要完全表示所有磁盘块，索引项中的块号最少要占  $32 / 8 = 4\\mathrm{B}$  。（2分）
而索引表区仅采用直接索引结构，故512B的索引表区能容纳  $512\\mathrm{B} / 4\\mathrm{B} = 2^{7}$  个索引项。每个索引项对应一个磁盘块，所以该系统可支持的单个文件最大长度是  $128\\times 1\\mathrm{KB} = 128\\mathrm{KB}$ 。（2分）

【评分说明】过程描述正确，但计算结果不正确，可酌情给分。`,score:null},{no:2,stem:"假设索引表区采用如下结构：第0~7字节采用<起始块号，块数  $>$  格式表示文件创建时预分配的连续存储空间，其中起始块号占6B，块数占2B；剩余504字节采用直接索引结构，一个索引项占6B，则可支持的单个文件最大长度是多少字节？为了使单个文件的长度达到最大，请指出起始块号和块数分别所占字节数的合理值并说明理由。",answer:`块号占6B、块数占2B时，共可以表示  $2^{16}$  个磁盘块，即  $2^{26} = 64\\mathrm{MB}$  ；直接索引区共  $504\\mathrm{B} / 6\\mathrm{B} = 84$  个索引项。所以该系统可支持的单个文件最大长度是  $2^{26}\\mathrm{B} + 84\\mathrm{KB} = 65620\\mathrm{KB}$  。（2分）
合理的起始块号和块数所占字节数分别为4,4（或1,7或2,6或3,5)。（1分）理由：块数占4B或以上，就可表示4TB大小的文件长度，达到文件系统的空间上限。（1分）

【评分说明】过程描述正确，但计算结果不正确，可酌情给分。只要答出起始块号和块数所占字节数的任何合理值，均可得1分；理由说明正确得1分。`,score:null}]},{id:"2012-a47",type:"applied",year:2012,no:47,subject:"计算机网络",paper:"408",stem:`主机 H 通过快速以太网连接 Internet, IP 地址为 192.168.0.8, 服务器 S 的 IP 地址为 211.68.71.80。H 与 S 使用 TCP 通信时, 在 H 上捕获的其中 5 个 IP 分组如题 47-a 表所示。

题47-a表

<table><tr><td>编号</td><td colspan="5">IP分组的前40字节内容（十六进制）</td></tr><tr><td rowspan="2">1</td><td>45 00 00 30</td><td>01 9b 40 00</td><td>80 06 1d e8</td><td>c0 a8 00 08</td><td>d3 44 47 50</td></tr><tr><td>0b d9 13 88</td><td>84 6b 41 c5</td><td>00 00 00 00</td><td>70 02 43 80</td><td>5d b0 00 00</td></tr><tr><td rowspan="2">2</td><td>43 00 00 30</td><td>00 00 40 00</td><td>31 06 6e 83</td><td>d3 44 47 50</td><td>c0 a8 00 08</td></tr><tr><td>13 88 0b d9</td><td>e0 59 9f ef</td><td>84 6b 41 c6</td><td>70 12 16 d0</td><td>37 e1 00 00</td></tr><tr><td rowspan="2">3</td><td>45 00 00 28</td><td>01 9c 40 00</td><td>80 06 1d ef</td><td>c0 a8 00 08</td><td>d3 44 47 50</td></tr><tr><td>0b d9 13 88</td><td>84 6b 41 c6</td><td>e0 59 9f f0</td><td>50 f0 43 80</td><td>2b 32 00 00</td></tr><tr><td rowspan="2">4</td><td>45 00 00 38</td><td>01 9d 40 00</td><td>80 06 1d de</td><td>c0 a8 00 08</td><td>d3 44 47 50</td></tr><tr><td>0b d9 13 88</td><td>84 6b 41 c6</td><td>e0 59 9f f0</td><td>50 18 43 80</td><td>e6 55 00 00</td></tr><tr><td rowspan="2">5</td><td>45 00 00 28</td><td>68 11 40 00</td><td>31 06 06 7a</td><td>d3 44 47 50</td><td>c0 a8 00 08</td></tr><tr><td>13 88 0b d9</td><td>e0 59 9f f0</td><td>84 6b 41 d6</td><td>50 10 16 d0</td><td>57 d2 00 00</td></tr></table>

回答下列问题。`,explanation:"",totalScore:9,parts:[{no:1,stem:"题47-a表中的IP分组中，哪几个是由H发送的？哪几个完成了TCP连接建立过程？哪几个在通过快速以太网传输时进行了填充？",answer:`由于题47-a表中1、3、4号分组的源IP地址（第  $13\\sim 16$  字节）均为192.168.0.8（c0a80008H），因此可以判定1、3、4号分组是由H发送的。（3分）
题47-a表中1号分组封装的TCP段的FLAG为02H（即  $\\mathrm{SYN} = 1$  ，ACK  $= 0$  )，seq  $= 846\\mathrm{b}41\\mathrm{c}5\\mathrm{H}$  ，2号分组封装的TCP段的FLAG为12H（即  $\\mathrm{SYN} = 1$  ，ACK  $= 1$  )，seq  $=$  e0599fefH，ack  $= 846\\mathrm{b}41\\mathrm{c}6\\mathrm{H}$  ，3号分组封装的TCP段的FLAG为  $10\\mathrm{H}$  （即  $\\mathrm{ACK} = 1$  )，seq  $= 846\\mathrm{b}41\\mathrm{c}6\\mathrm{H}$  ，ack  $=$  e0599ff0H，所以1、2、3号分组完成了TCP连接建立过程。（1分）
由于快速以太网数据帧有效载荷的最小长度为46字节，表中3、5号分组的总长度为40（28H）字节，小于46字节，其余分组总长度均大于46字节。所以3、5号分组通过快速以太网传输时进行了填充。（1分）`,score:null},{no:2,stem:"根据题47-a表中的IP分组，分析S已经收到的应用层数据字节数是多少？",answer:`由3号分组封装的TCP段可知，发送应用层数据初始序号为seq=846b 41c6H，由5号分组封装的TCP段可知，ack为seq=846b 41d6H，所以5号分组已经收到的应用层数据的字节数为846b 41d6H-846b 41c6H=10H=16。（2分）
【评分说明】其他正确解答，亦给2分；若解答结果不正确，但分析过程正确给1分；其他情况酌情给分。`,score:null},{no:3,stem:`若题47-a表中的某个IP分组在S发出时的前40字节如题47-b表所示，则该IP分组到达H时经过了多少个路由器？
<table><tr><td>来自S的分组</td><td>45 00 00 28</td><td>68 11 40 00</td><td>40 06 ec ad</td><td>d3 44 47 50</td><td>ca 76 01 06</td></tr><tr><td></td><td>13 88 a1 08</td><td>e0 59 9f f0</td><td>84 6b 41 d6</td><td>50 10 16 d0</td><td>b7 d6 00 00</td></tr></table>

注：IP分组头和TCP段头结构分别如题47-a图，题47-b图所示。

![](https://408.foreverlink.love/images/b2d0e2c5a835589326f33e71d6a9fc43.jpg)
题47-a图 IP分组头结构

![](https://408.foreverlink.love/images/40a9da4609d051da3585b450cfad7e89.jpg)
题47-b图TCP段头结构`,answer:`由于S发出的IP分组的标识  $= 6811\\mathrm{H}$  ，所以该分组所对应的是题47-a表中的5号分组。S发出的IP分组的  $\\mathrm{TTL} = 40\\mathrm{H} = 64$  ，5号分组的  $\\mathrm{TTL} = 31\\mathrm{H} = 49$  ，  $64 - 49 = 15$  ，所以，可以推断该IP分组到达H时经过了15个路由器。（2分）
【评分说明】若解答结果不正确，但分析过程正确给1分；其他情况酌情给分。`,score:null}]},{id:"2013-a41",type:"applied",year:2013,no:41,subject:"数据结构",paper:"408",stem:`已知一个整数序列  $A = (a_{0}, a_{1}, \\dots, a_{n - 1})$  ，其中  $0 \\leq a_{i} < n (0 \\leq i < n)$  。若存在  $a_{p1} = a_{p2} = \\dots = a_{pm} = x$  且  $m > n / 2 (0 \\leq p_k < n, 1 \\leq k \\leq m)$  ，则称  $x$  为  $A$  的主元素。例如  $A = (0, 5, 5, 3, 5, 7, 5, 5)$ ，侧5为主元素；又如  $A = (0, 5, 5, 3, 5, 1, 5, 7)$ ，则  $A$  中没有主元素。假设  $A$  中的  $n$  个元素保存在一个一维数组中，请设计一个尽可能高效的算法，找出  $A$  的主元素。若存在主元素，则输出该元素；否则输出-1。要求：

(1) 给出算法的基本设计思想。
(2) 根据设计思想, 采用 C 或  $\\mathrm{C}++$  或 Java 语言描述算法, 关键之处给出注释。
(3) 说明你所设计算法的时间复杂度和空间复杂度。`,explanation:"",totalScore:13,parts:[{no:1,stem:`已知一个整数序列  $A = (a_{0}, a_{1}, \\dots, a_{n - 1})$  ，其中  $0 \\leq a_{i} < n (0 \\leq i < n)$  。若存在  $a_{p1} = a_{p2} = \\dots = a_{pm} = x$  且  $m > n / 2 (0 \\leq p_k < n, 1 \\leq k \\leq m)$  ，则称  $x$  为  $A$  的主元素。例如  $A = (0, 5, 5, 3, 5, 7, 5, 5)$ ，侧5为主元素；又如  $A = (0, 5, 5, 3, 5, 1, 5, 7)$ ，则  $A$  中没有主元素。假设  $A$  中的  $n$  个元素保存在一个一维数组中，请设计一个尽可能高效的算法，找出  $A$  的主元素。若存在主元素，则输出该元素；否则输出-1。要求：

(1) 给出算法的基本设计思想。
(2) 根据设计思想, 采用 C 或  $\\mathrm{C}++$  或 Java 语言描述算法, 关键之处给出注释。
(3) 说明你所设计算法的时间复杂度和空间复杂度。`,answer:`(1) 给出算法的基本设计思想: (4 分)

算法的策略是从前向后扫描数组元素，标记出一个可能成为主元素的元素 Num。然后重新计数，确认 Num 是否是主元素。

算法可分为以下两步：

(1) 选取候选的主元素: 依次扫描所给数组中的每个整数, 将第一个遇到的整数 Num 保存到  $c$  中, 记录 Num 的出现次数为 1; 若遇到的下一个整数仍等于 Num, 则计数加 1, 否则计数减 1; 当计数减到 0 时, 将遇到的下一个整数保存到  $c$  中, 计数重新记为 1, 开始新一轮计数, 即从当前位置开始重复上述过程, 直到扫描完全部数组元素。
(2) 判断  $c$  中元素是否是真正的主元素: 再次扫描该数组, 统计  $c$  中元素出现的次数, 若大于  $n / 2$ , 则为主元素; 否则, 序列中不存在主元素。

(2) 算法实现: (7 分)

\`\`\`c
int Majority ( int A[ ], int n )
{
    int i, c, count = 1; //c用来保存候选主元素，count用来计数
    c = A[0]; //设置A[0]为候选主元素
    for (i = 1; i < n; i++) //查找候选主元素
        if (A[i] == c)
            count++; //对A中的候选主元素计数
    else
        if (count > 0) //处理不是候选主元素的情况
            count--;
    else //更换候选主元素，重新计数
    { c = A[i]; }
\`\`\`

\`\`\`c
count = 1;
}
if (count > 0)
for (i = count = 0; i < n; i++) // 统计候选主元素的实际出现次数
if (A[i] == c)
count++;
if (count > n/2) return c; // 确认候选主元素
else return -1; // 不存在主元素
}
\`\`\`

【（1）、（2）的评分说明】

(1) 若考生设计的算法满足题目的功能要求且正确, 则 (1)、(2) 根据所实现算法的效率给分, 细则见下表:

<table><tr><td>时间
复杂度</td><td>空间
复杂度</td><td>(1)
得分</td><td>(2)
得分</td><td>说明</td></tr><tr><td>O(n)</td><td>O(1)</td><td>4</td><td>7</td><td></td></tr><tr><td>O(n)</td><td>O(n)</td><td>4</td><td>6</td><td>如采用计数排序思想，见表后Majority1程序</td></tr><tr><td>O(nlog2n)</td><td>其他</td><td>3</td><td>6</td><td>如采用其他排序的思想</td></tr><tr><td>≥O(n2)</td><td>其他</td><td>3</td><td>5</td><td>其他方法</td></tr></table>

int Majority1 ( int A[ ], int n) // 采用计数排序思想，时间：O(n), 空间：O(n)

\`\`\`javascript
{ int k,\\*p,max;  $\\mathrm{p} = (\\mathrm{int}^{*})$  malloc（sizeof（int）\\*n); //申请辅助计数数组 for  $(\\mathrm{k = 0};\\mathrm{k <   n};\\mathrm{k + + })$  p[k]=0; //计数数组清0 max  $= 0$  · for  $(\\mathrm{k = 0};\\mathrm{k <   n};\\mathrm{k + + })$  {p[A[k]  $] + +$  ： //计数器  $+1$  if(p[A[k]  $\\rightharpoondown$  p[max]）max=A[k]; //记录出现次数最多的元素 } if(p[ max  $] > \\mathrm{n / 2}$  )return max; else return -1;
\`\`\`

(2) 若在算法的基本设计思想描述中因文字表达没有非常清晰反映出算法思路, 但在算法实现中能够清晰看出算法思想且正确的, 可参照 (1) 的标准给分。
(3) 若算法的基本设计思想描述或算法实现中部分正确, 可参照①中各种情况的相应给分标准酌情给分。
(4) 参考答案中只给出了使用 C 语言的版本, 使用 C++或 Java 语言的答案视同使用 C 语言。

(3) 说明算法复杂性: (2 分)

参考答案中实现的程序的时间复杂度为  $O(n)$ , 空间复杂度为  $O(1)$ 。

【评分说明】若考生所估计的时间复杂度与空间复杂度与考生所实现的算法一致，可各给1分。`,score:13}]},{id:"2013-a42",type:"applied",year:2013,no:42,subject:"数据结构",paper:"408",stem:`设包含4个数据元素的集合  $S = \\{ "do", "for", "repeat", "while" \\}$ ，各元素的查找概率依次为：  $p1 = 0.35$ ，  $p2 = 0.15$ ，  $p3 = 0.15$ ，  $p4 = 0.35$  。将  $S$  保存在一个长度为4的顺序表中，采用折半查找法，查找成功时的平均查找长度为2.2。请回答：

(1) 若采用顺序存储结构保存  $S$ , 且要求平均查找长度更短, 则元素应如何排列? 应使用何种查找方法? 查找成功时的平均查找长度是多少?
(2) 若采用链式存储结构保存  $S$ , 且要求平均查找长度更短, 则元素应如何排列? 应使用何种查找方法? 查找成功时的平均查找长度是多少?`,explanation:"",totalScore:10,parts:[{no:1,stem:`设包含4个数据元素的集合  $S = \\{ "do", "for", "repeat", "while" \\}$ ，各元素的查找概率依次为：  $p1 = 0.35$ ，  $p2 = 0.15$ ，  $p3 = 0.15$ ，  $p4 = 0.35$  。将  $S$  保存在一个长度为4的顺序表中，采用折半查找法，查找成功时的平均查找长度为2.2。请回答：

(1) 若采用顺序存储结构保存  $S$ , 且要求平均查找长度更短, 则元素应如何排列? 应使用何种查找方法? 查找成功时的平均查找长度是多少?
(2) 若采用链式存储结构保存  $S$ , 且要求平均查找长度更短, 则元素应如何排列? 应使用何种查找方法? 查找成功时的平均查找长度是多少?`,answer:`(1) 采用顺序存储结构, 数据元素按其查找概率降序排列。(2 分)

采用顺序查找方法。（1分）

查找成功时的平均查找长度  $= 0.35 \\times 1 + 0.35 \\times 2 + 0.15 \\times 3 + 0.15 \\times 4 = 2.1$ 。（2分）（2）

【答案一】

采用链式存储结构，数据元素按其查找概率降序排列，构成单链表。（2分）

采用顺序查找方法。（1分）

查找成功时的平均查找长度  $= 0.35 \\times 1 + 0.35 \\times 2 + 0.15 \\times 3 + 0.15 \\times 4 = 2.1$ 。（2分）

【答案二】

采用二叉链表存储结构，构造二叉排序树，元素存储方式见下图。（2分）

![](https://408.foreverlink.love/images/b905a6c8a44c65eb722d7972a8b45e7b.jpg)
二叉排序树1

![](https://408.foreverlink.love/images/b990bead1f20a7aef78f6d70d6c16481.jpg)
二叉排序树2
或

采用二叉排序树的查找方法。（1分）

查找成功时的平均查找长度  $= 0.15 \\times 1 + 0.35 \\times 2 + 0.35 \\times 2 + 0.15 \\times 3 = 2.0$ 。（2分）

【（1）、（2）的评分说明】

(1) 若考生以实际元素表示“降序排列”，同样给分。
(2) 若考生正确求出与其查找方法对应的查找成功时的平均查找长度, 给 2 分; 若计算过程正确, 但结果错误, 给 1 分。
(3) 若考生给出其他更高效的查找方法且正确, 可参照评分标准给分。`,score:10}]},{id:"2013-a43",type:"applied",year:2013,no:43,subject:"计算机组成原理",paper:"408",stem:"某32位计算机，CPU主频为  $800\\mathrm{MHz}$ ，Cache命中时的CPI为4，Cache块大小为32字节；主存采用8体交叉存储方式，每个体的存储字长为32位、存储周期为  $40~\\mathrm{ns}$ ；存储器总线宽度为32位，总线时钟频率为  $200\\mathrm{MHz}$ ，支持突发传送总线事务。每次读突发传送总线事务的过程包括：送首地址和命令、存储器准备数据、传送数据。每次突发传送32字节，传送地址或32位数据均需要一个总线时钟周期。请回答下列问题，要求给出理由或计算过程。",explanation:"",totalScore:9,parts:[{no:1,stem:"CPU 和总线的时钟周期各为多少? 总线的带宽 (即最大数据传输率) 为多少?",answer:`CPU 的时钟周期为:  $1 / 800 \\mathrm{MHz} = 1.25 \\mathrm{~ns}$ 。(1 分)
总线的时钟周期为： $1 / 200\\mathrm{MHz} = 5$  ns。（1分）

总线带宽为:  $4 \\mathrm{~B} \\times 200 \\mathrm{MHz} = 800 \\mathrm{MB} / \\mathrm{s}$  或  $4 \\mathrm{~B} / 5 \\mathrm{~ns} = 800 \\mathrm{MB} / \\mathrm{s}$  。(1 分)`,score:null},{no:2,stem:"Cache 缺失时, 需要用几个读突发传送总线事务来完成一个主存块的读取?",answer:"Cache 块大小是  $32 \\mathrm{~B}$ , 因此 Cache 缺失时需要一个读突发传送总线事务读取一个主存块。(1 分)",score:null},{no:3,stem:"存储器总线完成一次读突发传送总线事务所需的时间是多少?",answer:`一次读突发传送总线事务包括一次地址传送和  $32 \\mathrm{~B}$  数据传送: 用 1 个总线时钟周期
传输地址；每隔  $40~\\mathrm{ns} / 8 = 5~\\mathrm{ns}$  启动一个体工作（各进行1次存取），第一个体读数据花费  $40~\\mathrm{ns}$ ，之后数据存取与数据传输重叠；用8个总线时钟周期传输数据。读突发传送总线事务时间： $5\\mathrm{ns} + 40\\mathrm{ns} + 8\\times 5\\mathrm{ns} = 85\\mathrm{ns}$ 。（2分）`,score:null},{no:4,stem:"若程序 BP 执行过程中, 共执行了 100 条指令, 平均每条指令需进行 1.2 次访存, Cache 缺失率为  $5\\%$ , 不考虑替换等开销, 则 BP 的 CPU 执行时间是多少?",answer:`BP 的 CPU 执行时间包括 Cache 命中时的指令执行时间和 Cache 缺失时带来的额外开销。命中时的指令执行时间:  $100 \\times 4 \\times 1.25 \\mathrm{~ns} = 500 \\mathrm{~ns}$ 。（1 分）指令执行过程中 Cache 缺失时的额外开销:  $1.2 \\times 100 \\times 5\\% \\times 85 \\mathrm{~ns} = 510 \\mathrm{~ns}$  。BP 的 CPU 执行时间:  $500 \\mathrm{~ns} + 510 \\mathrm{~ns} = 1010 \\mathrm{~ns}$ 。（2 分）
【评分说明】

(1) 执行时间采用如下公式计算时, 可酌情给分。

执行时间=指令条数×CPI×时钟周期×命中率+访存次数×缺失率×缺失损失

(2) 计算公式正确但运算结果不正确时, 可酌情给分。`,score:null}]},{id:"2013-a44",type:"applied",year:2013,no:44,subject:"计算机组成原理",paper:"408",stem:`某计算机采用 16 位定长指令字格式, 其 CPU 中有一个标志寄存器, 其中包含进位/借位标志 CF、零标志 ZF 和符号标志 NF。假定为该机设计了条件转移指令, 其格式如下:

下：

<table><tr><td>15</td><td>11</td><td>10</td><td>9</td><td>8</td><td>7</td><td>0</td></tr><tr><td>0</td><td>0</td><td>0</td><td>0</td><td>C</td><td>Z</td><td>N</td></tr><tr><td colspan="7">OFFSET</td></tr></table>

其中，00000 为操作码 OP；C、Z 和 N 分别为 CF、ZF 和 NF 的对应检测位，某检测位为 1 时表示需检测对应标志，需检测的标志位中只要有一个为 1 就转移，否则不转移，例如，若  $C = 1$ ， $Z = 0$ ， $N = 1$ ，则需检测 CF 和 NF 的值，当  $CF = 1$  或  $NF = 1$  时发生转移；OFFSET 是相对偏移量，用补码表示。转移执行时，转移目标地址为（PC）+2+2×OFFSET；顺序执行时，下条指令地址为（PC）+2。请回答下列问题。`,explanation:"",totalScore:14,parts:[{no:1,stem:"该计算机存储器按字节编址还是按字编址? 该条件转移指令向后（反向）最多可跳转多少条指令?",answer:`因为指令长度为 16 位, 且下条指令地址为 (PC) +2 , 故编址单位是字节。(1 分) 偏移 OFFSET 为 8 位补码, 范围为-128~127, 故相对于当前条件转移指令, 向后最多可跳转 127 条指令。(2 分)
【评分说明】若正确给出OFFSET的取值范围，则酌情给分。`,score:null},{no:2,stem:`某条件转移指令的地址为  $200 \\mathrm{CH}$ , 指令内容如下图所示, 若该指令执行时  $\\mathrm{CF} = 0$ ,  $\\mathrm{ZF} = 0$ ,  $\\mathrm{NF} = 1$ , 则该指令执行后 PC 的值是多少? 若该指令执行时  $\\mathrm{CF} = 1$ ,  $\\mathrm{ZF} = 0$ ,  $\\mathrm{NF} = 0$ , 则该指令执行后 PC 的值又是多少? 请给出计算过程。
<table><tr><td>15</td><td>11</td><td>10</td><td>9</td><td>8</td><td>7</td><td>0</td></tr><tr><td>0</td><td>0</td><td>0</td><td>0</td><td>1</td><td>1</td><td>1 1 1 0 0 0 1 1</td></tr></table>`,answer:"指令中  $C = 0, Z = 1, N = 1$ , 故应根据ZF和NF的值来判断是否转移。当  $\\mathrm{CF} = 0, ZF = 0, NF = 1$  时, 需转移。(1 分) 已知指令中偏移量为  $11100011B = E3H$ , 符号扩展后为 FFE3 H, 左移一位 (乘 2) 后为 FFC6 H, 故 PC 的值 (即转移目标地址) 为  $200CH + 2 + FFC6H = 1FD4H$  。(2 分) 当  $\\mathrm{CF} = 1, ZF = 0, NF = 0$  时不转移。(1 分) PC 的值为:  $200CH + 2 = 200EH$  。(1 分)",score:null},{no:3,stem:"实现“无符号数比较小于等于时转移”功能的指令中, C、Z 和 N 应各是什么?",answer:"指令中的 C、Z 和 N 应分别设置为  $C = Z = 1$ ,  $N = 0$ 。（3 分）",score:null},{no:4,stem:`以下是该指令对应的数据通路示意图, 要求给出图中部件①~③的名称或功能说明。
![](https://408.foreverlink.love/images/fb89602081a502101877d212863c11e1.jpg)`,answer:`部件①: 指令寄存器 (用于存放当前指令); 部件②: 移位寄存器 (用于左移一位); 部件③: 加法器 (地址相加)。(3 分)
【评分说明】合理给出部件名称或功能说明均给分。`,score:null}]},{id:"2013-a45",type:"applied",year:2013,no:45,subject:"操作系统",paper:"408",stem:`某博物馆最多可容纳500人同时参观，有一个出入口，该出入口一次仅允许一个人通过。参观者的活动描述如下：

cobegin

参观者进程i:

\`\`\`txt
{
    ...
    进门；
    ...
    参观；
    ...
    出门；
    ...
}
coend
\`\`\`

请添加必要的信号量和 P、V（或 wait()、signal()）操作，以实现上述过程中的互斥与同步。要求写出完整的过程，说明信号量的含义并赋初值。`,explanation:"",totalScore:7,parts:[{no:1,stem:`某博物馆最多可容纳500人同时参观，有一个出入口，该出入口一次仅允许一个人通过。参观者的活动描述如下：

cobegin

参观者进程i:

\`\`\`txt
{
    ...
    进门；
    ...
    参观；
    ...
    出门；
    ...
}
coend
\`\`\`

请添加必要的信号量和 P、V（或 wait()、signal()）操作，以实现上述过程中的互斥与同步。要求写出完整的过程，说明信号量的含义并赋初值。`,answer:`定义两个信号量

Semaphore empty  $= 500$  //博物馆可以容纳的最多人数（2分）

Semaphore mutex = 1; //用于出入口资源的控制（2分）

参观者进程i;

{

··

P (empty);

P (mutex);

进门；

V (mutex);

参观;

P (mutex);

\`\`\`txt
出门;
V(mutex
V(empty
}
coend（3分）
\`\`\`

【评分说明】

(1) 信号量初值给 1 分, 说明含义给 1 分, 两个信号量的初值和含义共 4 分。
② 对 mutex 的 P、V 操作正确给 2 分。
(3) 对 empty 的 P、V 操作正确给 1 分。
(4) 其他答案, 参照①~③的标准给分。`,score:7}]},{id:"2013-a46",type:"applied",year:2013,no:46,subject:"操作系统",paper:"408",stem:"某计算机主存按字节编址，逻辑地址和物理地址都是32位，页表项大小为4字节。请回答下列问题。",explanation:"",totalScore:8,parts:[{no:1,stem:`若使用一级页表的分页存储管理方式，逻辑地址结构为：
<table><tr><td>页号（20位）</td><td>页内偏移量（12位）</td></tr></table>

则页的大小是多少字节？页表最大占用多少字节？`,answer:`因为页内偏移量是 12 位, 所以页大小为  $4 \\mathrm{KB}$ , (1 分)
页表项数为  $2^{32} / 4 \\mathrm{~K} = 2^{20}$ , 该一级页表最大为  $2^{20} \\times 4 \\mathrm{~B} = 4 \\mathrm{MB}$  。(2 分)`,score:null},{no:2,stem:`若使用二级页表的分页存储管理方式, 逻辑地址结构为:
<table><tr><td>页目录号（10位）</td><td>页表索引（10位）</td><td>页内偏移量（12位）</td></tr></table>

设逻辑地址为LA，请分别给出其对应的页目录号和页表索引的表达式。`,answer:`页目录号可表示为：((unsigned int)(LA))>>22)&0x3FF。（1分）
页表索引可表示为：((unsigned int)(LA))>>12)&0x3FF。(1分)

【评分说明】

① 页目录号也可以写成((unsigned int)(LA))>>22；如果两个表达式没有对LA进行类型转换，同样给分。
(2) 如果用除法和其他开销很大的运算方法, 但对基本原理是理解的, 同样给分。
③ 参考答案给出的是 C 语言的描述，用其他语言（包括自然语言）正确地表述了，同样给分。`,score:null},{no:3,stem:`采用 (1) 中的分页存储管理方式, 一个代码段起始逻辑地址为  $00008000\\mathrm{H}$ , 其长度为  $8 \\mathrm{KB}$ , 被装载到从物理地址 00900000H 开始的连续主存空间中。页表从主存 00200000H 开始的物理地址处连续存放, 如下图所示 (地址大小自下向上递增)。请计算出该代码段对应的两个页表项的物理地址、这两个页表项中的页框号以及代码页面 2 的起始物理地址。
![](https://408.foreverlink.love/images/9a0fd9c42ced9db237132009e051f067.jpg)`,answer:`代码页面 1 的逻辑地址为  $00008000\\mathrm{H}$ , 表明其位于第 8 个页处, 对应页表中的第 8 个页表项, 所以第 8 个页表项的物理地址 = 页表起始地址  $+8 \\times$  页表项的字节数 = 0020  $0000\\mathrm{H} + 8 \\times 4 = 00200020\\mathrm{H}$  。由此可得如下图所示的答案。(3 分)
![](https://408.foreverlink.love/images/3f2c66eae0233f6c6fe0fe0a4aac1883.jpg)

【评分说明】共5个答数。物理地址1和物理地址2共1分；页框号1和页框号2共1分；物理地址3给1分。`,score:null}]},{id:"2013-a47",type:"applied",year:2013,no:47,subject:"计算机网络",paper:"408",stem:`假设Internet的两个自治系统构成的网络如题47图所示，自治系统ASI由路由器R1连接两个子网构成；自治系统AS2由路由器R2、R3互联并连接3个子网构成。各子

网地址、R2的接口名、R1与R3的部分接口IP地址如题47图所示。

![](https://408.foreverlink.love/images/544dc93389d484266767f3815e2f8522.jpg)
题47图 网络拓扑结构

请回答下列问题。`,explanation:"",totalScore:9,parts:[{no:1,stem:`假设路由表结构如下表所示。请利用路由聚合技术, 给出 R2 的路由表, 要求包括到达题 47 图中所有子网的路由, 且路由表中的路由项尽可能少。
<table><tr><td>目的网络</td><td>下一跳</td><td>接口</td></tr></table>`,answer:`（6分）在AS1中，子网153.14.5.0/25和子网153.14.5.128/25可以聚合为子网153.14.5.0/24；在AS2中，子网194.17.20.0/25和子网194.17.21.0/24可以聚合为子网194.17.20.0/23，但缺少194.17.20.128/25；子网194.17.20.128/25单独连接到R2的接口E0。
于是可以得到 R2 的路由表如下：

<table><tr><td>目的网络</td><td>下一跳</td><td>接口</td></tr><tr><td>153.14.5.0/24</td><td>153.14.3.2</td><td>S0</td></tr><tr><td>194.17.20.0/23</td><td>194.17.24.2</td><td>S1</td></tr><tr><td>194.17.20.128/25</td><td>—</td><td>E0</td></tr></table>

【评分说明】

① 每正确解答 1 个路由项, 给 2 分, 共 6 分, 每条路由项正确解答目的网络 IP 地址但无前缀长度, 给 0.5 分, 正确解答前缀长度给 0.5 分, 正确解答下一跳 IP 地址给 0.5 分, 正确解答接口给 0.5 分。`,score:null},{no:2,stem:"若 R2 收到一个目的 IP 地址为 194.17.20.200 的 IP 分组, R2 会通过哪个接口转发该 IP 分组?",answer:`路由项解答部分正确或路由项多于3条，可酌情给分。
(2) 该 IP 分组的目的 IP 地址 194.17.20.200 与路由表中 194.17.20.0/23 和 194.17.20.128/25 两个路由表项均匹配, 根据最长匹配原则, R2 将通过 E0 接口转发该 1P 分组。(1 分)`,score:null},{no:3,stem:"R1 与 R2 之间利用哪个路由协议交换路由信息? 该路由协议的报文被封装到哪个协议的分组中进行传输?",answer:`R1 与 R2 之间利用 BGP4（或 BGP）交换路由信息；（1 分）BGP4 的报文被封装到 TCP 协议段中进行传输。（1 分）
【评分说明】

若考生解答为 EGP 协议，且正确解答 EGP 采用 IP 协议进行通信，亦给分。`,score:null}]},{id:"2014-a41",type:"applied",year:2014,no:41,subject:"数据结构",paper:"408",stem:`二叉树的带权路径长度(WPL)是二叉树中所有叶结点的带权路径长度之和。给定一棵二叉树T，采用二叉链表存储，结点结构为：

<table><tr><td>left</td><td>weight</td><td>right</td></tr></table>

其中叶结点的 weight 域保存该结点的非负权值。设 root 为指向 T 的根结点的指针，请设计求 T 的 WPL 的算法，要求：`,explanation:"",totalScore:13,parts:[{no:1,stem:"给出算法的基本设计思想；",answer:`算法的基本设计思想：
①基于先序递归遍历的算法思想是用一个static变量记录wpl，把每个结点的深度作为递归函数的一个参数传递，算法步骤如下：

若该结点是叶子结点，那么变量wp1加上该结点的深度与权值之积；

若该结点非叶子结点，那么若左子树不为空，对左子树调用递归算法，若右子树不为空，对右子树调用递归算法，深度参数均为本结点的深度参数加一；

最后返回计算出的wpl即可。`,score:null},{no:2,stem:"使用C或  $\\mathbf{C} + +$  语言，给出二叉树结点的数据类型定义；",answer:`基于层次遍历的算法思想是使用队列进行层次遍历，并记录当前的层数，
当遍历到叶子结点时，累计wpl;

当遍历到非叶子结点时对该结点的把该结点的子树加入队列；

当某结点为该层的最后一个结点时，层数自增1；

队列空时遍历结束，返回wpl

2)二叉树结点的数据类型定义如下：

\`\`\`txt
typedef struct BiTNode{ int weight; struct BiTNode \\*lchild,\\*rchild; }BiTNode,\\*BiTree;
\`\`\``,score:null},{no:3,stem:"根据设计思想，采用C或  $\\mathbf{C} + +$  语言描述算法，关键之处给出注释。",answer:`算法代码如下：
①基于先序遍历的算法：

\`\`\`txt
int WPL(BiTree root){ return wpl_PreOrder(root,0); } int wpl_PreOrder(BiTree root,int deep){ static int  $\\mathrm{wpl} = 0$  //定义一个static变量存储wpl
\`\`\`

\`\`\`c
if(root->lchild == NULL && root->lchild == NULL) //若为叶子结点，累积wpl
wpl += deep*root->weight;
if(root->lchild != NULL) //若左子树不空，对左子树递归遍历
wpl_PreOrder(root->lchild, deep+1);
if(root->rchild != NULL) //若右子树不空，对右子树递归遍历
wpl_PreOrder(root->rchild, deep+1);
return wpl;
\`\`\`

②基于层次遍历的算法：

\`\`\`txt
define MaxSize 100 //设置队列的最大容量
int wpl_LevelOrder(BiTree root){
BiTree q[MaxSize]; //声明队列，end1为头指针，end2为尾指针
int end1, end2; //队列最多容纳MaxSize-1个元素
end1 = end2 = 0; //头指针指向队头元素，尾指针指向队尾的后一个元素
int wpl = 0, deep = 0; //初始化wpl和深度
BiTree lastNode; //lastNode用来记录当前层的最后一个结点
BiTree newlastNode; //newlastNode用来记录下一层的最后一个结点
lastNode = root; //lastNode初始化为根节点
newlastNode = NULL; //newlastNode初始化为空
q[end2++] = root; //根节点入队
while(end1 != end2){ //层次遍历，若队列不空则循环
BiTree t = q[end1++]; //拿出队列中的头一个元素
if(t->lchild == NULL & t->lchild == NULL) {
wpl += deep*t->weight;
} //若为叶子结点，统计wpl
if(t->lchild != NULL) { //若非叶子结点把左结点入队
q[end2++] = t->lchild;
newlastNode = t->lchild;
} //并设下一层的最后一个结点为该结点的左结点
if(t->rchild != NULL) { //处理叶节点
q[end2++] = t->rchild;
newlastNode = t->rchild;
}
if(t == lastNode) { //若该结点为本层最后一个结点，更新lastNode
lastNode = lastNode;
deep += 1; //层数加1
}
}
return wpl; //返回wpl
\`\`\`

【评分说明】

①若考生给出能够满足题目要求的其他算法，且正确，可同样给分。
(2)考生答案无论使用 C 或者 C++ 语言, 只要正确同样给分。
③若对算法的基本设计思想和主要数据结构描述不十分准确，但在算法实现中能够清晰反映出算法思想且正确，参照①的标准给分。
④若考生给出的二叉树结点的数据类型定义和算法实现中，使用的是除整型之外的其他数值，可视同使用整型类型。
⑤若考生给出的答案中算法主要设计思想或算法中部分正确，可酌情给分。

注意：上述两个算法一个为递归的先序遍历，一个为非递归的层次遍历，读者应当选取自己最擅长的书写方式。直观看去，先序遍历代码行数少，不用运用其他工具，书写也更容易，希望读者能掌握。

在先序遍历的算法中，static 是一个静态变量，只在首次调用函数时声明 wpl 并赋值为 0，以后的递归调用并不会使得 wpl 为 0，具体用法请参考相关资料中的 static 关键字说明，也可以在函数之外预先设置一个全局变量，并初始化。不过考虑到历年真题算法答案通常都

直接仅仅由一个函数构成，所以参考答案使用static。若对static不熟悉的同学可以使用以下形式的递归：

\`\`\`c
int wpl_PreOrder(BiTree root, int deep){ //用于存储左子树和右子树的产生的wpl
int lwpl, rwpl;
lwpl = rwpl = 0;
if(root->lchild == NULL && root->lchild == NULL) //若为叶子结点，计算当前叶子结点的wpl
return deep*root->weight;
if(root->lchild != NULL) //若左子树不空，对左子树递归遍历
lwpl = wpl_PreOrder(root->lchild, deep+1);
if(root->rchild != NULL) //若右子树不空，对右子树递归遍历
rwpl = wpl_PreOrder(root->rchild, deep+1);
return lwpl + rwpl;
\`\`\`

C/C++语言基础好的同学可以使用更简便的以下形式：

\`\`\`c
int wpl_PreOrder(BiTree root, int deep){
if(root->lchild == NULL && root->lchild == NULL) //若为叶子结点，累积wpl
return deep * root->weight;
return (root->lchild != NULL ? wpl_PreOrder(root->lchild, deep + 1) : 0)
+ (root->rchild != NULL ? wpl_PreOrder(root->rchild, deep + 1) : 0);
}
\`\`\`

这个形式只是上面方法的简化而已，本质是一样的，而这个形式代码更短，在时间有限的情况下更具优势，能比写层次遍历的考生节约很多时间，所以读者应当在保证代码正确的情况下，尽量写一些较短的算法，为其他题目赢得更多的时间。但是，对于基础不扎实的考生，还是建议使用写对把握更大的方法，否则可能会得不偿失。例如在上面的代码中，考生容易忘记三元式(x?y:z)两端的括号，若不加括号，则答案就会是错误的。

在层次遍历的算法中，读者要理解lastNode和newlastNode的区别，lastNode指的是当前遍历层的最后一个结点，而newlastNode指的是下一层的最后一个结点，是动态变化的，直到遍历到本层的最后一个结点，才能确认下层真正的最后一个结点是哪个结点，而函数中入队操作并没有判断队满，若考试时用到，读者最好加上队满条件，这里队列的队满条件为  $\\mathrm{end1} == (\\mathrm{end2} + 1)\\% \\mathrm{M}$ ，采用的是2014年真题选择题中第三题的队列形式。同时，考生也可以尝试使用记录每层的第一个结点来进行层次遍历的算法，这里不再给出代码，请考生自行练习。`,score:null}]},{id:"2014-a42",type:"applied",year:2014,no:42,subject:"数据结构",paper:"408",stem:`某网络中的路由器运行OSPF路由协议，题42表是路由器R1维护的主要链路状态信息(LSI)，题42图是根据题42表及R1的接口名构造出来的网络拓扑。

题42表 R1所维护的LSI

<table><tr><td colspan="2"></td><td>R1的LSI</td><td>R2的LSI</td><td>R3的LSI</td><td>R4的LSI</td><td>备注</td></tr><tr><td colspan="2">Router ID</td><td>10.1.1.1</td><td>10.1.1.2</td><td>10.1.1.5</td><td>10.1.1.6</td><td>标识路由器的IP地址</td></tr><tr><td rowspan="3">Link1</td><td>ID</td><td>10.1.1.2</td><td>10.1.1.1</td><td>10.1.1.6</td><td>10.1.1.5</td><td>所连路由器的Router ID</td></tr><tr><td>IP</td><td>10.1.1.1</td><td>10.1.1.2</td><td>10.1.1.5</td><td>10.1.1.6</td><td>Link1的本地IP地址</td></tr><tr><td>Metric</td><td>3</td><td>3</td><td>6</td><td>6</td><td>Link1的费用</td></tr><tr><td rowspan="3">Link2</td><td>ID</td><td>10.1.1.5</td><td>10.1.1.6</td><td>10.1.1.1</td><td>10.1.1.2</td><td>所连路由器的Router ID</td></tr><tr><td>IP</td><td>10.1.1.9</td><td>10.1.1.13</td><td>10.1.1.10</td><td>10.1.1.14</td><td>Link2的本地IP地址</td></tr><tr><td>Metric</td><td>2</td><td>4</td><td>2</td><td>4</td><td>Link2的费用</td></tr><tr><td rowspan="2">Net1</td><td>Prefix</td><td>192.1.1.0/24</td><td>192.1.6.0/24</td><td>192.1.5.0/24</td><td>192.1.7.0/24</td><td>直连网络Net1的网络前缀</td></tr><tr><td>Metric</td><td>1</td><td>1</td><td>1</td><td>1</td><td>到达直连网络Net1的费用</td></tr></table>

![](https://408.foreverlink.love/images/c48b662d85d5c7219deb414f152a3f4c.jpg)
题42图R1构造的网络拓扑

请回答下列问题。`,explanation:"",totalScore:10,parts:[{no:1,stem:"本题中的网络可抽象为数据结构中的哪种逻辑结构？",answer:`图(1分)
题中给出的是一个简单的网络拓扑图，可以抽象为无向图。

【评分说明】

只要考生的答案中给出与图含义相似的描述，例如“网状结构”、“非线性结构”等，同样给分。`,score:null},{no:2,stem:"针对题42表中的内容，设计合理的链式存储结构，以保存题42表中的链路状态信息(LSI)。要求给出链式存储结构的数据类型定义，并画出对应题42表的链式存储结构示意图(示意图中可仅以ID标识结点)。",answer:`链式存储结构的如下图所示
弧结点的两种基本形态

<table><tr><td>Flag=1</td><td>Next</td></tr><tr><td colspan="2">ID</td></tr><tr><td colspan="2">IP</td></tr><tr><td colspan="2">Metric</td></tr></table>

<table><tr><td>Flag=2</td><td>Next</td></tr><tr><td colspan="2">Prefix</td></tr><tr><td colspan="2">Mask</td></tr><tr><td colspan="2">Metric</td></tr></table>

表头结点结构示意

<table><tr><td>RouterID</td></tr><tr><td>LN_link</td></tr><tr><td>Next</td></tr></table>

其数据类型定义如下：(3分)

\`\`\`txt
typedef struct{
\`\`\`

\`\`\`c
unsigned int ID, IP;
}LinkNode; //Link的结构
typedef struct{
unsigned int Prefix, Mask;
}NetNode; //Net的结构
typedef struct Node{
int Flag; //Flag=1为Link; Flag=2为Net
union{ LinkNode Lnode; NetNode Nnode
}LinkORNet;
unsigned int Metric;
struct Node *next;
}ArcNode; //弧结点
typedef struct HNode{
unsigned int RouterID; ArcNode *LN_link;
Struct HNode *next;
}HNODE; //表头结点
\`\`\`

对应题 42 表的链式存储结构示意图如下。(2 分)

![](https://408.foreverlink.love/images/7f8a2636efcbd163c83a93a4854ef3c2.jpg)

【评分说明】

① 若考生给出的答案是将链表中的表头结点保存在一个一维数组中(即采用邻接表形式)，同样给分。
②若考生给出的答案中，弧结点没有使用union定义，而是采用两种不同的结构分别表示Link和Net，同时在表头结点中定义了两个指针，分别指向由这两种类型的结点构成的两个链表，同样给分。
③考生所给答案的弧结点中，可以在单独定义的域中保存各直连网络 IP 地址的前缀长度，也可以与网络地址保存在同一个域中。
(4) 数据类型定义中, 只要采用了可行的链式存储结构, 并保存了题目中所给的 LSI 信息,例如将网络抽象为一类结点, 写出含 8 个表头结点的链式存储结构, 均可参照①~③的标准给分。
(5)若考生给出的答案中, 图示部分应与其数据类型定义部分一致, 图示只要能够体现链

式存储结构及题42图中的网络连接关系（可以不给出结点内细节信息），即可给分。

⑥若解答不完全正确，酌情给分。`,score:null},{no:3,stem:"按照迪杰斯特拉(Dijikstra)算法的策略，依次给出R1到达题42图中子网192.1.x.x的最短路径及费用。",answer:`计算结果如下表所示。(4分)
<table><tr><td></td><td>目的网络</td><td>路径</td><td>代价（费用）</td></tr><tr><td>步骤1</td><td>192.1.1.0/24</td><td>直接到达</td><td>1</td></tr><tr><td>步骤2</td><td>192.1.5.0/24</td><td>R1→R3→192.1.5.0/24</td><td>3</td></tr><tr><td>步骤3</td><td>192.1.6.0/24</td><td>R1→R2→192.1.6.0/24</td><td>4</td></tr><tr><td>步骤4</td><td>192.1.7.0/24</td><td>R1→R2→R4→192.1.7.0/24</td><td>8</td></tr></table>

【评分说明】

(1)若考生给出的各条最短路径的结果部分正确, 可酌情给分。
(2)若考生给出的从 R1 到达子网 192.1.x.x 的最短路径及代价正确, 但不完全符合代价不减的次序, 可酌情给分。`,score:null}]},{id:"2014-a43",type:"applied",year:2014,no:43,subject:"计算机网络",paper:"408",stem:"请根据题42描述的网络，继续回答下列问题。",explanation:"",totalScore:9,parts:[{no:1,stem:`假设路由表结构如下表所示，请给出题 42 图中 R1 的路由表，要求包括到达题 42
图中子网192.1.x.x的路由，且路由表中的路由项尽可能少。

<table><tr><td>目的网络</td><td>下一条</td><td>接口</td></tr></table>`,answer:`因为题目要求路由表中的的路由项尽可能少，所以这里可以把子网 192.1.6.0/24 和 192.1.7.0/24 聚合为子网 192.1.6.0/23。其他网络照常，可得到路由表如下：(6 分)
<table><tr><td>目的网络</td><td>下一条</td><td>接口</td></tr><tr><td>192.1.1.0/24</td><td>-</td><td>E0</td></tr><tr><td>192.1.6.0/23</td><td>10.1.1.2</td><td>L0</td></tr><tr><td>192.1.5.0/24</td><td>10.1.1.10</td><td>L1</td></tr></table>

【评分说明】

①每正确解答一个路由项，给2分，共6分。`,score:null},{no:2,stem:"当主机192.1.1.130向主机192.1.7.211发送一个  $\\mathrm{TL} = 64$  的IP分组时，R1通过哪个接口转发该IP分组？主机192.1.7.211收到的IP分组TTL是多少？",answer:`路由项解答不完全正确, 或路由项多于 3 条, 可酌情给分。
(2) 通过查路由表可知: R1 通过 L0 接口转发该 IP 分组。(1 分)因为该分组要经过 3 个路由器(R1、R2、R4), 所以主机 192.1.7.211 收到的 IP 分组的 TTL 是  $64 - 3 = 61$  。(1 分)`,score:null},{no:3,stem:"若R1增加一条Metric为10的链路连接Internet，则题42表中R1的LSI需要增加哪些信息？",answer:`R1 的 LSI 需要增加一条特殊的直连网络，网络前缀 Prefix 为“0.0.0.0/0”，Metric 为 10。(1 分)
【评分说明】

考生只要回答：增加前缀 Prefix 为“0.0.0.0/0”，Metric 为 10，同样给分。`,score:null}]},{id:"2014-a44",type:"applied",year:2014,no:44,subject:"计算机组成原理",paper:"408",stem:`某程序中有如下循环代码段p：”for(int i = 0; i < N; i++) sum += A[i]；”。假设编译时变量sum和i分别分配在寄存器R1和R2中。常量N在寄存器R6中，数组A的首地址在寄存器R3中。程序段P起始地址为08048100H，对应的汇编代码和机器代码如下表所示。

<table><tr><td>编号</td><td>地址</td><td>机器代码</td><td>汇编代码</td><td>注释</td></tr><tr><td>1</td><td>08048100H</td><td>00022080H</td><td>loop: sll R4,R2,2</td><td>(R2) \\(&lt;&lt;2 \\rightarrow\\) R4</td></tr><tr><td>2</td><td>08048104H</td><td>00083020H</td><td>add R4,R4,R3</td><td>(R4)+(R3) → R4</td></tr><tr><td>3</td><td>08048108H</td><td>8C850000H</td><td>load R5,0(R4)</td><td>((R4)+0) → R5</td></tr><tr><td>4</td><td>0804810CH</td><td>00250820H</td><td>add R1,R1,R5</td><td>(R1)+(R5) → R1</td></tr><tr><td>5</td><td>08048110H</td><td>20420001H</td><td>add R2,R2,1</td><td>(R2)+1 → R2</td></tr><tr><td>6</td><td>08048114H</td><td>1446FFFFAH</td><td>bne R2,R6,loop</td><td>if(R2)!=(R6) goto loop</td></tr></table>

执行上述代码的计算机M采用32位定长指令字，其中分支指令bne采用如下格式：

<table><tr><td>31</td><td>26</td><td>25</td><td>21</td><td>20</td><td>16</td><td>15</td><td>0</td></tr><tr><td>OP</td><td colspan="2">Rs</td><td colspan="2">Rd</td><td colspan="3">OFFSET</td></tr></table>

OP 为操作码;;Rs 和 Rd 为寄存器编号；OFFSET 为偏移量，用补码表示。请回答下列问题，并说明理由。`,explanation:"",totalScore:12,parts:[{no:1,stem:"M的存储器编址单位是什么？",answer:"已知计算机 M 采用 32 位定长指令字, 即一条指令占 4B, 观察表中各指令的地址可知,每条指令的地址差为 4 个地址单位, 即 4 个地址单位代表 4B, 一个地址单位就代表了 1B,所以该计算机是按字节编址的。(2 分)",score:null},{no:2,stem:"已知sll指令实现左移功能，数组A中每个元素占多少位？",answer:"在二进制中某数左移二位相当于以乘四，由该条件可知，数组间的数据间隔为4个地址单位，而计算机按字节编址，所以数组A中每个元素占4B。(2分)",score:null},{no:3,stem:"题44表中bne指令的OFFSET字段的值是多少？已知bne指令采用相对寻址方式，当前PC内容为bne指令地址，通过分析题44表中指令地址和bne指令内容，推断出bne指令的转移目标地址计算公式。",answer:`由表可知，bne指令的机器代码为1446FFFAH，根据题目给出的指令格式，后2B的内容为OFFSET字段，所以该指令的OFFSET字段为FFFAH，用补码表示，值为-6。(1分)当系统执行到bne指令时，PC自动加4，PC的内容就为08048118H，而跳转的目标是
08048100H，两者相差了  $18 \\mathrm{H}$ ，即 24 个单位的地址间隔，所以偏移址的一位即是真实跳转地址的 -24/-6=4 位。(1 分)可知 bne 指令的转移目标地址计算公式为  $(\\mathrm{PC}) + 4 + \\mathrm{OFFSET} * 4$ 。(1 分)`,score:null},{no:4,stem:"若 M 采用如下“按序发射、按序完成”的 5 级指令流水线：IF（取值）、ID（译码及取数）、EXE（执行）、MEM（访存）、WB（写回寄存器），且硬件不采取任何转发措施，分支指令的执行均引起 3 个时钟周期的阻塞，则 P 中哪些指令的执行会由于数据相关而发生流水线阻塞？哪条指令的执行会发生控制冒险？为什么指令 1 的执行不会因为与指令 5 的数据相关而发生阻塞？",answer:`由于数据相关而发生阻塞的指令为第2、3、4、6条，因为第2、3、4、6条指令都与各自前一条指令发生数据相关。(3分)
第6条指令会发生控制冒险。(1分)

当前循环的第五条指令与下次循环的第一条指令虽然有数据相关，但由于第6条指令后有3个时钟周期的阻塞，因而消除了该数据相关。(1分)

【评分说明】

对于第1问，若考生回答：因为指令1和2、2和3、3和4、5和6发生数据相关，因而发生阻塞的指令为第2、3、4、6条，同样给3分。答对3个以上给3分，部分正确酌情给分。`,score:null}]},{id:"2014-a45",type:"applied",year:2014,no:45,subject:"计算机组成原理",paper:"408",stem:"假设对于 44 题中的计算机 M 和程序 P 的机器代码，M 采用页式虚拟存储管理；P 开始执行时， $(R1)=(R2)=0$ ， $(R6)=1000$ ，其机器代码已调入主存但不在 Cache 中；数组 A 未调入主存，且所有数组元素在同一页，并存储在磁盘同一个扇区。请回答下列问题并说明理由。",explanation:"",totalScore:11,parts:[{no:1,stem:"P 执行结束时, R2 的内容是多少?",answer:"R2里装的是i的值，循环条件是  $\\mathrm{i} < \\mathrm{N}(1000)$ ，即当i自增到不满足这个条件时跳出循环，程序结束，所以此时i的值为1000。(1分)",score:null},{no:2,stem:"M的指令Cache和数据Cache分离。若指令Cache共有16行，Cache和主存交换的块大小为32字节，则其数据区的容量是多少？若仅考虑程序段P的执行，则指令Cache的命中率为多少？",answer:`Cache 共有 16 行, 每块 32 字节, 所以 Cache 数据区的容量为  $16 * 32 \\mathrm{~B} = 512 \\mathrm{~B}$  。 (1 分)
P共有6条指令，占24字节，小于主存块大小(32B)，其起始地址为0804 8100H，对应一块的开始位置，由此可知所有指令都在一个主存块内。读取第一条指令时会发生Cache缺失，故将P所在的主存块调入Cache某一行，以后每次读取指令时，都能在指令Cache中命中。因此在1000次循环中，只会发生1次指令访问缺失，所以指令Cache的命中率为： $(1000\\times 6 - 1) / (1000\\times 6) = 99.98\\%$ 。(2分)

【评分说明】若考生给出正确的命中率，而未说明原因和过程，给1分。若命中率计算错误，但解题思路正确，可酌情给分。`,score:null},{no:3,stem:"P 在执行过程中，哪条指令的执行可能发生溢出异常？哪条指令的执行可能产生缺页异常？对于数组 A 的访问，需要读磁盘和 TLB 至少各多少次？",answer:`指令 4 为加法指令，即对应  $\\mathrm{sum} += \\mathrm{A}[i]$ ，当数组 A 中元素的值过大时，则会导致这条加法指令发生溢出异常；而指令 2、5 虽然都是加法指令，但他们分别为数组地址的计算指令和存储变量 i 的寄存器进行自增的指令，而 i 最大到达 1000，所以他们都不会产生溢出异常。(2 分)
只有访存指令可能产生缺页异常，即指令3可能产生缺页异常。(1分)

因为数组A在磁盘的一页上，而一开始数组并不在主存中，第一次访问数组时会导致访盘，把A调入内存，而以后数组A的元素都在内存中，则不会导致访盘，所以该程序一共访盘一次。(2分)

每访问一次内存数据就会查TLB一次，共访问数组1000次，所以此时又访问TLB1000次，还要考虑到第一次访问数组A，即访问A[0]时，会多访问一次TLB（第一次访问A[0]会先查一次TLB，然后产生缺页，处理完缺页中断后，会重新访问A[0]，此时又查TLB)，所以访问TLB的次数一共是1001次。(2分)

【评分说明】

①对于第1问，若答案中除指令4外还包含其他运算类指令(即指令1、2、5)，则给1分，其他情况，则给0分。
②对于第2问，只要回答“load指令”，即可得分。
③对于第3问，若答案中给出的读TLB的次数为1002，同样给分。若直接给出正确的TLB及磁盘的访问次数，而未说明原因，给3分。若给出的TLB及磁盘访问次数不正确，但解题思路正确，可酌情给分。`,score:null}]},{id:"2014-a46",type:"applied",year:2014,no:46,subject:"操作系统",paper:"408",stem:"文件 F 由 200 条记录组成，记录从 1 开始编号。用户打开文件后，欲将内存中的一条记录插入到文件 F 中，作为其第 30 条记录。请回答下列问题，并说明理由。",explanation:"",totalScore:7,parts:[{no:1,stem:"若文件系统采用连续分配方式，每个磁盘块存放一条记录，文件F存储区域前后均有足够的空闲磁盘空间，则完成上述插入操作最少需要访问多少次磁盘块？F的文件控制块内容会发生哪些改变？",answer:`系统采用顺序分配方式时，插入记录需要移动其他的记录块，整个文件共有200条记录，要插入新记录作为第30条，而存储区前后均有足够的磁盘空间，且要求最少的访问存储块数，则要把文件前29条记录前移，若算访盘次数移动一条记录读出和存回磁盘各是一次访盘，29条记录共访盘58次，存回第30条记录访盘1次，共访盘59次。(1分)
F 的文件控制区的起始块号和文件长度的内容会因此改变。(1 分)`,score:null},{no:2,stem:"若文件系统采用链接分配方式，每个磁盘块存放一条记录和一个链接指针，则完成上述插入操作需要访问多少次磁盘块？若每个存储块大小为1KB，其中4个字节存放链接指针，则该文件系统支持的文件最大长度是多少？",answer:`文件系统采用链接分配方式时，插入记录并不用移动其他记录，只需找到相应的记录，修改指针即可。插入的记录为其第30条记录，那么需要找到文件系统的第29块，一共需要访盘29次，然后把第29块的下块地址部分赋给新块，把新块存回内存会访盘1次，然后修改内存中第29块的下块地址字段，再存回磁盘(1分)，一共访盘31次。(1分)
4 个字节共 32 位，可以寻址  $2^{32} = 4 \\mathrm{~G}$  块存储块，每块的大小为 1KB，即 1024B，其中下块地址部分占 4B，数据部分占 1020B，那么该系统的文件最大长度是  $4 \\mathrm{~G} \\times 1020 \\mathrm{~B} = 4080 \\mathrm{GB}$ 。(2 分)

【评分说明】

(1)第(1)小题的第2问，若答案中不包含文件的起始地址和文件大小，则不给分。
(2)若按  $1024 \\times 2^{32} \\mathrm{~B} = 4096 \\mathrm{~GB}$  计算最大长度, 给 1 分。`,score:null}]},{id:"2014-a47",type:"applied",year:2014,no:47,subject:"操作系统",paper:"408",stem:"系统中有多个生产者进程和多个消费者进程，共享一个能存放 1000 件产品的环形缓冲区（初始为空）。当缓冲区未满时，生产者进程可以放入其生产的一件产品，否则等待；当缓冲区未空时，消费者进程可以从缓冲区取走一件产品，否则等待。要求一个消费者进程从缓冲区连续取出 10 件产品后，其他消费者进程才可以取产品。请使用信号量 P，V.wait()，signal() 操作实现进程间的互斥与同步，要求写出完整的过程，并说明所用信号量的含义和初值。",explanation:"",totalScore:8,parts:[{no:1,stem:"系统中有多个生产者进程和多个消费者进程，共享一个能存放 1000 件产品的环形缓冲区（初始为空）。当缓冲区未满时，生产者进程可以放入其生产的一件产品，否则等待；当缓冲区未空时，消费者进程可以从缓冲区取走一件产品，否则等待。要求一个消费者进程从缓冲区连续取出 10 件产品后，其他消费者进程才可以取产品。请使用信号量 P，V.wait()，signal() 操作实现进程间的互斥与同步，要求写出完整的过程，并说明所用信号量的含义和初值。",answer:`这是典型的生产者和消费者问题，只对典型问题加了一个条件，只需在标准模型上新加一个信号量，即可完成指定要求。

设置四个变量 mutex1、mutex2、empty 和 full，mutex1，用于一个控制一个消费者进程一个周期(10次)内对于缓冲区的控制，初值为1，mutex2用于进程单次互斥的访问缓冲区，初值为1，empty代表缓冲区的空位数，初值为0，full代表缓冲区的产品数，初值为1000，具体进程的描述如下：

\`\`\`c
semaphore mutex1=1;
semaphore mutex2=1;
semaphore empty=n;
semaphore full  $= 0$
producer(){ while(1){ 生产一个产品; P(empty); //判断缓冲区是否有空位 P(mutex2); //互斥访问缓冲区 把产品放入缓冲区； V(mutex2); //互斥访问缓冲区 V(full); //产品的数量加1 }
}
consumer(){ while(1){ P(mutex1) //连续取10次 for(int  $\\mathrm{i} = 0$  ;i<=10;++i){ P(full); //判断缓冲区是否有产品 P(mutex2); //互斥访问缓冲区 从缓冲区取出一件产品; V(mutex2); //互斥访问缓冲区 V(empty); //腾出一个空位 消费这件产品; }
\`\`\`

\`\`\`txt
V(mutex1) } 1
\`\`\`

【评分说明】

①信号量的初值和含义都正确给2分。
②生产者之间的互斥操作正确给1分；生产者与消费者之间的同步操作正确给2分；消费者之间互斥操作正确给1分。
③控制消费者连续取产品数量正确给2分。
(4)仅给出经典生产者-消费者问题的信号量定义和伪代码描述最多给3分。
(5)若考生将题意理解成缓冲区至少有 10 件产品, 消费者才能开始取, 其他均正确, 得 6 分。
(6)部分完全正确, 酌情给分。`,score:null}]},{id:"2015-a41",type:"applied",year:2015,no:41,subject:"数据结构",paper:"408",stem:`用单链表保存  $\\mathfrak{m}$  个整数，结点的结构为：[data][link]，且  $|data| \\leqslant n$  （ $n$  为正整数）。现要求设计一个时间复杂度尽可能高效的算法，对于链表中 data 的绝对值相等的结点，仅保留第一次出现的结点而删除其余绝对值相等的结点。例如，若给定的单链表 head 如下：

![](https://408.foreverlink.love/images/b885eb8ac3332a0c04c9fa5532904e79.jpg)

则删除结点后的head为：

![](https://408.foreverlink.love/images/9d0ae324488b1da886eabda7008fb17b.jpg)

要求：`,explanation:"",totalScore:15,parts:[{no:1,stem:"给出算法的基本设计思想。",answer:`算法的基本设计思想
算法的核心思想是用空间换时间。使用辅助数组记录链表中已出现的数值，从而只需对链表进行一趟扫描。

因为  $|\\mathrm{data}| \\leqslant \\mathrm{n}$ ，故辅助数组 q 的大小为  $n + 1$ ，各元素的初值均为 0。依次扫描链表中的各结点，同时检查 q[|data|] 的值，如果为 0，则保留该结点，并令 q[|data|] = 1；否则，将该结点从链表中删除。`,score:null},{no:2,stem:"使用C或  $\\mathbf{C} + +$  语言，给出单链表结点的数据类型定义。",answer:"使用C语言描述的单链表结点的数据类型定义\n```txt\ntypedef struct node { int data; struct node \\*link; }NODE; typedef NODE \\*PNODE;\n```",score:null},{no:3,stem:"根据设计思想，采用C或  $\\mathrm{C + + }$  语言描述算法，关键之处给出注释。",answer:`算法实现
\`\`\`c
void func (PNODE h,int n)
{ PNODE p=h,r;
    int *q,m;
    q=(int *)malloc(sizeof(int)*(n+1)); //申请  $n + 1$  个位置的辅助空间
    for(int i=0;i<n+1;i++) //数组元素初值置0
        *(q+i)=0;
    while(p->link!=NULL)
{ m=p->link->data>0? p->link->data:-p->link->data;
    if(*(q+m)=0) //判断该结点的data是否已出现过
    { *(q+m)=1; //首次出现
        p=p->link; //保留
    }
    else //重复出现
    { r=p->link; //删除
        p->link=r->link
        free(r);
}
}
\`\`\`

【评分说明】若考生设计的算法满足题目的功能要求且正确，则酌情给分。`,score:null},{no:4,stem:"说明你所设计算法的时间复杂度和空间复杂度。",answer:`参考答案所给算法的时间复杂度为  $O(m)$ ，空间复杂度为  $O(n)$ 。
【评分说明】若考生所估计的时间复杂度和空间复杂度与考生实现的算法一致，可给分。`,score:null}]},{id:"2015-a42",type:"applied",year:2015,no:42,subject:"数据结构",paper:"408",stem:`已知含有5个顶点的图G如下图所示。

![](https://408.foreverlink.love/images/a565a5cd55c3703679abf57573ee2d3f.jpg)

请回答下列问题：`,explanation:"",totalScore:8,parts:[{no:1,stem:"写出图G的邻接矩阵A（行、列下标从0开始）。",answer:`图G的邻接矩阵A如下：
![](https://408.foreverlink.love/images/78c9ffef03a2df6231ed9e8213e3971b.jpg)`,score:null},{no:2,stem:"求  $\\mathbf{A}^2$  ，矩阵  $\\mathbf{A}^2$  中位于0行3列元素值的含义是什么？",answer:`$\\mathbf{A}^2$  如下：
![](https://408.foreverlink.love/images/48fbd76a7565d242ae0b3dc3ace0559b.jpg)

0行3列的元素值3表示从顶点0到顶点3之间长度为2的路径共有3条。`,score:null},{no:3,stem:"若已知具有  $n$  （ $n \\geq 2$ ）个顶点的图的邻接矩阵为  $B$ ，则  $B^m$  （ $2 \\leq m \\leq n$ ）中非零元素的含义是什么？",answer:"$\\mathbf{B}^{\\mathrm{m}}$ （ $2 \\leqslant \\mathrm{m} \\leqslant \\mathrm{n}$ ）中位于  $i$  行  $j$  列（ $0 \\leqslant i, j \\leqslant n-1$ ）的非零元素的含义是：图中从顶点  $i$  到顶点  $j$  长度为  $m$  的路径条数。",score:null}]},{id:"2015-a43",type:"applied",year:2015,no:43,subject:"计算机组成原理",paper:"408",stem:`某16位计算机的主存按字节编码，存取单位为16位；采用16位定长指令字格式；CPU采用单总线结构，主要部分如下图所示。图中R0～R3为通用寄存器；T为暂存器；SR为移位寄存器，可实现直送（mov）、左移一位（left）和右移一位（right）3种操作，控制信号为SRop，SR的输出由信号SRout控制；ALU可实现直送A（mova）、A加B（add）、A减B（sub）、A与B（and）、A或B（or）、非A（not）、A加1（inc）7种操作，控制信号为ALUop。

![](https://408.foreverlink.love/images/8316b0ebd5c6e1bba07b81c99d2f58a5.jpg)

请回答下列问题。`,explanation:"",totalScore:13,parts:[{no:1,stem:"图中哪些寄存器是程序员可见的？为何要设置暂存器T？",answer:`程序员可见寄存器为通用寄存器（ $\\mathrm{R0}\\sim \\mathrm{R3}$ ）和PC。因为采用了单总线结构，因此，若无暂存器T，则ALU的A、B端口会同时获得两个相同的数据，使数据通路不能正常工作。
【评分说明】回答通用寄存器（R0～R3），给分；回答PC，给分；部分正确，酌情给分。设置暂存器T的原因若回答用于暂时存放端口A的数据，则给分，其他答案，酌情给分。`,score:null},{no:2,stem:"控制信号ALUop和SRop的位数至少各是多少？",answer:"ALU共有7种操作，故其操作控制信号ALUop至少需要3位；移位寄存器有3种操作，其操作控制信号SRop至少需要2位。",score:null},{no:3,stem:"控制信号SRout所控制部件的名称或作用是什么？",answer:`信号SRout所控制的部件是一个三态门，用于控制移位器与总线之间数据通路的连接与断开。
【评分说明】只要回答出三态门或者控制连接/断开，即给分。`,score:null},{no:4,stem:"端点①～⑨中，哪些端点须连接到控制部件的输出端？",answer:`端口①、②、③、⑤、⑧须连接到控制部件输出端。
【评分说明】答案包含④、⑥、⑦、⑨中任意一个，不给分；答案不全酌情给分。`,score:null},{no:5,stem:"为完善单总线数据通路，需要在端点①～⑨中相应的端点之间添加必要的连线。写出连线的起点和终点，以正确表示数据的流动方向。",answer:`连线1，  $⑥ \\rightarrow ⑨$  ；连线2，  $⑦ \\rightarrow ④$
【评分说明】回答除上述连线以外的其他连线，酌情给分。`,score:null},{no:6,stem:"为什么二路选择器MUX的一个输入端是2？",answer:"因为每条指令的长度为16位，按字节编址，所以每条指令占用2个内存单元，顺序执行时，下条指令地址为  $(\\mathrm{PC}) + 2$  。MUX的一个输入端为2，可便于执行  $(\\mathrm{PC}) + 2$  操作。",score:null}]},{id:"2015-a44",type:"applied",year:2015,no:44,subject:"计算机组成原理",paper:"408",stem:`题43中描述的计算机，其部分指令执行过程的控制信号如下图所示。

![](https://408.foreverlink.love/images/73feb7f713ab9f0e76123dd9de342c71.jpg)
题图a 部分指令控制信号

该机指令格式如下图所示，支持寄存器直接和寄存器间接两种寻址方式，寻址方式位分别为0和1，通用寄存器  $\\mathrm{R0}\\sim \\mathrm{R3}$  的编号分别为0、1、2和3。

![](https://408.foreverlink.love/images/12dbf8ebb7239da15a5157661567a09c.jpg)
题图b 指令格式

请回答下列问题。`,explanation:"",totalScore:10,parts:[{no:1,stem:"该机的指令系统最多可定义多少条指令？",answer:"指令操作码有7位，因此最多可定义  $2^{7} = 128$  条指令。",score:null},{no:2,stem:`假定inc、shl和sub指令的操作码分别为01H、02H和03H，则以下指令对应的机器代码各是什么？
$①$  inc R1  $\\mathrm{R}1 + 1\\to \\mathrm{R}1$
$②$  shl R2,R1 ；  $(\\mathrm{R}1) <   <   1\\to \\mathrm{R}2$
$③$  sub R3,(R1),R2 ；  $(\\mathrm{(R1)) - (R2)\\to R3}$`,answer:`各条指令的机器代码分别如下：
① “inc R1”的机器码为：0000001 0 01 0 00 0 00，即  $0240\\mathrm{H}$ 。
② “sh1 R2，R1”的机器码为：0000010 0 10 0 01 0 00，即  $0488\\mathrm{H}$ 。
③ “sub R3, (R1), R2”的机器码为：0000011 0 11 1 01 0 10，即 06EAH。`,score:null},{no:3,stem:"假设寄存器X的输入和输出控制信号分别为Xin和Xout，其值为1表示有效，为0表示无效（例如，PCout=1表示PC内容送总线)；存储器控制信号为MEMop，用于控制存储器的读(read)和写(write)操作。写出题图a中标号①～⑧处的控制信号或控制信号的取值。",answer:`各标号处的控制信号或控制信号取值如下：
①0；②mov；③mova；④left；⑤read；⑥sub；⑦mov；⑧Srout。

【评分说明】答对两个给分。`,score:null},{no:4,stem:"指令“sub R1,R3,(R2)”和“inc R1”的执行阶段至少各需要多少个时钟周期？",answer:"指令“sub R1，R3，(R2)”的执行阶段至少包含4个时钟周期；指令“inc R1”的执行阶段至少包含2个时钟周期。",score:null}]},{id:"2015-a45",type:"applied",year:2015,no:45,subject:"操作系统",paper:"408",stem:`有A、B两人通过信箱进行辩论，每个人都从自己的信箱中取得对方的问题。将答案和向对方提出的新问题组成一个邮件放入对方的邮箱中。假设A的信箱最多放M个邮件，B的信箱最多放N个邮件。初始时A的信箱中有x个邮件  $(0 < x < M)$ ，B的信箱中有y个  $(0 < y < N)$ 。辩论者每取出一个邮件，邮件数减1。A和B两人的操作过程描述如下：

CoBegin

<table><tr><td>A{
while(TRUE){
从A的信箱中取出一个邮件;
回答问题并提出一个新问题;
将新邮件放入B的信箱;
}
}</td><td>B{
while(TRUE){
从B的信箱中取出一个邮件;
回答问题并提出一个新问题;
将新邮件放入A的信箱;
}
}</td></tr></table>

CoEnd

当信箱不为空时，辩论者才能从信箱中取邮件，否则等待。当信箱不满时，辩论者才能将新邮件放入信箱，否则等待。请添加必要的信号量和P、V（或wait、signal）操作，以实现上述过程的同步。要求写出完整过程，并说明信号量的含义和初值。`,explanation:"",totalScore:9,parts:[{no:1,stem:`有A、B两人通过信箱进行辩论，每个人都从自己的信箱中取得对方的问题。将答案和向对方提出的新问题组成一个邮件放入对方的邮箱中。假设A的信箱最多放M个邮件，B的信箱最多放N个邮件。初始时A的信箱中有x个邮件  $(0 < x < M)$ ，B的信箱中有y个  $(0 < y < N)$ 。辩论者每取出一个邮件，邮件数减1。A和B两人的操作过程描述如下：

CoBegin

<table><tr><td>A{
while(TRUE){
从A的信箱中取出一个邮件;
回答问题并提出一个新问题;
将新邮件放入B的信箱;
}
}</td><td>B{
while(TRUE){
从B的信箱中取出一个邮件;
回答问题并提出一个新问题;
将新邮件放入A的信箱;
}
}</td></tr></table>

CoEnd

当信箱不为空时，辩论者才能从信箱中取邮件，否则等待。当信箱不满时，辩论者才能将新邮件放入信箱，否则等待。请添加必要的信号量和P、V（或wait、signal）操作，以实现上述过程的同步。要求写出完整过程，并说明信号量的含义和初值。`,answer:`semaphore Full_A = x; //Full_A 表示 A 的信箱中的邮件数量

semaphore Empty_A = M-x; // Empty_A 表示 A 的信箱中还可存放的邮件数量

semaphore Full_B = y; //Full_B 表示 B 的信箱中的邮件数量

semaphore Empty_B = N-y; // Empty_B 表示 B 的信箱中还可存放的邮件数量

semaphore mutex_A = 1; // mutex_A 用于 A 的信箱互斥

semaphore mutex_B = 1; //mutex_B用于B的信箱互斥

Cobegin
A{ while(TRUE){ while(TRUE){ P(Full_A); P(mutex_A); 从A的信箱中取出一个邮件; 从B的信箱中取出一个邮件; V(mutex_A); V公积金 A); V公积金 A); 回答问题并提出一个新问题; P公积金 A); P公积金 A); 将新邮件放入B的信箱; V公积金 A); V公积金 A); } } }

【评分说明】

1）每对信号量的定义及初值正确，给分。
2）每个互斥信号量的P、V操作使用正确，各给分。
3）每个同步信号量的P、V操作使用正确，各给分。
4）其他答案酌情给分。`,score:9}]},{id:"2015-a46",type:"applied",year:2015,no:46,subject:"操作系统",paper:"408",stem:`某计算机系统按字节编址，采用二级页表的分页存储管理方式，虚拟地址格式如下所示：

<table><tr><td>10位</td><td>10位</td><td>12位</td></tr><tr><td>页目录号</td><td>页表索引</td><td>页内偏移量</td></tr></table>

请回答下列问题。`,explanation:"",totalScore:6,parts:[{no:1,stem:"页和页框的大小各为多少字节？进程的虚拟地址空间大小为多少页？",answer:"页和页框大小均为4KB。进程的虚拟地址空间大小为  $2^{32} / 2^{12} = 2^{20}$  页。",score:null},{no:2,stem:"假定页目录项和页表项均占 4 个字节, 则进程的页目录和页表共占多少页? 要求写出计算过程。",answer:"$(2^{10} * 4) / 2^{12}$ （页目录所占页数）+  $(2^{20} * 4) / 2^{12}$ （页表所占页数）=1025页。",score:null},{no:3,stem:"若某指令周期内访问的虚拟地址为01000000H和01112048H，则进行地址转换时共访问多少个二级页表？要求说明理由。",answer:`需要访问一个二级也表。因为虚拟地址01000000H和01112048H的最高10位的值都是4，访问的是同一个二级页表。
【评分说明】用其他方法计算，思路和结果正确同样给分。`,score:null}]},{id:"2015-a47",type:"applied",year:2015,no:47,subject:"计算机网络",paper:"408",stem:`某网络拓扑如图所示，其中路由器内网接口、DHCP服务器、WWW服务器与主机1均采用静态IP地址配置，相关地址信息见图中标注；主机2～主机N通过DHCP服务器动态获取IP地址等配置信息。

![](https://408.foreverlink.love/images/26a14292d9bf3e84b0ee98db1721a958.jpg)

请回答下列问题。`,explanation:"",totalScore:9,parts:[{no:1,stem:"DHCP服务器可为主机  $2\\sim$  主机N动态分配IP地址的最大范围是什么？主机2使用DHCP协议获取IP地址的过程中，发送的封装DHCPDiscover",answer:"DHCP 服务器可为主机  $2 \\sim$  主机 N 动态分配 IP 地址的最大范围是: 111.123.15.5 ~ 111.123.15.254; 主机 2 发送的封装 DHCP Discover 报文的 IP 分组的源 IP 地址和目的 IP 地址分别是 0.0.0.0 和 255.255.255.255。",score:null},{no:2,stem:"若主机2的ARP表为空，则该主机访问Internet时，发出的第一个以太网帧的目的MAC地址是什么？封装主机2发往Internet的IP分组的以太网帧的目的MAC地址是什么？",answer:"主机2发出的第一个以太网帧的目的MAC地址是ff-ff-ff-ff-ff；封装主机2发往Internet的IP分组的以太网帧的目的MAC地址是00-a1-a1-a1-a1-a1。",score:null},{no:3,stem:"若主机1的子网掩码和默认网关分别配置为255.255.255.0和111.123.15.2，则该主机是否能访问WWW服务器？是否能访问Internet？请说明理由。",answer:"主机1能访问WWW服务器，但不能访问Internet。由于主机1的子网掩码配置正确而默认网关IP地址被错误地配置为111.123.15.2（正确IP地址是111.123.15.1），所以主机1可以访问在同一个子网内的WWW服务器，但当主机1访问Internet时，主机1发出的IP分组会被路由到错误的默认网关(111.123.15.2)，从而无法到达目的主机。",score:null}]},{id:"2016-a41",type:"applied",year:2016,no:41,subject:"数据结构",paper:"408",stem:"假设题33～41图中的H3访问Web服务器S时，S为新建的TCP连接分配了20KB(K=1024)的接收缓存，最大段长MSS=1 KB，平均往返时间RTT=200 ms。H3建立连接时的初始序号为100，且持续以MSS大小的段向S发送数据，拥塞窗口初始阈值为32 KB；S对收到的每个段进行确认，并通告新的接收窗口。假定TCP连接建立完成后，S端的TCP接收缓存仅有数据存入而无数据取出。请回答下列问题。",explanation:"",totalScore:9,parts:[{no:1,stem:`在TCP连接建立过程中，H3收到的S发送过来的第二次握手TCP段的SYN和ACK标志位的值分别是多少？确认序号是多少？
A. 0 B. 1 C. 2 D. 3`,answer:"第二次握手TCP段的SYN=1，(1分)ACK=1；(1分)确认序号是101。(1分)",score:null},{no:2,stem:"H3收到的第8个确认段所通告的接收窗口是多少?此时H3的拥塞窗口变为多少?H3的发送窗口变为多少？",answer:"H3收到的第8个确认段所通告的接收窗口是12KB；（1分）此时H3的拥塞窗口变为9KB；(1分)H3的发送窗口变为9KB。（1分）",score:null},{no:3,stem:"当H3的发送窗口等于0时，下一个待发送的数据段序号是多少?H3从发送第1个数据段到发送窗口等于0时刻为止，平均数据传输速率是多少(忽略段的传输延时)?",answer:"当H3的发送窗口等于0时，下一个待发送段的序号是  $20\\mathrm{K} + 101 = 20\\times 1024 + 101 = 20581$ ；(1分)H3从发送第1个段到发送窗口等于0时刻为止，平均数据传输速率是  $20\\mathrm{KB / (5\\times 200ms)} = 20$  KB/s=20.48kbps。(1分)",score:null},{no:4,stem:"若H3与S之间通信已经结束，在t时刻H3请求断开该连接，则从t时刻起，S释放该连接的最短时间是多少？",answer:"从t时刻起，S释放该连接的最短时间是：  $1.5\\times 200\\mathrm{ms} = 300\\mathrm{ms}$  。(1分)",score:null}]},{id:"2016-a42",type:"applied",year:2016,no:42,subject:"数据结构",paper:"408",stem:"如果一棵非空k(k≥2)叉树T中每个非叶结点都有k个孩子，则称T为正则后k树。请回答下列问题并给出推导过程。",explanation:"",totalScore:8,parts:[{no:1,stem:"若T有m个非叶结点，则T中的叶结点有多少个？",answer:"根据定义，正则k叉树中仅含有两类结点：叶结点(个数记为n0)和度为k的分支结点(个数记为nk)。树T中的结点总数  $n = n_0 + n_k = n_0 + m$  。树中所含的边数  $e = n - 1$ ，这些边均为m个度为k的结点发出的，即  $e = m \\times k$  。整理得：  $n_0 + m = m \\times k + 1$ ，故  $n_0 = (k - 1) \\times m + 1$  。(3分)",score:null},{no:2,stem:"若T的高度为h（单结点的树h=1），则T的结点数最多为多少个？最少为多少个？",answer:`高度为h的正则k叉树T中，含最多结点的树形为：除第h层外，第1到第h-1层的结点都是度为k的分支结点，而第h层均为叶结点，即树是“满”树。此时第j(1≤j≤h)层结点数为k¹，结点总数M为：
$$
M _ {1} = \\sum_ {j = 1} ^ {h} k ^ {j - 1} = \\frac {k ^ {h} - 1}{k - 1} \\tag {3分}
$$

含最少结点的正则k叉树的树形为：第1层只有根结点，第2到第h-1层仅含1个分支结点和k-1个叶结点，第h层有k个叶结点。即除根外第2到第h层中每层的结点数均为k，故T中所含结点总数M2为：

$$
\\mathrm {M} _ {2} = 1 + (\\mathrm {h} - 1) \\times \\mathrm {k} \\quad (2 \\text {分})
$$

【评分说明】

①参考答案仅给出一种推导过程，若考生采用其他推导方法且正确，同样给分。
②若考生仅给出结果，但没有推导过程，则(1)、(2)的最高得分分别是2分和3分。若推导过程或答案不完全正确，酌情给分。`,score:null}]},{id:"2016-a43",type:"applied",year:2016,no:43,subject:"计算机组成原理",paper:"408",stem:"已知由  $n(n \\geq 2)$  个正整数构成的集合  $A = \\{a_{k}\\} 0 \\leq k < n$ , 将其划分为两个不相交的子集  $A_{1}$  和  $A_{2}$ , 元素个数分别是  $n_{1}$  和  $n_{2}$ ,  $A_{1}$  和  $A_{2}$  中元素之和分别为  $S_{1}$  和  $S_{2}$  。设计一个尽可能高效的划分算法, 满足  $|n_{1} - n_{2}|$  最小且  $|S_{1} - S_{2}|$  最大。要求:",explanation:"",totalScore:15,parts:[{no:1,stem:"给出算法的基本设计思想。",answer:`算法的基本设计思想(4分）
由题意知，将最小的  $\\lfloor n / 2\\rfloor$  个元素放在A中，其余的元素放在A中，分组结果即可满足题目要求。仿照快速排序的思想，基于枢轴将n个整数划分为两个子集。根据划分后枢轴所处的位置i分别处理：

①若  $i = \\lfloor n / 2\\rfloor$  ，则分组完成，算法结束；
②若  $\\mathrm{i} < \\left\\lfloor  {n/2}\\right\\rfloor$  ,则枢轴及之前的所有元素均属于  \${\\mathrm{A}}_{1}$  ,继续对  $\\mathrm{i}$  之后的元素进行划分；
(3)若  $i > \\lfloor n / 2\\rfloor$  ，则枢轴及之后的所有元素均属于  $\\mathbf{A}_2$  ，继续对i之前的元素进行划分；

基于该设计思想实现的算法，毋须对全部元素进行全排序，其平均时间复杂度是O(n)，空间复杂度是O(1)。`,score:null},{no:2,stem:"根据设计思想，采用C或C++语言描述算法，关键之处给出注释。",answer:`算法实现(9分）
\`\`\`javascript
intsetPartition(inta[ ],intn)
{ intpivotkey，low  $= 0$  ，low  $0 = 0$  ，high=n-1，high0=n-1，flag  $= 1$  ，  $\\mathrm{k} = \\mathrm{n} / 2$  ，i; ints1  $= 0$  ，s2  $= 0$  while（flag） {pivotkey=a[low]； //选择枢轴 while(low<high) //基于枢轴对数据进行划分 {while(low<high&&a[high]  $\\rightharpoonup$  pivotkey)-- high; if(low!  $\\equiv$  high)a[low]=a[high]; while(low<high&&a[low]  $\\rightharpoondown$  pivotkey) ++low: if(low！  $\\equiv$  high)a[high]=a[low]; }//end of while(low<high) a[low]=pivotkey; if(low==k-1) //如果枢轴是第n/2小元素，划分成功 flag  $= 0$  ： else //否则继续划分 {if(low<k-1) { low0  $= + + 1$  low; high  $\\equiv$  high0; } else {high0=-mhigh; low  $\\equiv$  low0; } } } for(i=0；i<k；i++）s1+=a[i]; for(i=k；i<n；i++）s2+=a[i]; return s2-s1;
\`\`\`

【(1)(2)的评分说明】

①本题目只需将最大的一半元素与最小的一半元素分组，不需要对所有元素进行全部排序。参考答案基于快速排序思想，采用非递归的方式实现。若考生设计的算法满足题目的功能要求且正确，则(1)、(2)根据所实现算法的平均时间复杂度给分，细则见下表。

<table><tr><td>时间复杂度</td><td>分数</td><td>说明</td></tr><tr><td>O(n)</td><td>13</td><td>采用类似快速排序思想,没有对元素进行全排序。</td></tr><tr><td>O(nlog2n)</td><td>11</td><td></td></tr><tr><td>\\( \\mathrm{O}\\left( {\\mathrm{n}}^{2}\\right) \\)</td><td>9</td><td></td></tr><tr><td>其他</td><td>7</td><td>时间复杂度高于 \\( \\mathrm{O}\\left( {\\mathrm{n}}^{2}\\right) \\) 的算法。</td></tr></table>

②若在算法的基本设计思想描述中因文字表达没有清晰反映出算法思路，但在算法实现中能够表达出算法思想且正确的，可参照①的标准给分。

③若算法的基本设计思想描述或算法实现中部分正确，可参照①中各种情况的相应给分标准酌情给分。

④参考答案中只给出了使用C语言的版本，使用C++语言的答案视同使用C语言。`,score:null},{no:3,stem:"说明你所设计算法的平均时间复杂度和空间复杂度。",answer:`算法的平均时间复杂度和空间复杂度（2分）
本参考答案给出的算法平均时间复杂度是O(n)，空间复杂度是O(1)。

【评分说明】若考生所估计的平均时间复杂度和空间复杂度与考生所实现的算法一致，可各给1分。`,score:null}]},{id:"2016-a44",type:"applied",year:2016,no:44,subject:"计算机组成原理",paper:"408",stem:"假定CPU主频为50MHz，CPI为4。设备D采用异步串行通信方式向主机传送7位ASCII字符，通信规程中有1位奇校验位和1位停止位，从D接收启动命令到字符送入I/O端口需要  $0.5\\mathrm{ms}$  。请回答下列问题，要求说明理由。",explanation:"",totalScore:9,parts:[{no:1,stem:"每传送一个字符，在异步串行通信线上共需传输多少位？在设备D持续工作过程中，每秒钟最多可向I/O端口送入多少个字符？",answer:`每传送一个ASCII字符，需要传输的位数有1位起始位、7位数据位(ASCII字符占7位)、1位奇校验位和1位停止位，故总位数为  $1 + 7 + 1 + 1 = 10$  。(2分)
I/O端口每秒钟最多可接收1000/0.5=2000个字符。(1分)

【评分说明】对于第一问，若考生回答总位数为9，则给1分。`,score:null},{no:2,stem:`设备D采用中断方式进行输入/输出，示意图如下：
![](https://408.foreverlink.love/images/9b7185183a6dc70cc96597047dd789fb.jpg)

I/O端口每收到一个字符申请一次中断，中断响应需10个时钟周期，中断服务程序共有20条指令，其中第15条指令启动D工作。若CPU需从D读取1000个字符，则完成这一任务所需时间大约是多少个时钟周期?CPU用于完成这一任务的时间大约是多少个时钟周期?在中断响应阶段CPU进行了哪些操作？`,answer:`一个字符传送时间包括：设备D将字符送I/0端口的时间、中断响应时间和中断服务程序前15条指令的执行时间。时钟周期为  $1 / (50\\mathrm{MHz}) = 20$  ns，设备D将字符送I/0端口的时间为0.5 ms/20 ns=2.5×10^4个时钟周期。一个字符的传送时间大约为2.5×10^4+10+15×4=25070个时钟周期。完成1000个字符传送所需时间大约为1000×25070=25070000个时钟周期。(3分)
CPU用于该任务的时间大约为  $1000 \\times (10 + 20 \\times 4) = 9 \\times 10^{4}$  个时钟周期。(1分)

在中断响应阶段, CPU主要进行以下操作: 关中断、保护断点和程序状态、识别中断源。(2分)

【评分说明】

①对于第一问，若答案是25070020，则同样给分；若答案是2500000或25000020，则给2分。如果没有给出分步计算步骤，但算式和结果正确，同样给分。
②对于第三问，只要回答关中断和保护断点，就给2分，其他答案酌情给分。`,score:null}]},{id:"2016-a45",type:"applied",year:2016,no:45,subject:"操作系统",paper:"408",stem:`某计算机采用页式虚拟存储管理方式，按字节编址，虚拟地址为32位，物理地址为24位，页大小为8KB；TLB采用全相联映射；Cache数据区大小为64KB，按2路组相联方式组织，主存块大小为64B。存储访问过程的示意图如下。

![](https://408.foreverlink.love/images/cedaabad1b7c5a2af6d7180a3ddafc78.jpg)

请回答下列问题。`,explanation:"",totalScore:14,parts:[{no:1,stem:"图中字段A～G的位数各是多少?TLB标记字段B中存放的是什么信息？",answer:`页大小为8KB，页内偏移地址为13位，故A=B=32-13=19；D=13；C=24-13=11；主存块大小为64B，故G=6。2路组相联，每组数据区容量有64B×2=128B，共有64KB/128B=512组，故F=9；E=24-G-F=24-6-9=9。
因而A=19，B=19，C=11，D=13，E=9，F=9，G=6。（各1分，共7分）

TLB中标记字段B的内容是虚页号，表示该TLB项对应哪个虚页的页表项。(1分)`,score:null},{no:2,stem:"将块号为4099的主存块装入到Cache中时，所映射的Cache组号是多少?对应的H字段内容是什么？",answer:"块号4099=0000010000000000011B，因此，所映射的Cache组号为00000011B=3，（1分）对应的H字段内容为00001000B。(1分)",score:null},{no:3,stem:"Cache缺失处理的时间开销大还是缺页处理的时间开销大？为什么？",answer:`Cache 缺失带来的开销小，而处理缺页的开销大。(1分)因为缺页处理需要访问磁盘，而 Cache 缺失只要访问主存。(1分)
【评分说明】对于(3)中第2问，若考生回答因为缺页需要软件实现而Cache缺失用硬件实现，则同样给分。`,score:null},{no:4,stem:"为什么Cache可以采用直写(Write Through)策略，而修改页面内容时总是采用回写(Write Back)策略？",answer:"因为采用直写策略时需要同时写快速存储器和慢速存储器，而写磁盘比写主存慢得多，所以，在Cache-主存层次，Cache可以采用直写策略，而在主存-外存(磁盘)层次，修改页面内容时总是采用回写策略。(2分)",score:null}]},{id:"2016-a46",type:"applied",year:2016,no:46,subject:"操作系统",paper:"408",stem:"某进程调度程序采用基于优先数(priority)的调度策略，即选择优先数最小的进程运行，进程创建时由用户指定一个nice作为静态优先数。为了动态调整优先数，引入运行时间cpuTime和等待时间waitTime，初值均为0。进程处于执行态时，cpuTime定时加1，且waitTime置0；进程处于就绪态时，cpuTime置0，waitTime定时加1。请回答下列问题。",explanation:"",totalScore:6,parts:[{no:1,stem:"若调度程序只将nice的值作为进程的优先数，即priority=nice，则可能会出现饥饿现象，为什么？",answer:"由于采用了静态优先数，当就绪队列中总有优先数较小的进程时，优先数较大的进程一直没有机会运行，因而会出现饥饿现象。(2分)",score:null},{no:2,stem:"使用nice、cpuTime和waitTime设计一种动态优先数计算方法，以避免产生饥饿现象，并说明waitTime的作用。",answer:`优先数priority的计算公式为：
priority=nice+k1×cpuTime-k2×waitTime，其中k1>0，k2>0，用来分别调整cpuTime和waitTime在priority中所占的比例。(3分)waitTime可使长时间等待的进程优先数减小，从而避免出现饥饿现象。(1分)

【评分说明】

① 公式中包含nice给1分，利用cpuTime增大优先数给1分，利用waitTime减少优先数给1分；部分正确，酌情给分。
②若考生给出包含nice、cpuTime和waitTime的其他合理的优先数计算方法，同样给分。`,score:null}]},{id:"2016-a47",type:"applied",year:2016,no:47,subject:"计算机网络",paper:"408",stem:"某磁盘文件系统使用链接分配方式组织文件，簇大小为4KB。目录文件的每个目录项包括文件名和文件的第一个簇号，其他簇号存放在文件分配表FAT中。",explanation:"",totalScore:9,parts:[{no:1,stem:`假定目录树如下图所示，各文件占用的簇号及顺序如下表所示，其中dir、dir1是目录，file1、file2是用户文件。请给出所有目录文件的内容。
<table><tr><td>文件名</td><td>簇号</td></tr><tr><td>dir</td><td>1</td></tr><tr><td>dir1</td><td>48</td></tr><tr><td>file1</td><td>100、106、108</td></tr><tr><td>file2</td><td>200、201、202</td></tr></table>`,answer:`两个目录文件dir和dir1的内容如下表所示。(3分)
dir目录文件

文件名 簇号

<table><tr><td>dir1</td><td>48</td></tr></table>

dir1目录文件

文件名 簇号

<table><tr><td>file1</td><td>100</td></tr><tr><td>file2</td><td>200</td></tr></table>

【评分说明】每个目录项的内容正确给1分，共3分。`,score:null},{no:2,stem:"若FAT的每个表项仅存放簇号，占2个字节，则FAT的最大长度为多少字节？该文件系统支持的文件长度最大是多少？",answer:`FAT的最大长度为  $2^{16} \\times 2$  B=128 KB。(1分)文件的最大长度是  $2^{16} \\times 4$  KB=256 MB。(1分)
【评分说明】若考生考虑到文件结束标志、坏块标志等，且答案正确，同样给分。`,score:null},{no:3,stem:"系统通过目录文件和FAT实现对文件的按名存取，说明file1的106、108两个簇号分别存放在FAT的哪个表项中。",answer:"file1的簇号106存放在FAT的100号表项中，（1分）簇号108存放在FAT的106号表项中。（1分）",score:null},{no:4,stem:"假设仅FAT和dir目录文件已读入内存，若需将文件dir/dir1/file1的第5000个字节读入内存，则要访问哪几个簇？",answer:"需要访问目录文件dir1所在的48号簇，（1分）及文件file1的106号簇。（1分）",score:null}]},{id:"2017-a41",type:"applied",year:2017,no:41,subject:"数据结构",paper:"408",stem:`请设计一个算法, 将给定的表达式树 (二叉树) 转换为等价的中缀表达式 (通过括号反映操作符的计算次序) 并输出。例如, 当下列两棵表达式树作为算法的输入时:

![](https://408.foreverlink.love/images/f6a5a4f55c076bf53dbf1959906944ae.jpg)

输出的等价中缀表达式分别为  $(a + b)^{*}(c^{*}(-d))$  和  $(a^{\\ast}b) + (-(c - d))$

二叉树结点定义如下：

\`\`\`txt
typedef struct node{ char data[10]; //存储操作数或操作符 struct node \\*left，\\*right;
}BTree;
\`\`\`

要求：`,explanation:"",totalScore:15,parts:[{no:1,stem:"给出算法的基本设计思想。",answer:`算法的基本设计思想
表达式树的中序序列加上必要的括号即为等价的中缀表达式。可以基于二叉树的中序遍历
策略得到所需的表达式。(3分)
  表达式树中分支结点所对应的子表达式的计算次序，由该分支结点所处的位置决定。为得
到正确的中缀表达式，需要在生成遍历序列的同时，在适当位置增加必要的括号。显然，表达
式的最外层(对应根结点)及操作数(对应叶结点)不需要添加括号。(2分)`,score:null},{no:2,stem:"根据设计思想，采用C或C++语言描述算法，关键之处给出注释。",answer:`算法实现(10分)
void BtreeToE(BTree  *  root)
  {
      BtreeToExp(root，1)；    //根的高度为1
  void BtreeToExp(BTree * root, int deep)
  {
      if( root = = NULL) return;
  else if(root->left = = NULL && root->right = = NULL)
      //若为叶结点
      printf(“％s”，root->data)；    //输出操作数
  else
  {
      if(deep>1)  printf(“(”) ；//若有子表达式则加1层括号
      BtreeToExp(root->left，deep+1)；
      printf(“％s”，root->data)；  //输出操作符
      BtreeToExp(root->right，deep+1)；
      if(deep>1)  printf(“)”) ；//若有子表达式则加1层括号
    }
  }
  【评分说明】
  ①若考生设计的算法满足题目的功能要求， 则(1)、(2)根据所实现算法的策略及输出结果给
分，细则见下表。
分数 备注
15 采用中序遍历算法且正确，括号嵌套正确，层数适当。
14 采用中序遍历算法且正确， 括号嵌套正确， 但括号嵌套层数过多。 例如， 表达式
最外层加上括号，或操作数加括号如(a)。
11 采用中序遍历算法，但括号嵌套层数不完全正确。例如，左右括号数量不匹配。
9 采用中序遍历算法，但没有考虑括号。
≤7 其他
  ②若考生采用其他方法得到正确结果，可参照①的评分标准给分。
  ③如果程序中使用了求结点深度等辅助函数，但没有给出相应的实现过程，只要考生进行
了必要的说明，可不扣分。
  ④若在算法的基本设计思想描述中因文字表达没有清晰反映出算法思路，但在算法实现中
全国各院校计算机/软件专业考研真题 免费分享 https://github.com/Noob-Dream/cskaoyan
获取 考研经验/复试资料/考研资讯 关注微信公众号 N诺考研

能够表达出算法思想且正确的，可参照①的标准给分。
  ⑤若算法的基本设计思想描述或算法实现中部分正确，可参照①中各种情况的相应给分标
准酌情给分。
  ⑥参考答案中只给出了使用C语言的版本，使用C++语言的答案参照以上评分标准。`,score:null}]},{id:"2017-a42",type:"applied",year:2017,no:42,subject:"数据结构",paper:"408",stem:"使用Prim(普里姆）算法求带权连通图的最小（代价）生成树(MST)。请回答下列问题。",explanation:"",totalScore:8,parts:[{no:1,stem:"对下列图G，从顶点A开始求G的MST，依次给出按算法选出的边。",answer:`依次选出的边为：
(A，D)，(D，E)，(C，E)，(B，C)(4分)
  【评分说明】每正确选对一条边且次序正确，给1分。若考生选择的边正确，但次序不完全
正确，酌情给分。`,score:null},{no:2,stem:"图G的MST是唯一的吗？",answer:"图G的MST是唯一的。(2分)",score:null},{no:3,stem:"对任意的带权连通图，满足什么条件时，其MST是唯一的？\n![](https://408.foreverlink.love/images/34a68cda2d987ca8fd6e2e67333475e2.jpg)\n\n```txt\n[ f(n) = \\sum_{i=0}^{n} 2^i = 2^{n+1} - 1 = \\overbrace{11 \\cdots 1}^{n+1\\text{位}} \\mathrm{B} ]\n```",answer:`当带权连通图的任意一个环中所包含的边的权值均不相同时，其MST是唯一的。(2分)
【评分说明】
  ①若考生答案中给出的是其他充分条件，例如“带权连通图的所有边的权值均不相同”，同
样给分。
  ②若考生给出的充分条件对图的顶点数和边数做了某些限制，例如，限制了图中顶点的个
数(顶点个数少于3个)、限制了图的形状(图中没有环)等，则最高给1分。
  ③答案部分正确，酌情给分。`,score:null}]},{id:"2017-a43",type:"applied",year:2017,no:43,subject:"计算机组成原理",paper:"408",stem:"已知 ，计算f(n)的C语言函数f1如下：\n\n```txt\nint f1(unsigned n){ int sum  $= 1$  ，power  $= 1$  · for(unsigned  $\\mathrm{i} = 0;\\mathrm{i} <   = \\mathrm{n} - 1;\\mathrm{i} + + )$  { power  $\\text{一} = 2$  sum  $+ =$  power; } return sum;\n```\n\n将f1中的int都改为float，可得到计算f(n)的另一个函数f2。假设unsigned和int型数据都占32位，float采用IEEE754单精度标准。请回答下列问题。",explanation:"",totalScore:13,parts:[{no:1,stem:"当  $n = 0$  时，f1会出现死循环，为什么？若将f1中的变量i和n都定义为int型，则f1是否还会出现死循环？为什么？",answer:`由于i和n是unsigned型， 故“i<=n-1”是无符号数比较，n=0时，n-1的机器数为全1， 值是232-1，
为unsigned型可表示的最大数，条件“i<=n-1”永真，因此出现死循环。(2分)
  若i和n改为int类型，则不会出现死循环。(1分)
  因为“i<=n-1”是带符号整数比较，n=0时，n-1的值是-1，当i=0时条件“i<=n-1”不成立，此时
退出for循环。(1分)`,score:null},{no:2,stem:"f1(23) 和 f2(23) 的返回值是否相等? 机器数各是什么 (用十六进制表示)?",answer:`f1(23)与f2(23)的返回值相等。(1分)
f1(23)的机器数是OOFF FFFFH，(1分)
  f2(23)的机器数是4B7F FFFFH。(1分)`,score:null},{no:3,stem:"f1(24)和f2(24)的返回值分别为33554431和33554432.0，为什么不相等？",answer:`当n=24时，f(24)=1 1111 1111 1111 1111 1111 1111 B，而float型数只有24位有效位， 舍入
后数值增大，所以f2(24)比f1(24)大1。(1分)
  【评分说明】只要说明f2(24)需舍入处理即可给分。`,score:null},{no:4,stem:"$f(31) = 232 - 1$ , 而  $f(31)$  的返回值却为-1, 为什么? 若使  $f(1(n)$  的返回值与  $f(n)$  相等, 则最大的  $n$  是多少?",answer:`显然f(31)已超出了int型数据的表示范围，用f1(31)实现时得到的机器数为32个1，作为int
型数解释时其值为-1，即f1(31)的返回值为-1。(1分)
  因为int型最大可表示数是0后面加31个1，故使f1(n)的返回值与f(n)相等的最大n值是30。(1
分)
  【评分说明】对于第二问，只要给出n=30即可给分。`,score:null},{no:5,stem:"f2(127)的机器数为 7F800000H，对应的值是什么？若使 f2(n) 的结果不溢出，则最大的 n 是多少？若使 f2(n)的结果精确（无舍入），则最大的 n 是多少？",answer:`IEEE 754标准用“阶码全1、 尾数全0”表示无穷大。f2返回值为float型， 机器数7F80 0000H
对应的值是+∞。(1分)
  当n=126时，f(126)=2217-1=1.1…1 ×2126， 对应阶码为127+126=253， 尾数部分舍入后阶码加1，
最终阶码为254，是IEEE754单精度格式表示的最大阶码。故使f2结果不溢出的最大n值为126。
(1分)
  当n=23时，f(23)为24位1，float型数有24位有效位，所以不需舍入，结果精确。故使f2获得
精确结果的最大n值为23。  (1分)
全国各院校计算机/软件专业考研真题 免费分享 https://github.com/Noob-Dream/cskaoyan
获取 考研经验/复试资料/考研资讯 关注微信公众号 N诺考研

  【评分说明】对于第二问，只要给出n=23，即可给分。对于第三问，只要给出n=126，即可
给分。`,score:null}]},{id:"2017-a44",type:"applied",year:2017,no:44,subject:"计算机组成原理",paper:"408",stem:`在按字节编址的计算机M上，题43中f1的部分源程序(阴影部分）与对应的机器级代码（包括指令的虚拟地址）如下：

![](https://408.foreverlink.love/images/96ed0cf622b850fd01f2da1b77341cd9.jpg)

其中，机器级代码行包括行号、虚拟地址、机器指令和汇编指令。请回答下列问题。`,explanation:"",totalScore:10,parts:[{no:1,stem:"计算机M是RISC还是CISC？为什么？",answer:`M为CISC。(1分)
M的指令长短不一，不符合RISC指令系统特点。(1分)`,score:null},{no:2,stem:"fl的机器指令代码共占多少字节？要求给出计算过程。",answer:`f1的机器代码占96 B。(1分)
因为f1的第一条指令“push ebp”所在的虚拟地址为00401020H，最后一条指令“ret”所在的虚
拟地址为0040 107FH，所以，f1的机器指令代码长度为0040 107FH-0040 1020H+1=60H=96个字
节。(1分)`,score:null},{no:3,stem:"第20条指令cmp通过i减n-1实现对i和n-1的比较。执行f1(0)过程中当  $i = 0$  时，cmp指令执行后，进/借位标志CF的内容是什么？要求给出计算过程。",answer:`CF=1。(1分)
cmp指令实现i与n-1的比较功能，进行的是减法运算。在执行f1(0)过程中，n=0，当i=0时，
i=0000 0000H，并且n-1=FFFF FFFFH。因此，当执行第20条指令时，在补码加/减运算器中执行
“0减FFFF FFFFH”的操作，即0000 0000H+00000000H+1=0000 0001H，此时，进位输出C=0，减
法运算时的借位标志CF=C
 1=1。(2分)`,score:null},{no:4,stem:"第23条指令shl通过左移操作实现了power *2运算，在f2中能否也用shl指令实现power *2？为什么？",answer:`f2中不能用sh1指令实现power*2。(1分)
因为sh1指令用来将一个整数的所有有效数位作为一个整体左移； 而f2中的变量power是float
型，其机器数中不包含最高有效数位，但包含了阶码部分，将其作为一个整体左移时并不能实
现“乘2”的功能，因而f2中不能用sh1指令实现power*2。(2分)`,score:null}]},{id:"2017-a45",type:"applied",year:2017,no:45,subject:"操作系统",paper:"408",stem:`假定题 44 给出的计算机 M 采用二级分页虚拟存储管理方式, 虚拟地址格式如下:

<table><tr><td>页目录号（10位）</td><td>页表索引（10位）</td><td>页内偏移量（12位）</td></tr></table>

请针对题43的函数f1和题44中的机器指令代码，回答下列问题。`,explanation:"",totalScore:7,parts:[{no:1,stem:"函数f1的机器指令代码占多少页？",answer:`函数f1的代码段中所有指令的虚拟地址的高20位相同，因此f1的机器指令代码在同一页
中，仅占用1页。(1分)`,score:null},{no:2,stem:"取第1条指令（pushebp)时，若在进行地址变换的过程中需要访问内存中的页目录和页表，则会分别访问它们各自的第几个表项（编号从0开始）？",answer:`push ebp指令的虚拟地址的最高10位(页目录号)为00 00000001， 中间10位(页表索引)为00
0000 0001，所以，取该指令时访问了页目录的第1个表项，(1分)在对应的页表中访问了第1个表
项。(1分)`,score:null},{no:3,stem:"M的I/O采用中断控制方式。若进程P在调用f1之前通过scanf()获取n的值，则在执行scanf()的过程中，进程P的状态会如何变化？CPU是否会进入内核态？",answer:`在执行scanf( )的过程中， 进程P因等待输入而从执行态变为阻塞态。(1分)输入结束时，P
被中断处理程序唤醒，变为就绪态。(1分)P被调度程序调度，变为运行态。(1分)CPU状态会从
用户态变为内核态。(1分)`,score:null}]},{id:"2017-a46",type:"applied",year:2017,no:46,subject:"操作系统",paper:"408",stem:`某进程中有3个并发执行的线程thread1、thread2和thread3，其伪代码如下所示。

<table><tr><td>//复数的结构类型定义
typedef struct
{
    float a;
    float b;
} cnum;
cnum x, y, z; //全局变量
//计算两个复数之和
cnum add(cnum p, cnum q)
{
    cnum s;
    s.a = p.a + q.a;
    s.b = p.b + q.b;
    return s;</td><td>thread1
{
    cnum w;
    w = add(x, y);
    ......
    thread2
{
    cnum w;
    w = add(y, z);
    ......
}</td><td>thread3
{
    cnum w;
    w.a = 1;
    w.b = 1;
    z = add(z, w);
    y = add(y, w);
    ......
}</td></tr></table>

请添加必要的信号量和 P、V(或 wait()、signal())) 操作，要求确保线程互斥访问临界资源，并且最大程度地并发执行。`,explanation:"",totalScore:8,parts:[{no:1,stem:`某进程中有3个并发执行的线程thread1、thread2和thread3，其伪代码如下所示。

<table><tr><td>//复数的结构类型定义
typedef struct
{
    float a;
    float b;
} cnum;
cnum x, y, z; //全局变量
//计算两个复数之和
cnum add(cnum p, cnum q)
{
    cnum s;
    s.a = p.a + q.a;
    s.b = p.b + q.b;
    return s;</td><td>thread1
{
    cnum w;
    w = add(x, y);
    ......
    thread2
{
    cnum w;
    w = add(y, z);
    ......
}</td><td>thread3
{
    cnum w;
    w.a = 1;
    w.b = 1;
    z = add(z, w);
    y = add(y, w);
    ......
}</td></tr></table>

请添加必要的信号量和 P、V(或 wait()、signal())) 操作，要求确保线程互斥访问临界资源，并且最大程度地并发执行。`,answer:`semaphore mutex_y1=1；//mutex_y1用于thread1与thread3对变量y的互斥访问。(1分)
  semaphore mutex_y2=1；//mutex_y2用于thread2与thread3对变量y的互斥访问。(1分)
  semaphore mutex_z=1； //mutex_z用于变量z的互斥访问。(1分)互斥代码如下：(5分)
thread1
{
  cnum w；
  wait(mutex_y1)；
  w=add(x，y)；
  signal(mutex_y1)；
  ……
}
thread2
{
  cnum w：
  wait(mutex_y2)：
  wait(mutex_z)；
  w=add(y，z)；
  signal(mutex_z)；
  signal(mutex_y2)；
  ……
}
thread3
{
  cnum w；
  w.a=1；
  w.b=1；
  wait(mutex_z)；
  z=add(z，w)；
  signal(mutex_z)；
  wait(mutex_y1)；
  wait(mutex_y2)；
全国各院校计算机/软件专业考研真题 免费分享 https://github.com/Noob-Dream/cskaoyan
获取 考研经验/复试资料/考研资讯 关注微信公众号 N诺考研

  y=add(y，w)；
  signal(mutex_y1)；
  signal(mutex_y2)；
……
}

  【评分说明】
  ①各线程与变量之间的互斥、并发情况及相应评分见下表。
线程对

变量
thread1 和 thread2 thread2 和 thread3 thread1 和 thread3 给分
x 不共享 不共享 不共享 1 分
y 同时读 读写互斥 读写互斥 3 分
z 不共享 读写互斥 不共享 1 分
  ②若考生仅使用一个互斥信号量，互斥代码部分的得分最多给2分。
  ③答案部分正确，酌情给分。`,score:8}]},{id:"2017-a47",type:"applied",year:2017,no:47,subject:"计算机网络",paper:"408",stem:`甲乙双方均采用后退N帧协议（GBN)进行持续的双向数据传输，且双方始终采用捎带确认，帧长均为 $1000\\mathrm{B}$  。  $\\mathbf{S}_{\\mathrm{x,y}}$  和  $\\mathbb{R}_{\\mathrm{x,y}}$  分别表示甲方和乙方发送的数据帧，其中：x是发送序号；y是确认序号（表示希望接收对方的下一帧序号)；数据帧的发送序号和确认序号字段均为3比特。信道传输速率为100Mbps，RTT  $= 0.96\\mathrm{ms}$  。下图给出了甲方发送数据帧和接收数据帧的两种场景，其中  $\\mathfrak{t}_0$  为初始时刻，此时甲方的发送和确认序号均为0，  $\\mathfrak{t}_1$  时刻甲方有足够多的数据待发送。

![](https://408.foreverlink.love/images/12319b6f2c06558b351111c5769bb7c0.jpg)
时间
(a)

![](https://408.foreverlink.love/images/f5ee2823b6d8b58f2383dd3f5513a3cd.jpg)
时间
(b)

请回答下列问题。`,explanation:"",totalScore:9,parts:[{no:1,stem:"对于图(a)，t0时刻到t1时刻期间，甲方可以断定乙方已正确接收的数据帧数是多少？正确接收的是哪几个帧（请用Sx,y形式给出）？",answer:`t0时刻到t1时刻期间，甲方可以断定乙方已正确接收了3个数据帧，(1分)分别是S0，0、
S1，0、S2，0。(1分)`,score:null},{no:2,stem:"对于图(a)，从t1时刻起，甲方在不出现超时且未收到乙方新的数据帧之前，最多还可以发送多少个数据帧？其中第一个帧和最后一个帧分别是哪个（请用Sx,y形式给出）？",answer:`从t1时刻起，甲方最多还可以发送5个数据帧，(1分)其中第一个帧是S5，2，(1分)最后一
个数据帧是S1，2。(1分)`,score:null},{no:3,stem:"对于图(b)，从t1时刻起，甲方在不出现新的超时且未收到乙方新的数据帧之前，需要重发多少个数据帧？重发的第一个帧是哪个（请用Sx,y形式给出）？",answer:"甲方需要重发3个数据帧，(1分)重发的第一个帧是S2，3。(1分)",score:null},{no:4,stem:"甲方可以达到的最大信道利用率是多少？",answer:`甲方可以达到的最大信道利用率是：
【评分说明】
  答案部分正确，酌情给分。
全国各院校计算机/软件专业考研真题 免费分享 https://github.com/Noob-Dream/cskaoyan
获取 考研经验/复试资料/考研资讯 关注微信公众号 N诺考研`,score:null}]},{id:"2018-a41",type:"applied",year:2018,no:41,subject:"数据结构",paper:"408",stem:"给定一个含  $\\mathsf{n}(\\mathsf{n}\\geq 1)$  个整数的数组，请设计一个在时间上尽可能高效的算法，找出数组中未出现的最小正整数。例如,数组{-5,3,2,3}中未出现的最小正整数是1；数组{1,2,3}中未出现的最小正整数是4。要求：",explanation:"",totalScore:13,parts:[{no:1,stem:"给出算法的基本设计思想。",answer:`题目要求算法时间上尽可能高效，因此采用空间换时间的办法。分配一个用于标记的数组B[n]，用来记录A中是否出现了  $1\\sim n$  中的正整数，B[0]对应正整数1，B[n-1]对应正整数n，初始化B中全部为0。由于A中含有n个整数，因此可能返回的值是  $1\\sim n + 1$  ，当A中n个数恰好为 $1\\sim n$  时返回  $\\mathrm{n} + 1$  。当数组A中出现了小于等于0或者大于n的值时，会导致  $1\\sim n$  中出现空余位置，返回结果必然在  $1\\sim n$  中，因此对于A中出现了小于等于0或者大于n的值可以不采取任何操作。
经过以上分析可以得出算法流程：从A[0]开始遍历A，若  $0 < \\mathrm{A}[\\mathrm{i}] < = \\mathrm{n}$ ，则令B[A[i]-1]=1；否则不做操作。对A遍历结束后，开始遍历数组B，若能查找到第一个满足  $\\mathrm{B}[\\mathrm{i}] == 0$  的下标i，返回i+1即为结果，此时说明A中未出现的最小正整数在1~n之间。若B[i]全部不为0，返回i+1（跳出循环时  $\\mathrm{i} = \\mathrm{n}$ ，i+1等于  $\\mathrm{n} + 1$ ），此时说明A中未出现的最小正整数是  $\\mathrm{n} + 1$ 。`,score:null},{no:2,stem:"根据设计思想，采用C或  $\\mathbf{C} + +$  语言描述算法，关键之处给出注释。",answer:`算法实现如下：
\`\`\`c
int findMissMin(int A[], int n)
{
    int i, *B; //标记数组
    B = (int *)malloc(sizeof(int) *n); //分配空间
    memset(B, 0, sizeof(int) *n); //赋初值为0
    for (i = 0; i < n; i++)
        if (A[i] > 0 && A[i] <= n) //若A[i]的值介于1~n，则标记数组B
            B[A[i] - 1] = 1;
    for (i = 0; i < n; i++) //扫描数组B，找到目标值
        if (B[i] == 0) break;
    return i + 1; //返回结果
}
\`\`\``,score:null},{no:3,stem:"说明你所设计算法的时间复杂度和空间复杂度。",answer:"时间复杂度：遍历A一次，遍历B一次，两次循环内操作步骤为O(1)量级，因此时间复杂度为O(n)。空间复杂度：额外分配了B[n]，空间复杂度为O(n)。",score:null}]},{id:"2018-a42",type:"applied",year:2018,no:42,subject:"数据结构",paper:"408",stem:`拟建设一个光通信骨干网络连通 BJ、CS、XA、QD、JN、NJ、TL 和 WH 等 8 个城市，题 42 图中无向边上的权值表示两个城市间备选光缆的铺设费用。

![](https://408.foreverlink.love/images/3c8731a6d1a53e7e1959327d2f4c3225.jpg)

![](https://408.foreverlink.love/images/d827f3d8b722ced8c9fe0a9339a2278c.jpg)
题42图

请回答下列问题。`,explanation:"",totalScore:12,parts:[{no:1,stem:`仅从铺设费用角度出发, 给出所有可能的最经济的光缆铺设方案 (用带权图表示), 并
计算相应方案的总费用。`,answer:`为了求解最经济的方案，可以把问题抽象为求无向带权图的最小生成树。可以采用手动prim算法或kruskal算法作图。注意本题最小生成树有两种构造，如下图所示。
![](https://408.foreverlink.love/images/cb23f3c1b974c133fd495d0723e70c73.jpg)

![](https://408.foreverlink.love/images/4cb6e7c7695e0597394ee975fbf05a85.jpg)
方案1

![](https://408.foreverlink.love/images/1ed780762336e7c9b51c4a6fb0eacd20.jpg)
方案2

方案的总费用为16。`,score:null},{no:2,stem:"题42图可采用图的哪一种存储结构？给出求解问题（1）所使用的算法名称。",answer:"存储题中的图可以采用邻接矩阵（或邻接表）。构造最小生成树采用 Prim 算法（或 kruskal 算法）。",score:null},{no:3,stem:"假设每个城市采用一个路由器按（1）中得到的最经济方案组网，主机H1直接连接在TL的路由器上，主机H2直接连接在BJ的路由器上。若H1向H2发送一个TTL=5的IP分组，则H2是否可以收到该IP分组？",answer:"$\\mathrm{TL} = 5$ ，即IP分组的生存时间（最大传递距离）为5，方案1中TL和BJ的距离过远， $\\mathrm{TL} = 5$ 不足以让IP分组从H1传送到H2，因此H2不能收到IP分组。而方案2中TL和BJ邻近，H2可以收到IP分组。",score:null}]},{id:"2018-a43",type:"applied",year:2018,no:43,subject:"计算机组成原理",paper:"408",stem:"假定计算机的主频为  $500 \\mathrm{MHz}$ , CPI 为 4。现有设备 A 和 B, 其数据传输率分别为  $2 \\mathrm{MB} / \\mathrm{s}$  和  $40 \\mathrm{MB} / \\mathrm{s}$ , 对应 I/O 接口中各有一个 32 位数据缓冲寄存器。请回答下列问题, 要求给出计算过程。",explanation:"",totalScore:8,parts:[{no:1,stem:"若设备A采用定时查询I/O方式，每次输入/输出都至少执行10条指令。设备A最多间隔多长时间查询一次才能不丢失数据？CPU用于设备A输入/输出的时间占CPU总时间的百分比至少是多少？",answer:"程序定时向缓存端口查询数据，由于缓存端口大小有限，必须在传输完端口大小的数据时访问端口，以防止部分数据没有被及时读取而丢失。设备A准备32位数据所用时间为 $4\\mathrm{B} / 2\\mathrm{MB} = 2\\mathrm{us}$ ，所以最多每隔2us必须查询一次，每秒的查询次数至少是  $1\\mathrm{s} / 2\\mathrm{us} = 5\\times 10^{5}$ ，每秒CPU用于设备A输入/输出的时间至少为  $5\\times 10^{5}\\times 10\\times 4 = 2\\times 10^{7}$  个时钟周期，占整个CPU时间的百分比至少是  $2\\times 10^{7} / 500\\mathrm{M} = 4\\%$",score:null},{no:2,stem:"在中断I/O方式下，若每次中断响应和中断处理的总时钟周期数至少为400，则设备B能否采用中断I/O方式？为什么？",answer:"中断响应和中断处理的时间为  $400 \\times (1 / 500\\mathrm{M}) = 0.8\\mathrm{us}$ ，这时只需判断设备B准备32位数据要多久，如果准备数据的时间小于中断响应和中断处理的时间，那么数据就会被刷新、造成丢失。经过计算，设备B准备32位数据所用时间为  $4\\mathrm{B} / 40\\mathrm{MB} = 0.1\\mathrm{us}$ ，因此，设备B不适合采用中断I/O方式。",score:null},{no:3,stem:"若设备B采用DMA方式，每次DMA传送的数据块大小1000B，CPU用于DMA预处理和后处理的总时钟周期数为500，则CPU用于设备B输入/输出的时间占CPU总时间的百分比最多是多少？",answer:"在DMA方式中，只有预处理和后处理需要CPU处理，数据的传送过程是由DMA控制。设备B每秒的DMA次数最多为  $40\\mathrm{MB} / 1000\\mathrm{B} = 40000$  ，CPU用于设备B输入/输出的时间最多为 $40000\\times 500 = 2\\times 10^{7}$  个时钟周期，占CPU总时间的百分比最多为  $2\\times 10^{7} / 500\\mathrm{M} = 4\\%$  。",score:null}]},{id:"2018-a44",type:"applied",year:2018,no:44,subject:"计算机组成原理",paper:"408",stem:`某计算机采用页式虚拟存储管理方式，按字节编址。CPU 进行存储访问的过程如题 44 图所示。

![](https://408.foreverlink.love/images/c87b629aede0405c58b2d62b9b8ef13b.jpg)
题44图

根据题44图回答下列问题。`,explanation:"",totalScore:15,parts:[{no:1,stem:"主存物理地址占多少位？",answer:"物理地址由实页号和页内地址拼接，因此其位数为  $16 + 12 = 28$  ；或直接可得  $20 + 3 + 5 = 28$  。",score:null},{no:2,stem:"TLB采用什么映射方式？TLB用SRAM还是DRAM实现？",answer:`TLB采用全相联映射，可以把页表内容调入任一块空TLB项中，TLB中每项都有一个比
较器，没有映射规则，只要空闲就行。TLB采用静态存储器SRAM，读写速度快，但成本高，多用于容量较小的高速缓冲存储器。`,score:null},{no:3,stem:`Cache采用什么映射方式？若Cache采用LRU替换算法和回写（WriteBack）策略，则Cache每行中除数据(Data)、Tag和有效位外，还应有哪些附加位？Cache总容量是多少？Cache
中有效位的作用是什么？`,answer:`图中可以看到，Cache 中每组有两行，故采用 2 路组相联映射方式。
因为是2路组相联并采用LRU替换算法，所以每行（或每组）需要1位LRU位；因为采用回写策略，所以每行有1位修改位（脏位），根据脏位判断数据是否被更新，如果脏位为1则需要写回内存。

28 位物理地址中 Tag 字段占 20 位，组索引字段占 3 位，块内偏移地址占 5 位，故 Cache 共有  $2^{3} = 8$  组，每组 2 行，每行有  $2^{5} = 32 \\mathrm{~B}$ ；故 Cache 总容量为  $8 \\times 2 \\times (20 + 1 + 1 + 1 + 32 \\times 8) = 4464$  位  $= 558$  字节。

Cache中有效位用来指出所在Cache行中的信息是否有效。`,score:null},{no:4,stem:"若 CPU 给出的虚拟地址为 0008 C040H, 则对应的物理地址是多少? 是否在 Cache 中命中? 说明理由, 若 CPU 给出的虚拟地址为 0007 C260H, 则该地址所在主存块映射到的 Cache 组号是多少?",answer:`虚拟地址分为两部分：虚页号、页内地址；物理地址分为两部分：实页号、页内地址。利用虚拟地址的虚页号部分去查找TLB表（缺失时从页表调入），将实页号取出后和虚拟地址的页内地址拼接，就形成了物理地址。虚页号008CH恰好在TLB表中对应实页号0040H（有效位为1，说明存在)，虚拟地址的后3位为页内地址  $040\\mathrm{H}$  ，则对应的物理地址是0040040H。
物理地址为0040040H，其中高20位00400H为标志字段，低5位00000B为块内偏移量，中间3位010B为组号2，因此将00400H与Cache中的第2组两行中的标志字段同时比较，可以看出，虽然有一个Cache行中的标志字段与00400H相等，但对应的有效位为0，而另一Cache行的标志字段与00400H不相等，故访问Cache不命中。

因为物理地址的低12位与虚拟地址低12位相同，即为001001100000B。根据物理地址的结构，物理地址的后八位01100000B的前三位011B是组号，因此该地址所在的主存映射到Cache组号为3。`,score:null}]},{id:"2018-a45",type:"applied",year:2018,no:45,subject:"操作系统",paper:"408",stem:"请根据题44图给出的虚拟储管理方式，回答下列问题。",explanation:"",totalScore:8,parts:[{no:1,stem:"某虚拟地址对应的页目录号为6，在相应的页表中对应的页号为6，页内偏移量为8，该虚拟地址的十六进制表示是什么？",answer:`由图可知，地址总长度为32位，高20位为虚页号，低12位为页内地址。且虚页号高10位为页目录号，低10位为页号。展开成二进制则表示为：
![](https://408.foreverlink.love/images/3b92c32b2d70be85c858e33412ec9e82.jpg)

故十六进制表示为01806008H`,score:null},{no:2,stem:"寄存器 PDBR 用于保存当前进程的页目录起始地址, 该地址是物理地址还是虚拟地址? 进程切换时, PDBR 的内容是否会变化? 说明理由。同一进程的线程切换时, PDBR 的内容是否会变化? 说明理由。",answer:"PDBR为页目录基址地址寄存器（Page-Directory Base Register)，其存储页目录表物理内存基地址。进程切换时，PDBR的内容会变化；同一进程的线程切换时，PDBR的内容不会变化。每个进程的地址空间、页目录和PDBR的内容存在一一对应的关系。进程切换时，地址空间发生了变化，对应的页目录及其起始地址也相应变化，因此需要用进程切换后当前进程的页目录起始地址刷新PDBR。同一进程中的线程共享该进程的地址空间，其线程发生切换时，地址空间不变，线程使用的页目录不变，因此PDBR的内容也不变。",score:null},{no:3,stem:"为了支持改进型 CLOCK 置换算法，需要在页表项中设置哪些字段？",answer:"改进型CLOCK置换算法需要用到使用位和修改位，故需要设置访问字段（使用位）和修改字段（脏位）。",score:null}]},{id:"2018-a46",type:"applied",year:2018,no:46,subject:"操作系统",paper:"408",stem:"某文件系统采用索引节点存放文件的属性和地址信息，簇大小为4KB。每个文件索引节点占64B，有11个地址项，其中直接地址项8个，一级、二级和三级间接地址项各1个，每个地址项长度为4B。请回答下列问题。",explanation:"",totalScore:7,parts:[{no:1,stem:"该文件系统能支持的最大文件长度是多少？（给出计算表达式即可）",answer:"簇大小为4KB，每个地址项长度为4B，故每簇有  $4\\mathrm{KB} / 4\\mathrm{B} = 1024$  个地址项。最大文件的物理块数可达  $8 + 1\\times 1024 + 1\\times 1024^{2} + 1\\times 1024^{3}$  ，每个物理块（簇）大小为4KB，故最大文件长度为 $(8 + 1\\times 1024 + 1\\times 1024^{2} + 1\\times 1024^{3})\\times 4\\mathrm{KB} = 32\\mathrm{KB} + 4\\mathrm{MB} + 4\\mathrm{GB} + 4\\mathrm{TB}$",score:null},{no:2,stem:"文件系统用1M（ $1\\mathrm{M} = 2^{20}$ ）个簇存放文件索引节点，用512M个簇存放文件数据。若一个图像文件的大小为5600B，则该文件系统最多能存放多少个这样的图像文件？",answer:`文件索引节点总个数为  $1\\mathrm{M}\\times 4\\mathrm{KB} / 64\\mathrm{B} = 64\\mathrm{M}$  ，5600B的文件占2个簇，512M个簇可存放的文件总个数为  $512\\mathrm{M} / 2 = 256\\mathrm{M}$  。可表示的文件总个数受限于文件索引节点总个数，故能存储64M
个大小为5600B的图像文件`,score:null},{no:3,stem:"若文件 F1 的大小为 6KB，文件 F2 的大小为 40KB，则该文系统获取 F1 和 F2 最后一个簇的簇号需要的时间是否相同？为什么？",answer:"文件 F1 大小为  $6 \\mathrm{KB} < 4 \\mathrm{KB} \\times 8 = 32 \\mathrm{KB}$ , 故获取文件 F1 的最后一个簇的簇号只需要访问索引节点的直接地址项。文件 F2 大小为  $40 \\mathrm{KB}, 4 \\mathrm{KB} \\times 8 < 40 \\mathrm{KB} < 4 \\mathrm{KB} \\times 8 + 4 \\mathrm{KB} \\times 1024$ , 故获取 F2 的最后一个簇的簇号还需要读一级索引表。综上, 需要的时间不相同。",score:null}]},{id:"2018-a47",type:"applied",year:2018,no:47,subject:"计算机网络",paper:"408",stem:`某公司网络如题47图所示。IP地址空间192.168.1.0/24被均分给销售部和技术部两个子网，并已分别为部分主机和路由器接口分配了IP地址，销售部子网的  $\\mathrm{MTU} = 1500\\mathrm{B}$ ，技术部子网的  $\\mathrm{MTU} = 800\\mathrm{B}$ 。

请回答下列问题。

![](https://408.foreverlink.love/images/652fd7ca606b9d8452377a9733aa7248.jpg)

![](https://408.foreverlink.love/images/75658c8778da37a55269b2982b2eef6f.jpg)
题47图`,explanation:"",totalScore:7,parts:[{no:1,stem:"销售部子网的广播地址是什么？技术部子网的子网地址是什么？若每个主机仅分配一个IP地址，则技术部子网还可以连接多少台主机？",answer:`广播地址是网络地址中主机号全1的地址（主机号全0的地址，代表网络本身）。销售部和技术部均分配了192.168.1.0/24的IP地址空间，IP地址的前24位为子网的网络号。于是在后8位中划分部门的子网，选择前1位作为部门子网的网络号。令销售部子网的网络号为0，技术部子网的网络号为1，则技术部子网的完整地址为192.168.1.128；令销售部子网的主机号全1，可以得到该部门的广播地址为192.168.1.127。
每个主机仅分配一个IP地址，计算目前还可以分配的主机数，用技术部可以分配的主机数，减去已分配的主机数，技术部总共可以分配计算机主机数为  $2^{7} - 2 = 126$  （减去全0和全1的主机号）。已经分配了  $208 - 129 + 1 = 80$  个，此外还有1个IP地址分配给了路由器的端口(192.168.1.254)，因此还可以分配  $126 - 80 - 1 = 45$  台。`,score:null},{no:2,stem:"假设主机192.168.1.1向主机192.168.1.208发送一个总长度为1500B的IP分组，IP分组的头部长度为20B，路由器在通过接口F1转发该IP分组时进行了分片。若分片时尽可能分为最大片，则一个最大IP分片封装数据的字节数是多少？至少需要分为几个分片？每个分片的片偏移量是多少？",answer:"判断分片的大小，需要考虑各个网段的MTU，而且注意分片的数据长度必须是8B的整数倍。由题可知，在技术部子网内， $\\mathrm{MTU} = 800\\mathrm{B}$ ，IP分组头部长20B，最大IP分片封装数据的字节数为  $(800 - 20) / 8 \\times 8 = 776$  。至少需要的分片数为  $\\left[\\frac{(1500 - 20)}{776}\\right] = 2$  。第1个分片的偏移量为0；第2个分片的偏移量为  $776 / 8 = 97$  。",score:null}]},{id:"2019-a41",type:"applied",year:2019,no:41,subject:"数据结构",paper:"408",stem:`设线性表  $L = (a_{1}, a_{2}, a_{3}, \\dots, a_{n - 2}, a_{n - 1}, a_{n})$  采用带头结点的单链表保存，链表中的结点定义如下：

typedef struct node

\`\`\`c
int data; struct node\\*next;
}NODE;
\`\`\`

请设计一个空间复杂度为  $O(1)$  且时间上尽可能高效的算法，重新排列  $L$  中的各结点，得到线性表  $L^{\\prime} = (a_{1},a_{n},a_{2},a_{n - 1},a_{3},a_{n - 2},\\dots)$  。要求：`,explanation:"",totalScore:13,parts:[{no:1,stem:"给出算法的基本设计思想。",answer:`算法的基本设计思想：
先观察  $L = (a_{1}, a_{2}, a_{3}, \\dots, a_{n - 2}, a_{n - 1}, a_{n})$  和  $L' = (a_{1}, a_{n}, a_{2}, a_{n - 1}, a_{3}, a_{n - 2}, \\dots)$ ，发现  $L'$  是由  $L$  摘取第一个元素，再摘取倒数第一个元素……依次合并而成的。为了方便链表后半段取元素，需要先将  $L$  后半段原地逆置 [题目要求空间复杂度为  $O(1)$ ，不能借助栈]，否则每取最后一个结点都需要遍历一次链表。①先找出链表  $L$  的中间结点，为此设置两个指针 p 和 q，指针 p 每次走一步，指针 q 每次走两步，当指针 q 到达链尾时，指针 p 正好在链表的中间结点；②然后将  $L$  的后半段结点原地逆置。③从单链表前后两段中依次各取一个结点，按要求重排。`,score:null},{no:2,stem:"根据设计思想，采用C或  $\\mathrm{C + + }$  语言描述算法，关键之处给出注释。",answer:"算法实现：\n```txt\nvoid change_list(NODE\\*h)\n{ NODE \\*p,\\*q,\\*r,\\*s;  $p = q = h$  · while(q->next!=NULL） //寻找中间结点 { p=p->next; //p走一步 q=q->next; if(q->next!=NULL)q=q->next；//q走两步 } q=p->next; //p所指结点为中间结点，q为后半段链表的首结点 p->next=NULL; while(q!=NULL) //将链表后半段逆置 { r=q->next;\n```\n\n```txt\nq->next=p->next; p->next=q; q=r; } s=h->next; //s指向前半段的第一个数据结点，即插入点 q=p->next; //q指向后半段的第一个数据结点 p->next=NULL; while(q!=NULL) //将链表后半段的结点插入到指定位置 { r=q->next; //r指向后半段的下一个结点 q->next=s->next; //将q所指结点插入到s所指结点之后 s->next=q; s=q->next; //s指向前半段的下一个插入点 q=r; }\n```",score:null},{no:3,stem:"说明你所设计的算法的时间复杂度。",answer:"第1步找中间结点的时间复杂度为  $O(n)$ ，第2步逆置的时间复杂度为  $O(n)$ ，第3步合并链表的时间复杂度为  $O(n)$ ，所以该算法的时间复杂度为  $O(n)$ 。",score:null}]},{id:"2019-a42",type:"applied",year:2019,no:42,subject:"数据结构",paper:"408",stem:"请设计一个队列，要求满足：①初始时队列为空；②入队时，允许增加队列占用空间；③出队后，出队元素所占用的空间可重复使用，即整个队列所占用的空间只增不减；④入队操作和出队操作的时间复杂度始终保持为  $O(1)$  。请回答下列问题：",explanation:"",totalScore:10,parts:[{no:1,stem:"该队列是应选择链式存储结构，还是应选择顺序存储结构？",answer:`顺序存储无法满足要求②的队列占用空间随着入队操作而增加。根据要求来分析：要求①容易满足；链式存储方便开辟新空间，要求②容易满足；对于要求③，出队后的结点并不真正释放，用队头指针指向新的队头结点，新元素入队时，有空余结点则无须开辟新空间，赋值到队尾后的第一个空结点即可，然后用队尾指针指向新的队尾结点，这就需要设计成一个首尾相接的循环单链表，类似于循环队列的思想。设置队头、队尾指针后，链式队列的入队操作和出队操作的时间复杂度均为  $O(1)$ ，要求④可以满足。
因此，采用链式存储结构（两段式单向循环链表），队头指针为 front，队尾指针为 rear。`,score:null},{no:2,stem:"画出队列的初始状态，并给出判断队空和队满的条件。",answer:`该循环链式队列的实现，可以参考循环队列，不同之处在于循环链式队列可以方便增加空间，出队的结点可以循环利用，入队时空间不够也可以动态增加。同样，循环链式队列也要区分队满和队空的情况，这里参考循环队列牺牲一个单元来判断。初始时，创建只有一个空闲结点的循环单链表，头指针 front 和尾指针 rear 均指向空闲结点，如下图所示。
![](https://408.foreverlink.love/images/28788d43b61b9b3eaba71720be121a55.jpg)

队空的判定条件：front  $= =$  rear。

队满的判定条件：front  $= =$  rear->next。`,score:null},{no:3,stem:"画出第一个元素入队后的队列状态。",answer:`插入第一个元素后的状态如下图所示。
![](https://408.foreverlink.love/images/8b2c613de1785a78d713c62189325e7a.jpg)`,score:null},{no:4,stem:"给出入队操作和出队操作的基本过程。",answer:`操作的基本过程如下：
<table><tr><td>入队操作:</td></tr><tr><td>若(front == rear-&gt;next) //队满则在rear后面插入一个新的空闲结点;入队元素保存到rear所指结点中;rear=rear-&gt;next;返回。</td></tr><tr><td>出队操作:</td></tr><tr><td>若(front == rear) //队空则出队失败,返回;取front所指结点中的元素e; front = front-&gt;next;返回e。</td></tr></table>`,score:null}]},{id:"2019-a43",type:"applied",year:2019,no:43,subject:"计算机组成原理",paper:"408",stem:"有  $n$  （ $n \\geq 3$ ）位哲学家围坐在一张圆桌边，每位哲学家交替地就餐和思考。在圆桌中心有  $m$  （ $m \\geq 1$ ）个碗，每两位哲学家之间有一根筷子。每位哲学家必须取到一个碗和两侧的筷子后，才能就餐，进餐完毕，将碗和筷子放回原位，并继续思考。为使尽可能多的哲学家同时就餐，且防止出现死锁现象，请使用信号量的 P、V 操作 [wait()、signal() 操作] 描述上述过程中的互斥与同步，并说明所用信号量及初值的含义。",explanation:"",totalScore:8,parts:[{no:1,stem:"有  $n$  （ $n \\geq 3$ ）位哲学家围坐在一张圆桌边，每位哲学家交替地就餐和思考。在圆桌中心有  $m$  （ $m \\geq 1$ ）个碗，每两位哲学家之间有一根筷子。每位哲学家必须取到一个碗和两侧的筷子后，才能就餐，进餐完毕，将碗和筷子放回原位，并继续思考。为使尽可能多的哲学家同时就餐，且防止出现死锁现象，请使用信号量的 P、V 操作 [wait()、signal() 操作] 描述上述过程中的互斥与同步，并说明所用信号量及初值的含义。",answer:`回顾传统的哲学家问题，假设餐桌上有  $n$  个哲学家、  $n$  根筷子，那么可以用这种方法避免死锁（王道单科书上提供了这一思路）：限制至多允许  $n - 1$  个哲学家同时“抢”筷子，那么至少会有1个哲学家可以获得两根筷子并顺利进餐，于是不可能发生死锁的情况。

本题可以用碗这个限制资源来避免死锁：当碗的数量  $m$  小于哲学家的数量  $n$  时，可以直接让碗的资源量等于  $m$  ，确保不会出现所有哲学家都拿一侧筷子而无限等待另一侧筷子进而造成死锁的情况；当碗的数量  $m$  大于等于哲学家的数量  $n$  时，为了让碗起到同样的限制效果，我们让碗的资源量等于  $n - 1$  ，这样就能保证最多只有  $n - 1$  个哲学家同时进餐，所以得到碗的资源量为  $\\min \\{n - 1, m\\}$  。在进行PV操作时，碗的资源量起限制哲学家取筷子的作用，所以需要先对碗的资源量进行P操作。具体过程如下：

//信号量

\`\`\`txt
semaphore bowl; //用于协调哲学家对碗的使用
semaphore chopsticks[n]; //用于协调哲学家对筷子的使用
for(int i=0;i<n;i++)
    chopsticks[i]=1; //设置两个哲学家之间筷子的数量
bowl=min(n-1,m); //bowl≤n-1，确保不死锁
CoBegin
while (TRUE) { //哲学家i的程序
    思考;
    P(bowl); //取碗
    P(chopsticks[i]); //取左边筷子
    P(chopsticks[(i+1)%n]); //取右边筷子
    就餐;
    V(chopsticks[i]);
    V(chopsticks[(i+1)%n]);
    V(bowl);
}
CoEnd
\`\`\``,score:8}]},{id:"2019-a44",type:"applied",year:2019,no:44,subject:"计算机组成原理",paper:"408",stem:"某计算机系统中的磁盘有 300 个柱面, 每个柱面有 10 个磁道, 每个磁道有 200 个扇区, 扇区大小为  $512 \\mathrm{~B}$  。文件系统的每个簇包含 2 个扇区。请回答下列问题:",explanation:"",totalScore:7,parts:[{no:1,stem:"磁盘的容量是多少？",answer:"磁盘容量  $=$  磁盘的柱面数  $\\times$  每个柱面的磁道数  $\\times$  每个磁道的扇区数  $\\times$  每个扇区的大小  $= (300 \\times 10 \\times 200 \\times 512 / 1024)$  KB =  $3 \\times 10^{5}$  KB。",score:null},{no:2,stem:"假设磁头在85号柱面上，此时有4个磁盘访问请求，簇号分别为100260、60005、101660和110560。若采用最短寻道时间优先（SSTF）调度算法，则系统访问簇的先后次序是什么？",answer:"磁头在85号柱面上，对SSTF算法而言，总是访问当前柱面距离最近的地址。注意每个簇包含2个扇区，通过计算得到，85号柱面对应的簇号为  $85000\\sim 85999$  。通过比较得出，系统最先访问离  $85000\\sim 85999$  最近的100260，随后访问离100260最近的101660，然后访问110560，最后访问60005。顺序为100260、101660、110560、60005。",score:null},{no:3,stem:"第100530簇在磁盘上的物理地址是什么？将簇号转换成磁盘物理地址的过程是由I/O系统的什么程序完成的？",answer:`第100530簇在磁盘上的物理地址由其所在的柱面号、磁道号、扇区号构成。
柱面号  $=$  簇号/每个柱面的簇数  $\\left\\downarrow = \\left\\lfloor 100530 / (10\\times 200 / 2)\\right\\rfloor = 100.$

磁道号  $= \\left\\lfloor (\\text{簇号}\\% \\text{每个柱面的簇数}) / \\text{每个磁道的簇数} \\right\\rfloor = \\left\\lfloor 530 / (200 / 2) \\right\\rfloor = 5$ 。

扇区号 = 扇区地址%每个磁道的扇区数  $= (530 \\times 2) \\% 200 = 60$ 。

将簇号转换成磁盘物理地址的过程由磁盘驱动程序完成。`,score:null}]},{id:"2019-a45",type:"applied",year:2019,no:45,subject:"操作系统",paper:"408",stem:`已知  $f(n) = n! = n \\times (n - 1) \\times (n - 2) \\times \\dots \\times 2 \\times 1$ ，计算  $f(n)$  的C语言函数f1的源程序（阴影部分）及其在32位计算机M上的部分机器级代码如下：

\`\`\`txt
int f1(int n){ 1 00401000 55 push ebp ... ... if(n>1) 1100401018 83 7D 08 01 cmp dword ptr [ebp+8],1 120040101C 7E 17 jle f1+35h (00401035) return n\\*f1(n-1); 130040101E 8B 45 08 mov eax, dword ptr [ebp+8] 1400401021 83 E8 01 sub eax, 1 1500401024 50 push eax 1600401025 E8 D6 FF FF FF call f1 (00401000) ... ... 1900401030 OF AF C1 imul eax, ecx 2000401033 EB 05 jmp f1+3Ah (0040103a)
\`\`\`

\`\`\`txt
else return 1;
2100401035 B8 01 00 00 00 mov eax,1
}
... ... ... ...
2600401040 3B EC cmp ebp, esp
... ... ... ...
300040104A C3 ret
\`\`\`

其中，机器级代码行包括行号、虚拟地址、机器指令和汇编指令，计算机M按字节编址，int型数据占32位。请回答下列问题：`,explanation:"",totalScore:16,parts:[{no:1,stem:"计算  $f(10)$  需要调用函数 f1 多少次？执行哪条指令会递归调用 f1？",answer:"计算  $f(10)$  需要调用函数f1共10次，执行第16行的call指令会递归调用f1。",score:null},{no:2,stem:"上述代码中，哪条指令是条件转移指令？哪几条指令一定会使程序跳转执行？",answer:"第12行的jle指令是条件转移指令，其含义为小于等于时转移，本行代码的意义为：当 $n \\leqslant 1$ 时，跳转至地址00401035H。第16行的call指令为函数调用指令，第20行的jmp指令为无条件转移指令，第30行的ret指令为子程序的返回指令，这三条指令一定会使程序跳转执行。",score:null},{no:3,stem:"根据第16行的call指令，第17行指令的虚拟地址应是多少？已知第16行的call指令采用相对寻址方式，该指令中的偏移量应是多少（给出计算过程）？已知第16行的call指令的后4字节为偏移量，M是采用大端方式还是采用小端方式？",answer:"其长度计算机M上按字节编址，第16行的call指令的虚拟地址为00401025H，长度为5字节，故第17行的指令的虚拟地址为  $00401025\\mathrm{H} + 5 = 0040102\\mathrm{AH}$  。第16行的call指令采用相对寻址方式，即目标地址  $= (\\mathrm{PC})+$  偏移量，call指令的目标地址为  $00401000\\mathrm{H}$ ，所以偏移量  $=$  目标地址  $-(\\mathrm{PC}) = 00401000\\mathrm{H} - 0040102\\mathrm{AH} = \\mathrm{FFFFFFD6H}$  。根据第16行的call指令的偏移量字段为D6FFFFF，可以确定M采用小端方式。",score:null},{no:4,stem:"$f(13) = 6227020800$ ，但 f1(13) 的返回值为 1932053504，为什么两者不相等？要使 f1(13) 能返回正确的结果，应如何修改 f1 的源程序？",answer:"因为  $f(13) = 6227020800$ ，其结果超出了32位int型数据可表示的最大范围，因此  $f(13)$  的返回值是一个发生了溢出的错误结果。为使f1(13)能返回正确结果，可将函数f1的返回值类型改为double（或long long，或long double，或float）类型。",score:null},{no:5,stem:"第19行的imul指令（带符号整数乘）的功能是  $\\mathrm{R[eax]}\\leftarrow \\mathrm{R[eax]}\\times \\mathrm{R[ecx]}$  ，当乘法器输出的高、低32位乘积之间满足什么条件时，溢出标志  $\\mathrm{OF} = 1$  ？要使CPU在发生溢出时转异常处理，编译器应在imul指令后应加一条什么指令？",answer:"若乘积的高33位为非全0或非全1，则  $\\mathrm{OF} = 1$  。编译器应在imul指令后加一条“溢出自陷指令”，使得CPU自动查询溢出标志OF，当  $\\mathrm{OF} = 1$  时调出“溢出异常处理程序”。",score:null}]},{id:"2019-a46",type:"applied",year:2019,no:46,subject:"操作系统",paper:"408",stem:"对于题45，若计算机M的主存地址为32位，采用分页存储管理方式，页大小为4KB，则第1行的push指令和第30行的ret指令是否在同一页中（说明理由）？若指令Cache有64行，采用4路组相联映射方式，主存块大小为64B，则32位主存地址中，哪几位表示块内地址？哪几位表示Cache组号？哪几位表示标记（tag）信息？读取第16行的call指令时，只可能在指令Cache的哪一组中命中（说明理由）？",explanation:"",totalScore:7,parts:[{no:1,stem:"对于题45，若计算机M的主存地址为32位，采用分页存储管理方式，页大小为4KB，则第1行的push指令和第30行的ret指令是否在同一页中（说明理由）？若指令Cache有64行，采用4路组相联映射方式，主存块大小为64B，则32位主存地址中，哪几位表示块内地址？哪几位表示Cache组号？哪几位表示标记（tag）信息？读取第16行的call指令时，只可能在指令Cache的哪一组中命中（说明理由）？",answer:`因为页大小为4KB，所以虚拟地址的高20位为虚拟页号。第1行的push指令和第30行的ret指令的虚拟地址的高20位都是00401H，因此两条指令在同一页中。

指令 Cache 有 64 块，采用 4 路组相联映射方式，故指令 Cache 共有  $64 / 4 = 16$  组，Cache 组号共 4 位。主存块大小为 64B，故块内地址为低 6 位。综上所述，在 32 位主存地址中，低 6 位为块内地址，中间 4 位为组号，高 22 位为标记。

因为页大小为4KB，所以虚拟地址和物理地址的最低12位完全相同，因而call指令虚拟地址00401025H中的  $025\\mathrm{H} = 000000100101\\mathrm{B}$  为物理地址的低12位，对应的  $7\\sim 10$  位为组号，故对应的Cache组号为0。`,score:7}]},{id:"2019-a47",type:"applied",year:2019,no:47,subject:"计算机网络",paper:"408",stem:`某网络拓扑如题47图所示，其中R为路由器，主机  $\\mathrm{H}1\\sim \\mathrm{H}4$  的IP地址配置以及R的各接口IP地址配置如图中所示。现有若干以太网交换机（无VLAN功能）和路由器两类网络互连设备可供选择。

题47图
![](https://408.foreverlink.love/images/8e209938f93c998b77d3aac5e03e8577.jpg)
IP地址：192.168.1.2/.26默认网关：192.168.1.1
IP地址：192.168.1.3/.26默认网关：192.168.1.1
IP地址：192.168.1.66/.26默认网关：192.168.1.65
IP地址：192.168.1.67/.26
默认网关：192.168.1.65

请回答下列问题：`,explanation:"",totalScore:9,parts:[{no:1,stem:"设备1、设备2和设备3分别应选择什么类型的网络设备？",answer:"以太网交换机（无VLAN功能）连接的若干LAN仍然是一个网络（同一个广播域），路由器可以连接不同的LAN、不同的WAN或把WAN和LAN互联起来，隔离了广播域。IP地址192.168.1.2/26与192.168.1.3/26的网络前缀均为192.168.1.0，视为LAN1。IP地址192.168.1.66/26与192.168.1.67/26的网络前缀均为192.168.1.64，视为LAN2。所以设备1为路由器，设备2、3为以太网交换机。",score:null},{no:2,stem:"设备1、设备2和设备3中，哪几个设备的接口需要配置IP地址？为对应的接口配置正确的IP地址。",answer:"设备1为路由器，其接口应配置IP地址。IF1接口与路由器R相连，其相连接口的IP地址为192.168.1.253/30，253的二进制表示形式为1111101，故IF1接口的网络前缀也应为192.168.1.11111，已分配192.168.1.253，去除全0全1，IF1接口的IP地址应为192.168.1.254。LAN1的默认网关为192.168.1.1，LAN2的默认网关为192.168.1.65，网关的IP地址是具有路由功能的设备的IP地址，通常默认网关地址就是路由器中的LAN端口地址，设备1的IF2、IF3接口的IP地址分别设置为192.168.1.1和192.168.1.65。",score:null},{no:3,stem:"为确保主机  $\\mathrm{H}1\\sim \\mathrm{H}4$  能够访问Internet，R需要提供什么服务？",answer:"私有地址段：C类192.168.0.0~192.168.255.255，即  $\\mathrm{H}1\\sim \\mathrm{H}4$  均为私有IP地址，若要能够访问Internet，R需要提供NAT服务，即网络地址转换服务。",score:null},{no:4,stem:"若主机H3发送一个目的地址为192.168.1.127的IP数据报，网络中哪几个主机会接收该数据报？",answer:`主机H3发送一个目的地址为192.168.1.127的IP数据报，主机号全为1，为本网络的广播地址，由于路由器可以隔离广播域，只有主机H4会接收到数据报。
王道论坛`,score:null}]},{id:"2020-a41",type:"applied",year:2020,no:41,subject:"数据结构",paper:"408",stem:`定义三元组  $(a, b, c)$  （ $a, b, c$  均为正数）的距离  $D = |a - b| + |b - c| + |c - a|$ . 给定 3 个非空整数集合 S1, S2, S3，按升序分别存储在 3 个数组中。请设计一个尽可能高效的算法，计算并输出所有可能的三元组  $(a, b, c)$  （ $a \\in S1, b \\in S2, c \\in S3$ ）中的最小距离。例如  $S1 = \\{-1, 0, 9\\}$ ,  $S2 = \\{-25, -10, 10, 11\\}$ ,  $S3 = \\{2, 9, 17, 30, 41\\}$  则最小距离为 2，相应的三元组为  $(9, 10, 9)$  要求：

(1)给出算法的基本设计思想;
(2)根据设计思想，采用 C 或 C++ 语言描述算法，关键之处给出注释；
(3)说明你所设计算法的时间复杂度和空间复杂度。`,explanation:"",totalScore:13,parts:[{no:1,stem:`定义三元组  $(a, b, c)$  （ $a, b, c$  均为正数）的距离  $D = |a - b| + |b - c| + |c - a|$ . 给定 3 个非空整数集合 S1, S2, S3，按升序分别存储在 3 个数组中。请设计一个尽可能高效的算法，计算并输出所有可能的三元组  $(a, b, c)$  （ $a \\in S1, b \\in S2, c \\in S3$ ）中的最小距离。例如  $S1 = \\{-1, 0, 9\\}$ ,  $S2 = \\{-25, -10, 10, 11\\}$ ,  $S3 = \\{2, 9, 17, 30, 41\\}$  则最小距离为 2，相应的三元组为  $(9, 10, 9)$  要求：

(1)给出算法的基本设计思想;
(2)根据设计思想，采用 C 或 C++ 语言描述算法，关键之处给出注释；
(3)说明你所设计算法的时间复杂度和空间复杂度。`,answer:`方法一

【暴力法】

三层 for 循环，时间复杂度为  $O(l * m * n)$ ， $l, m, n$  分别为集合 S1, S2, S3 的长度评分标准：7 分

方法二

假设当前遍历到的这三个数组中的元素分别为a[i],b[j],c[k]，并且有a[i]  $< =$  b[j]<  $= c[k]$  ，则最小距离为D1  $= |a[i] - b[j]| + |b[j] - c[k]| + |c[k] - a[i]|$  ，那么接下来有三种情况：

1. 接下来求a[i], b[j], c[k+1]的最小距离，因为c[k+1] >= c[k]，所以，此时的最小距离为D2，肯定大于D1

![](https://408.foreverlink.love/images/048dc44bf4e9f1b9ce3dce839cd2d0ad.jpg)

![](https://408.foreverlink.love/images/6fa42fe487e392d7286673fe5be4bfe5.jpg)

2. 接下来求a[i], b[j+1], c[k]的最小距离，如果b[j+1] <= c[k]，则最小距离不变，如果 b[j+1] > c[k]，此时的最小距离为D2肯定必定大于D1

![](https://408.foreverlink.love/images/7671b6fb60029c8471fbddfdaeb9180e.jpg)

![](https://408.foreverlink.love/images/f3da61237a6d41fedfd26da37f9498c1.jpg)

![](https://408.foreverlink.love/images/4c88fa7458e8bf03a1ac7b357ced81e5.jpg)

3.接下来求a[i+1],b[j],c[k]的最小距离，在该种情况下D才有可能减小！

【因此只需移动最小的元素a[i]！】

所以，整体的思路是开始得出三个数组第一个元素的最小距离，接下来移动最小三个元素中最小元素的下标，与之前得到的最小距离比较，看是否需要更新最小距离，直到遍历完三个数组

【时间复杂度为  $O(l + m + n)$  】`,score:13}]},{id:"2020-a42",type:"applied",year:2020,no:42,subject:"数据结构",paper:"408",stem:"若任一个字符的编码都不是其他字符编码的前缀，则称这种编码具有前缀特性。现有某字符集（字符个数  $\\geqslant 2$ ）的不等长编码，每个字符的编码均为二进制的 0, 1 序列，最长为 L 位，且具有前缀特性。请回答下列问题：",explanation:"",totalScore:10,parts:[{no:1,stem:"哪种数据结构适宜保存上述具有前缀特性的不等长编码？",answer:`二叉树或赫夫曼树
普通的二叉树也可以设计前缀编码，赫夫曼树会使总长最小，是对前者的优化。`,score:null},{no:2,stem:"基于你所设计的数据结构, 简述从  $0 / 1$  串到字符串的译码过程",answer:"将所有的字符信息存储到二叉树的叶子结点上, 且约定左分支表示字符 '0', 右分支表示字符 '1', 则可将根节点到叶子结点的路径上分支字符组成的字符串作为该叶子结点字符的编码。从根节点出发将  $0 / 1$  串沿着分支探查下去, 遇到带有信息的叶子结点即为一个字符, 然后再从根节点出发, 以此类推直至  $0 / 1$  串全部译码为字符串。",score:null},{no:3,stem:"简述判定某字符集的不等长编码是否具有前缀特性的过程",answer:"只需判定存储有字符信息的节点是否全部为叶子结点即可。若存储有某个字符信息的节点非叶子结点，即有子节点，那么它的 0/1 编码一定是它孩子节点 0/1 编码的前缀，违反了前缀特性。",score:null}]},{id:"2020-a43",type:"applied",year:2020,no:43,subject:"计算机组成原理",paper:"408",stem:`有实现  $x*y$  的两个 C 语言函数如下：

unsigned umul ( unsigned x, unsigned y) { return x*y; } int imul ( int x, int y ) { return x*y; }

假定某计算机 M 中 ALU 只能进行加减运算和逻辑运算。请回答:`,explanation:"",totalScore:13,parts:[{no:1,stem:"若 M 的指令系统中没有乘法指令, 但有加法、减法和位移等指令, 则在 M 上也能实现上述两个函数中的乘法运算, 为什么?",answer:`乘法运算也可以通过加法操作和移位操作实现
$x * y$  可视为  $y$  个  $x$  或  $x$  个  $y$  相加的结果`,score:null},{no:2,stem:"若 M 的指令系统中有乘法指令, 则基于 ALU、位移器、寄存器以及相应控制逻辑实现乘法指令时, 控制逻辑的作用是什么?",answer:"实现相加和移位的控制",score:null},{no:3,stem:"针对以下 3 种情况: (a) 没有乘法指令; (b) 有使用 ALU 和位移器实现的乘法指令; (c) 有使用阵列乘法器实现的乘法指令, 函数 umul()在哪种情况下执行时间最长?哪种情况下执行的时间最短? 说明理由",answer:`最长: a 最短: c
a) 情况下执行时间最长，需要利用其他指令来实现乘法功能
b) 情况下使用了 ALU 与位移器, 由多次相加及位移操作串行实现乘法操作

c) 情况使用阵列乘法器做并行乘法运算，时间显然最快`,score:null},{no:4,stem:"n 位整数乘法指令可保存 2n 位乘积, 当仅取低 n 位作为乘积时, 其结果可能会发生溢出。当  $n = 32, x = 2^{31} - 1$ ,  $y = 2$  时, 带符号整数乘法指令和无符号整数乘法指令得到的  $x * y$  的 2n 位乘积分别是什么 (用十六进制表示)? 此时函数 umul() 和 imul() 的返回结果是否溢出? 对于无符号整数乘法运算, 当仅取乘积的低 n 位作为乘法结果时, 如何用 2n 位乘积进行溢出判断?",answer:`带符号整数指令乘法:  $7FFF \\, FFFFH * 2 = 00000000 FFFF \\, FFEH$
无符号整数指令乘法：  $7FFF$  FFFFH  $\\times 2 = 00000000$  FFFF FFEH

umul()返回 FFFF FFFFEH 未溢出

imul()返回 FFFF FFFEH 有溢出(结果成了负数)

高  $n$  位全 0 则未产生溢出, 否则产生溢出`,score:null}]},{id:"2020-a44",type:"applied",year:2020,no:44,subject:"计算机组成原理",paper:"408",stem:"假定主存地址为 32 位, 按字节编址, 指令 Cache 和数据 Cache 与主存之间均采用 8 路组相联映射方式, 直写 (Write Through) 写策略和 LRU 替换算法, 主存块大小为 64B, 数据区容量各为  $32 \\mathrm{KB}$  。开始时 Cache 均为空, 请回答下列问题:",explanation:"",totalScore:10,parts:[{no:1,stem:"Cache 每一行中标记 (Tag)、LRU 位各占几位? 是否有修改位?",answer:`主存地址为 32 位, 其中 6 位为块内地址
标记：32-6-6=20位

LRU：3位

直写写策略无修改位`,score:null},{no:2,stem:`有如下 C 语言程序段:
\\begin{array}{l} f o r (k = 0; k <   1 0 2 4; k + +) \\\\ S [ k ] = 2 * s [ k ]; \\\\ \\end{array}

若数组 S 及其变量 k 均为 int 型，int 型数据占 4B，变量 k 分配在寄存器中，数组 s 在主存中的起始地址为 008000C0H，则该程序段执行过程中，访问数组 S 的数据 Cache 缺失次数为多少？`,answer:"在该程序的执行过程中，产生一次缺失时会更新 Cache 中的 16 块，之后的 15 次访问均命中 Cache，故平均每 16 次访问 Cache 就会产生一次缺失，K 的范围为 1024，即共 1024 次访问 Cache，Cache 缺失次数  $= 1024 / 16 = 64$  次",score:null},{no:3,stem:"若 CPU 最先开始的访问操作是读取主存单元 0001003H 中的指令, 简要说明从 Cache 中访问该指令的过程, 包括 Cache 缺失处理过程。",answer:`CPU 访指的大致过程:
CPU发出读请求时，若访存地址在Cache中命中，就将此地址转换成Cache地址，直接对Cache进行读操作，与主存无关；若Cache不命中，则仍需访问主存，并把此字所在的一块一次性从主存调入Cache，若此时Cache已满，就根据LRU替换算法，用这个块替换Cache中的一块信息。`,score:null}]},{id:"2020-a45",type:"applied",year:2020,no:45,subject:"操作系统",paper:"408",stem:"现有 5 个操作 A、B、C、D 和 E，操作 C 必须在 A 和 B 完成后执行，操作 E 必须在 C 和 D 完成后执行，请使用信号量的 wait(), signal(), 操作（P、V 操作）描述上述操作之间的同步关系，并说明所用信号量及其初值。",explanation:"",totalScore:7,parts:[{no:1,stem:"现有 5 个操作 A、B、C、D 和 E，操作 C 必须在 A 和 B 完成后执行，操作 E 必须在 C 和 D 完成后执行，请使用信号量的 wait(), signal(), 操作（P、V 操作）描述上述操作之间的同步关系，并说明所用信号量及其初值。",answer:`\`\`\`txt
semaphore A  $=$  B  $= C = D = E = 0$
{ 完成行为A; V(A);
{ 完成行为B; V(B);
{ P(A); P(B); 完成行为C; V(C);
{ 完成行为D; v(D);
{ P(C); P(D); 完成行为E; V(E);`,score:7}]},{id:"2020-a46",type:"applied",year:2020,no:46,subject:"操作系统",paper:"408",stem:`某 32 位系统采用基于二级页表的请求分页存储管理方式, 按字节编址, 页目录项和页表项长度均为 4 字节, 虚拟地址结构如下:

<table><tr><td>页目录号（10位）</td><td>页号（10位）</td><td>页内偏移量（12位）</td></tr></table>

某 C 程序中数组 a[1024][1024]的起始虚拟地址为 1080 0000H，数组元素占 4 字节，该程序运行时，其进程的页目录起始物理地址为 0020 1000H，请回答下列问题：`,explanation:"",totalScore:8,parts:[{no:1,stem:"数组元素 a[1][2]的虚拟地址是什么? 对应的页目录号和页号分别是什么? 对应的页目录项的物理地址是什么? 若该目录项中存放的页框号为 00301H, 则 a[1][2]所在页对应的页表项的物理地址是什么?",answer:`页面大小  $= 2^{12} \\mathrm{~B} = 4 \\mathrm{KB}$ , 数组元素占 4 字节, 每个页面存放 1K 个数组元素, 1080000H 的虚页号为 1080H, 注意到二维数组 a 的一行的元素个数与每个页面存放的元素个数相同, 故 a[0] 存放的虚页号为 1080H, a[1] 存放的虚页号为 1081H, a[1][2] 的虚拟地址为  $10810000 \\mathrm{H} + 2 * 4 = 10810008 \\mathrm{H}$
1081 0008H = 0001 0000 1000 0001 0000 0000 0000 1000，对应的页目录号为66,

页号为 16

页目录的长度为 4B, 66 号页目录项的物理地址是 00201000H + 66*4 = 00201108H 该目录项中存放的页框号是 00301H, 则该页框的起始地址是 00301000H, a[1][2] 所在页面的页号为 16 , 每个页表项为 4B , 对应的页表项物理地址为 00301000H+16*4 = 00301040H`,score:null},{no:2,stem:"数组 a 在虚拟地址空间中所占区域是否必须连续? 在物理地址空间中所占区域是否必须连续?",answer:"在虚拟地址空间中所占区域必须连续，在物理地址空间中所占区域可以不连续",score:null},{no:3,stem:"已知数组 a 按行优先方式存放, 若对数组 a 分别按行遍历和按列遍历, 则哪一种遍历方式的局部性更好?",answer:"按行遍历的局部性更好，二维数组 a 的一行的元素个数与每个页面存放的元素个数相同，故一行的所有元素均可以存放在同一个页面中，行遍历时遍历同一行中的所有元素访问的是同一个页面。",score:null}]},{id:"2020-a47",type:"applied",year:2020,no:47,subject:"计算机网络",paper:"408",stem:`某校园网有两个局域网，通过路由器 R1、R2 和 R3 互联后接入 Internet，S1 和 S2 为以太网交换机，局域网采用静态 IP 地址配置，路由器部分接口以及各主机的 IP 地址如图所示：

![](https://408.foreverlink.love/images/b14ead6aa46153c0c2b39bde3a26e671.jpg)

假设NAT转换表结构为：

<table><tr><td colspan="2">外网</td><td colspan="2">内网</td></tr><tr><td>IP地址</td><td>端口号</td><td>IP地址</td><td>端口号</td></tr><tr><td></td><td></td><td></td><td></td></tr></table>

请回答下列问题：`,explanation:"",totalScore:9,parts:[{no:1,stem:"为使 H2 和 H3 能够访问 Web 服务器 (使用默认端口号), 需要进行什么配置?",answer:`注：H2和H3应是19216812的台式机与19216813的笔记本
路由器R2需要开启NAT服务，对应的NAT转换表做如下配置：

<table><tr><td colspan="2">外网</td><td colspan="2">内网</td></tr><tr><td>IP地址</td><td>端口号</td><td>IP地址</td><td>端口号</td></tr><tr><td>203.10.2.6</td><td>默认端口号</td><td>192.168.1.2</td><td>80</td></tr><tr><td>203.10.2.6</td><td>默认端口号</td><td>192.168.1.3</td><td>80</td></tr></table>`,score:null},{no:2,stem:"若 H2 主动访问 Web 服务器时, 将 HTTP 请求报文封装到 IP 数据报 P 中发送,则 H2 发送 P 的源 IP 地址和目的 IP 地址分别是? 经过 R3 转发后, P 的源 IP 地址和目的 IP 地址分别是? 经过 R2 转发后, P 的源 IP 地址和目的 IP 地址分别是?",answer:`H2 发送 P 的源 IP 地址: 192.168.1.2 目的 IP 地址: 203.10.2.2
R3发送P的源IP地址：203.10.2.6 目的IP地址：203.10.2.2

R2发送P的源IP地址：203.10.2.6 目的IP地址：192.168.1.2`,score:null}]},{id:"2021-a41",type:"applied",year:2021,no:41,subject:"数据结构",paper:"408",stem:`已知无向连通图  $G$  由顶点集  $V$  和边集  $E$  组成,  $|E| > 0$ , 当  $G$  中度为奇数的顶点个数为不大于 2 的偶数时,  $G$  存在包含所有边且长度为  $|E|$  的路径 (称为 EL 路径)。设图  $G$  采用邻接矩阵存储, 类型定义如下:

typedef struct //图的定义

int numVertices, numEdges;

//图中实际的顶点数和边数

char VerticesList[ MAXV ];

// 顶点表。MAXV为已定义常量

int Edge[ MAXV ][ MAXV ];

//邻接矩阵

MGraph;

请设计算法：int IsExistEL(MGraph G)，判断  $G$  是否存在EL路径，若存在，则返回1，否则，返回0。要求：`,explanation:"",totalScore:15,parts:[{no:1,stem:"给出算法的基本设计思想。",answer:`算法的基本设计思想
对于采用邻接矩阵存储的无向图, 邻接矩阵每一行 (列) 中非零元素的个数为本行 (列) 对应顶点的度。可以依次计算连通图  $G$  中各顶点的度, 并记录度为奇数的顶点个数, 若个数为 0 或 2 , 则返回 1 , 否则返回 0 。`,score:null},{no:2,stem:"根据设计思想, 采用 C 或  $\\mathrm{C}++$  语言描述算法, 关键之处给出注释。",answer:`算法实现
$$
i n t I s E x i s t E L (M G r a p h G)
$$

// 采用邻接矩阵存储，判断图是否存在EL路径

$$
\\begin{array}{l} \\text {i n t d e g r e e , i , j , c o u n t} = 0; \\\\ f o r (i = 0; i <   G. n u m V e r t i c e s; i + +) \\\\ \\left\\{ \\begin{array}{l} \\text {d e g r e e} = 0; \\end{array} \\right. \\\\ f o r (j = 0; j <   G. n u m V e r t i c e s; j + +) \\\\ \\end{array}
$$

// 依次计算各个顶点的度

\`\`\`javascript
degree  $+ =$  G.Edge[i][j]；if（degree%2！=0）count++; //对度为奇数的顶点计数if(count  $= = 0$  |1 count  $= = 2$  ）return1; //存在EL路径，返回1elsereturn0; //不存在EL路径，返回0
\`\`\``,score:null},{no:3,stem:"说明你所设计算法的时间复杂度和空间复杂度。",answer:`算法的时间复杂度和空间复杂度
本参考答案给出的算法的时间复杂度是  $O(n^{2})$  ，空间复杂度是  $O(1)$  。`,score:null}]},{id:"2021-a42",type:"applied",year:2021,no:42,subject:"数据结构",paper:"408",stem:`已知某排序算法如下:

\`\`\`txt
void cmpCountSort(int a[],int b[],int n)
{ int i,j,*count; count = (int *)malloc(sizeof(int)*n); //C++语言：count = new int[n]; for(i = 0;i < n;i++) count[i] = 0; for(i = 0;i < n-1;i++) for(j = i+1;j < n;j++) if(a[i] < a[j]) count[j]++; else count[i]++; for(i = 0;i < n;i++) b[count[i]] = a[i]; free(count); //C++语言：delete count; }
\`\`\`

请回答下列问题。`,explanation:"",totalScore:8,parts:[{no:1,stem:"若有int a[] = {25, -10, 25, 10, 11, 19}, b[6];，则调用cmpCountSort(a, b, 6)后数组b中的内容是什么？",answer:"$\\mathbf{b}[\\mathbf{\\theta}] = \\{-10, 10, 11, 19, 25, 25\\}$",score:null},{no:2,stem:"若  $\\mathbf{a}$  中含有  $n$  个元素, 则算法执行过程中, 元素之间的比较次数是多少?",answer:"元素之间的比较次数是  $n(n - 1) / 2$  。",score:null},{no:3,stem:`该算法是稳定的吗？若是，则阐述理由；否则，修改为稳定排
序算法。`,answer:`不是。
需要将程序中的if语句修改如下：

$$
\\begin{array}{l} \\text {i f} (\\mathrm {a} [ \\mathrm {i} ] <   = \\mathrm {a} [ \\mathrm {j} ]) \\operatorname {c o u n t} [ \\mathrm {j} ] + +; \\\\ e l s e \\quad c o u n t [ i ] + +; \\\\ \\end{array}
$$`,score:null}]},{id:"2021-a43",type:"applied",year:2021,no:43,subject:"计算机组成原理",paper:"408",stem:`假定计算机M字长为16位，按字节编址，连接CPU和主存的系统总线中地址线为20位、数据线为8位，采用16位定长指令字，指令格式及其说明如下：

格式 6位 2位 2位 2位 4位 指令功能或指令类型说明

<table><tr><td>R型</td><td>000000</td><td>rs</td><td>rt</td><td>rd</td><td>op1</td></tr><tr><td>I型</td><td>op2</td><td>rs</td><td>rt</td><td colspan="2">imm</td></tr><tr><td>J型</td><td>op3</td><td colspan="4">target</td></tr></table>

$\\mathbb{R}[\\mathrm{rd}]\\gets \\mathbb{R}[\\mathrm{rs}]\\mathrm{op1}\\mathbb{R}[\\mathrm{rt}]$

含ALU运算、条件转移和访存操作3类指令

PC的低10位  $\\leftarrow$  target

其中，op1~op3 为操作码，rs、rt 和 rd 为通用寄存器编号，R[r] 表示寄存器 r 的内容，imm 为立即数，target 为转移目标的形式地址。请回答下列问题。`,explanation:"",totalScore:15,parts:[{no:1,stem:"ALU 的宽度是多少位? 可寻址主存空间大小为多少字节?指令寄存器、主存地址寄存器 (MAR) 和主存数据寄存器 (MDR) 分别应有多少位?",answer:"ALU的宽度为16位。可寻址主存空间大小为  $2^{20}$  字节（或1MB）。指令寄存器、MAR和MDR各有16位、20位和8位。",score:null},{no:2,stem:"R 型格式最多可定义多少种操作? I 型和 J 型格式总共最多可定义多少种操作? 通用寄存器最多有多少个?",answer:"R 型最多有  $2^{4}$  (或 16) 种操作。I 型和 J 型总共最多有 63 种操作。通用寄存器最多有 4 个。",score:null},{no:3,stem:"假定 op1 为 0010 和 0011 时, 分别表示带符号整数减法和带符号整数乘法指令, 则指令 01B2H 的功能是什么 (参考上述指令功能说明的格式进行描述)? 若 1、2、3 号通用寄存器当前内容分别为 B052H、0008H、0020H, 则分别执行指令 01B2H 和 01B3H 后, 3 号通用寄存器内容各是什么? 各自结果是否溢出?",answer:`指令  $01B2H = 0000000110110010B$  ，其功能为  $\\mathbb{R}[3]\\leftarrow$ $\\mathrm{R}[1] - \\mathrm{R}[2]$  。执行指令  $01\\mathrm{B}2\\mathrm{H}$  后，  $\\mathrm{R}[3] = \\mathrm{B}052\\mathrm{H} - 0008\\mathrm{H} =$  B04AH；结果不溢出；执行指令  $01\\mathrm{B}3\\mathrm{H}$  后，  $\\mathrm{R}[3] = \\mathrm{R}[1]\\times$
$$
\\mathrm {R} [ 2 ] = \\mathrm {B} 0 5 2 \\mathrm {H} \\times 0 0 0 8 \\mathrm {H} = 8 2 9 0 \\mathrm {H}, \\text {结 果 溢 出 。}
$$`,score:null},{no:4,stem:"若采用 I 型格式的访存指令中  $\\mathrm{{imm}}\\left( {\\text{偏移量}}\\right)$  为带符号整数, 则地址计算时应对  $\\mathrm{{imm}}$  进行零扩展还是符号扩展?",answer:"应对imm进行符号扩展。",score:null},{no:5,stem:"无条件转移指令可以采用上述哪种指令格式?",answer:"无条件转移指令可以采用 J 型格式。",score:null}]},{id:"2021-a44",type:"applied",year:2021,no:44,subject:"计算机组成原理",paper:"408",stem:`假设计算机 M 的主存地址为 24 位, 按字节编址; 采用分页

存储管理方式，虚拟地址为30位，页大小为4KB；TLB采用2路组相联方式和LRU替换策略，共8组。请回答下列问题。`,explanation:"",totalScore:8,parts:[{no:1,stem:"虚拟地址中哪几位表示虚页号？哪几位表示页内地址？",answer:"因为按字节编址，页大小为  $4\\mathrm{KB} = 2^{12}\\mathrm{B}$ ，所以虚拟地址中高  $30 - 12 = 18$  位表示虚页号。虚拟地址低12位表示页内地址。",score:null},{no:2,stem:"已知访问TLB时虚页号高位部分用作TLB标记，低位部分用作TLB组号，M的虚拟地址中哪几位是TLB标记？哪几位是TLB组号？",answer:"因为TLB采用2路组相联方式，共  $8 = 2^{3}$  组，所以虚拟地址（或虚页号）中高  $18 - 3 = 15$  位为TLB标记；虚拟地址中随后3位（或虚页号中低3位）为TLB组号。",score:null},{no:3,stem:"假设TLB初始时为空，访问的虚页号依次为10、12、16、7、26、4、12和20，在此过程中，哪一个虚页号对应的TLB表项被替换？说明理由。",answer:"虚页号4对应的TLB表项被替换。因为虚页号与TLB组号的映射关系为TLB组号  $=$  虚页号modTLB组数  $=$  虚页号mod8，因此，虚页号10、12、16、7、26、4、12、20映射到的TLB组号依次为2、4、0、7、2、4、4、4。TLB采用2路组相联方式，从上述映射到的TLB组号序列可以看出，只有映射到4号组的虚页号数量大于2，相应虚页号依次是12、4、12和20。根据LRU替换策略，当访问第20页时，虚页号4对应的TLB表项被替换出来。",score:null},{no:4,stem:"若将M中的虚拟地址位数增加到32位，则TLB表项的位数增加几位？",answer:"虚拟地址位数增加到32位时，虚页号增加了  $32 - 30 = 2$  位，使得每个TLB表项中的标记字段增加2位，因此，每个TLB表项的位数增加2位。",score:null}]},{id:"2021-a45",type:"applied",year:2021,no:45,subject:"操作系统",paper:"408",stem:`下表给出了整型信号量 S 的 wait() 和 signal() 操作的功能描述, 以及采用开/关中断指令实现信号量操作互斥的两种方法。

<table><tr><td>功能描述</td><td>方法1</td><td>方法2</td><td></td></tr><tr><td>Semaphore S; wait(S) { while(S&lt;=0); S=S-1; }</td><td>Semaphore S; wait(S) { 关中断; while(S&lt;=0); S=S-1; 开中断; }</td><td>Semaphore S; wait(S) { 关中断; while(S&lt;=0) | 开中断; 关中断; } S=S-1; 开中断; } signal(S) { signal(S) { 关中断; S=S+1; 开中断; }</td><td>Semaphore S; wait(S) { 关中断; while(S&lt;=0) | 开中断; signal(S) { 关中断; S=S+1; 开中断; }</td></tr></table>

请回答下列问题。`,explanation:"",totalScore:7,parts:[{no:1,stem:"为什么在 wait() 和 signal() 操作中对信号量 S 的访问必须互相排斥执行?",answer:"因为信号量S是能够被多个进程共享的变量，多个进程都可以通过wait()和signal()对S进行读、写操作。所以，在wait()和signal()操作中对S的访问必须是互斥的。",score:null},{no:2,stem:"分别说明方法 1 和方法 2 是否正确。若不正确, 请说明理由。",answer:"方法 1 是错误的。在 wait() 中, 当  $S < = 0$  时, 关中断后, 其他进程无法修改 S 的值, while 语句陷入死循环。方法 2 是正确的。",score:null},{no:3,stem:"用户程序能否使用开/关中断指令实现临界区互斥？为什么？",answer:"用户程序不能使用开/关中断指令实现临界区互斥。因为开中断和关中断指令都是特权指令。",score:null}]},{id:"2021-a46",type:"applied",year:2021,no:46,subject:"操作系统",paper:"408",stem:"某计算机用硬盘作为启动盘, 硬盘第一个扇区存放主引导记录, 其中包含磁盘引导程序和分区表。磁盘引导程序用于选择要引导哪个分区的操作系统, 分区表记录硬盘上各分区的位置等描述信息。硬盘被划分成若干个分区, 每个分区的第一个扇区存放分区引导程序, 用于引导该分区中的操作系统。系统采用多阶段引导方式, 除了执行磁盘引导程序和分区引导程序外, 还需要执行 ROM 中的引导程序。请回答下列问题。",explanation:"",totalScore:8,parts:[{no:1,stem:"系统启动过程中操作系统的初始化程序、分区引导程序、ROM 中的引导程序、磁盘引导程序的执行顺序是什么?",answer:"执行顺序依次是ROM中的引导程序、磁盘引导程序、分区引导程序、操作系统的初始化程序。",score:null},{no:2,stem:"把硬盘制作为启动盘时, 需要完成操作系统的安装、磁盘的物理格式化、逻辑格式化、对磁盘进行分区, 执行这 4 个操作的正确顺序是什么?",answer:"4个操作的执行顺序依次是磁盘的物理格式化、对磁盘进行分区、逻辑格式化、操作系统的安装。",score:null},{no:3,stem:"磁盘扇区的划分和文件系统根目录的建立分别是在第 (2)问的哪个操作中完成的?",answer:"磁盘扇区的划分是在磁盘的物理格式化操作中完成的。文件系统根目录的建立是在逻辑格式化操作中完成的。",score:null}]},{id:"2021-a47",type:"applied",year:2021,no:47,subject:"计算机网络",paper:"408",stem:`某网络拓扑如题 47 图所示, 以太网交换机 S 通过路由器 R 与 Internet 互联。路由器部分接口、本地域名服务器、H1、H2 的 IP 地址和 MAC 地址如图中所示。在  $t_{0}$  时刻 H1 的 ARP 表和 S 的交换表均为空, H1 在此刻利用浏览器通过域名 www.abc.com 请求访问 Web 服务器, 在  $t_{1}$  时刻  $(t_{1} > t_{0})$  S 第一次收到了封装 HTTP 请求报文的以太网帧, 假设从  $t_{0}$  到  $t_{1}$  期间网络未发生任何与此次 Web 访问无关的网络通信。

![](https://408.foreverlink.love/images/1e3c73b9af5b0a86642a056346c1dace.jpg)
题47图

请回答下列问题。`,explanation:"",totalScore:9,parts:[{no:1,stem:"从  $t_{0}$  到  $t_{1}$  期间, H1 除了 HTTP 之外还运行了哪个应用层协议? 从应用层到数据链路层, 该应用层协议报文是通过哪些协议进行逐层封装的?",answer:"从  $t_{0}$  到  $t_{1}$  期间, H1 除了 HTTP 之外还运行了 DNS 应用层协议; DNS 报文从应用层到数据链路层, 逐层封装关系是: DNS报文  $\\rightarrow$  UDP 数据报  $\\rightarrow$  IP 数据报  $\\rightarrow$  CSMA/CD 帧。",score:null},{no:2,stem:"若S的交换表结构为：<MAC地址，端口  $>$  ，则  $\\iota_{1}$  时刻S交换表的内容是什么？",answer:`S 在  $t_{1}$  时刻的交换表为:
<table><tr><td>MAC 地址</td><td>端口</td></tr><tr><td>00-11-22-33-44-cc</td><td>4</td></tr><tr><td>00-11-22-33-44-bb</td><td>1</td></tr><tr><td>00-11-22-33-44-aa</td><td>2</td></tr></table>`,score:null},{no:3,stem:`从  $t_{0}$  到  $t_{1}$  期间, H2 至少会接收到几个与此次 Web 访问相关的帧? 接收到的是什么帧? 帧的目的 MAC 地址是什么?
2021年全国硕士研究生招生考试`,answer:"H2至少会接收到2个帧；接收到的均是封装ARP查询报文的以太网帧；这些帧的目的MAC地址均是：FF-FF-FF-FF-FF-FF。",score:null}]},{id:"2022-a41",type:"applied",year:2022,no:41,subject:"数据结构",paper:"408",stem:`已知非空二叉树T的结点值均为正整数， 采用顺序存储方式保存，数据结构定义如下：
typedef struct { // MAX SIZE为已定义常量
int SqBiTNode[MAX_SIZE]; //保存三叉树结点值的数组
int ElemNum; //实际占用的数组元素个数
} SqBiTree;
T中不存在 的结点在数组SqBiTNode 中用-l表示。 例如， 对于下图所示的两棵非空二叉树
Tl和T2,
二叉树Tl 二叉树T2
Tl的存储结果如下
| 40 | 2 5 | 60 | -1 | 30 I -1 | 80 | -1 | - 1 1 27 Tl.SqBiTNode
Tl.ElemNurn = 10
T2的存储结果如下：
I 40| 501 601-1 1 30 | -1 1 -1 1 -1 1 -1 1 -1 1 35 1 T2.SqBiTNode
T2.ElemNum = 11
请设计 一个尽 可能高效的算法， 判定一棵采用这种方式 存储的二叉树是否为二叉搜索树， 若
是， 则返回true , 否则， 返回false。 要求：`,explanation:"",totalScore:13,parts:[{no:1,stem:"给出算法的基本设计思想。",answer:`算法的基本设计思想
对于采用顺序存储方式保存的二叉树， 根结点保存在 SqBiTNode[O] 中； 当某结点保存在
SqBiTNode[i]中时，若有左孩子，则其值保存在 SqBiTNode[2i+l] 中；若有右孩子，则
其值保存在 SqBiTNode[2i+2]中；若有双亲结点，则其值保存在 SqBiTNode[ （七1) /2)
中。
二叉搜索树需要满足的条件是：任 一结点值大于其左子树中的全部结点值，小于其右子树
中的全部结点值。 中序遍历二叉搜索树得到
一个升序序列。
使用整型变量 val 记录中序遍历过程中已遍历结点的最大值， 初值为 一个负整数。 若当
前遍历的结点值小于等于 val, 则算法返回 false, 否则， 将val 的值更新为当前结点
的值。`,score:null},{no:2,stem:"根据设计思想， 采用C或C++语言描述算法， 关键之处给出注释。",answer:`算法实现
#define false 0
#define true 1
typedef int-bool;
bool judgeInOrderBST(SqBiTree bt，int k, int *val){//初始调用时k的值是0
if(k<bt.-ElemNum&&bt.SqBiTNode[k]!=-1) {
if(! judgeInOrderBST(bt ,- 2*k+1,val)) return false;
if (bt.SqBiTNode [k] <=*val)· ·return false;
*val=bt.SqBiTNode[k];
if(! judgeInOrderBST (bt, 2*k+2,val).)
return true;
return false;
【解法二】
 1) 算法的基本设计思想
对于采用顺序存储方式保存的二叉树， 根结点保存在 SqBiTNode[O] 中；当某结点保存在
SqBiTNode[i] 中时，若有左孩子，则其值保存在 SqBiTNode[2i+l] 中；若有右孩子，则
其值保存在 SqBiTNode[2i+2] 中；若有双亲结点，则其值保存在 SqBiTNode [ (i一 1)/2]
中。
二叉搜索树需要满足的条件是：任
一
结点值大于其左子树中的全部结点值，小于其右子树
中的全部结点值。设置两个数组 pmax 和 pmin 。根据二叉搜索树的定义， SqBiTNode[i]
中的值应该大于以 SqBiTNode[2i+l] 为根的子树中的最大值（保存在 pmax [2i+l]
中）， 小于以 SqBiTNode[2i+2] 为根的子树中的最小值（保存在 pmin[2i+l] 中）。 初
始时， 用数组 SqBiTNode 中前 ElemNum 个元素的值对数组 pmax 和 pmin 初始化。
在数组 SqBiTNode 中从后向前扫描，扫描过程中逐
一
验证结点与子树之间是否满足上述
的大小关系。
2) 算法实现
#define false 0
#define true 1
typedef int bool;
bool judgeBST(SqBiTree bt){
int k, m, *pmin, *pmax; ·.
pmin= (int *) malloc (sizeof {int).* (btElemNum));
pmax= (int ＊ ）malloc (sizeof {intJt (bt.ElemNum));
for(k::;Q;k<bt.ElemNum;k++) //辅助数组初始化
pmin[k]=pmax[k] =bt. SqBiTNode[k];
for(k=bt.ElemNum一 l;k>0;k--) {//从最后 一个叶结点向根遍历
if(bt.SqBiTNode[k] !=-1){
m= (k-1)/2; //双亲
if(k%2==1&&bt.SqBiTNode[m]>pmax[k])
pmin[m]=pmin[k];
else if(k%2==0&&bt.SqBiTNode[m]<pmin[k])
pmax[m]=pmax[k];
else return false;
//其为左孩子
//其为右孩子
}
return true;`,score:null}]},{id:"2022-a42",type:"applied",year:2022,no:42,subject:"数据结构",paper:"408",stem:`现有n (n > 100000)个数保存在 一维数组M中， 需要查找M中最小的10个数。 请
回答下列问题。`,explanation:"",totalScore:10,parts:[{no:1,stem:`设计 一个完成上述查找任务的算法，要求平均情况下的比较次数尽可能少，简述其 算法思
想（ 不需要程序实现） 。`,answer:`算法思想
【解法一】
定义含10个元素的数组A ,初 始时元素值均为该数组类型能表示的最大数M心（。
for M 中的每个元素s
if (s <A[9]） 丢弃A[9]并将s按升序插入到A 中；
当数据全部扫描完毕， 数组A[O],_,A[9]保存的即是最小的 10 个数。
【解法二】
定义含10个元素的大 根堆H, 元素值均为该堆元素类型能表示的最大数M心(。
for M中的每个元素s
if(s < H的堆顶元素） 删除堆顶元素并将 s插入到H中；
当数据全部扫描完毕， 堆 H 中保存的即是最小的10个数。`,score:null},{no:2,stem:"说明你所设计的算法平均情况下的时间复杂度和空间复杂度。",answer:"算法 平均情况下的时间复杂度是O(n)， 空间复杂度是0(1)。",score:null}]},{id:"2022-a43",type:"applied",year:2022,no:43,subject:"计算机组成原理",paper:"408",stem:`某CPU中部分数据通路如题 43 图所示， 其中， GPRs为通用寄存器组；FR为标志
寄存器，用于存放ALU产生的标志信息；带箭头虚线表示控制信号，如控制信号 Read、Write
分别表示主存读、 主存 写， MDRin表示内部总线上数据写入MDR,MDRout表示MDR的内
容送内部总线 。
系统总线
， 了， ， ，
Read:
Write
GPRin
题43图
请回答下列问题。`,explanation:"",totalScore:15,parts:[{no:1,stem:`设ALU的输入端A、 B及输出端F的最高位分别为A15 、B 15 及F15, FR中的符号标志和
溢出标志分别为SF和OF, 则SF的逻辑表达式是什么？A加B、 A减B时OF的逻辑表
达式分别是什么？要求逻辑表达式的输入变量为A15 、B 15 及F150`,answer:`符号标志SF表示运算结果的正负性， 因此SF=F1so
对于加 法运算A+ B-F,若A、B为负，且F为正，则说明发生溢出；或者，若A、B为正，
且F为负，也说明发生溢出。因此， 加运算时，溢出标志OF=A B ·F 15 15 15+A15·B15. E5 °
对于减 法运算 A-B-F，若A 为负、 B为正， 且F为 正，则说明发 生溢出；或者， 若A
为正、B为负，且F为负，也说明发生溢出。因 此， 减运算时，溢出标志OF= 兀:·B15·F15+
A15· B15 .Fl5 °`,score:null},{no:2,stem:"为什么要设置暂存器 Y 和 Z?",answer:`因为在单总线结构中， 每 一时刻总线上只有一个数据有效， 而 ALU 有两个输入端和 一个
输出端。因此， 当 ALU运算时， 需要先用暂存器 Y 缓存其中一个输入端的数据，再通过
总线 传送另 一个输入端的数据。 与此同时， ALU 的输出端产生运算结果， 但由于总线正
被占用， 因此需要暂存器 Z, 以缓存 ALU 的输出端数据。`,score:null},{no:3,stem:`若 GPRs 的输入端 rs、 rd 分别为所读、 写的通用寄存器的编号， 则 GPRs 中最多有多少个
通用寄存器？rs 和 rd 来自图中的哪个寄存器？已知 GPRs 内部有一个地址译码器和一个多
路选择器， rd 应连接地址译码器还是多路选择器？`,answer:`由图可知，rs和rd都是4bit, 因此GPRs中最多有2
=16个通用寄存器；rs和rd来自指令寄
存器IR.; rd表示寄存器编号， 应连接地址译码器。`,score:null},{no:4,stem:`取指令阶段（不考虑PC增量操作） 的控制信号序列是什么？若从发出主存读命令到主存
读出数据并传送到MD R共需5个时钟周期， 则取指令阶段至少需要几个时钟周期？`,answer:`取指阶段需要根据程序计数器 PC 取出主存中的指令， 并将指令写入指令寄存器IR.中。控制
信号序列如下：
(DPCout,M应 II'将指令的地址写入MAR
@Read //读主存并将读出的数据写入 MDR
@:MDRout, IRin //将 MDR 的内容写入指令寄存器 IR
步骤＠需要1个时钟周期，步骤＠需要5个时钟周期，步骤＠需要1个时钟周期， 因此取指
令阶段至少需要7个 时钟周期。`,score:null},{no:5,stem:"图中控制信号由什么部件产生？图中哪些寄存器的输出信号会连到该部件的输入端？",answer:`图中控制信号由控制部件(CU) 产生 。指 令寄存器IR和 标志寄存器FR的输出信号会连
到控制部件的输入端。`,score:null}]},{id:"2022-a44",type:"applied",year:2022,no:44,subject:"计算机组成原理",paper:"408",stem:`假设某磁盘驱动器中有 4 个双面盘片， 每个盘面有 20000 个磁道， 每个磁道有 500 个
扇区，每个扇区可记录 512 字节的数据，盘片转速为 7200RPM（转/分），平均寻道时间为 5ms。
请回答下列问题。`,explanation:"",totalScore:8,parts:[{no:1,stem:`每个扇区包含数据及其地址信息，地 址信息分为 3 个字段。 这 3 个字段的名称各是什么？
对于该磁盘， 各字段至少占多少位？`,answer:`3个字段 的名称为柱面号（或磁道号）、磁头号（或盘面号）、扇区号。 由于每个盘面有
20000 个磁道， 因此该磁盘共有 20000 个柱面， 柱面号字段至少占「log2 20000 l = 15 位；
由于该磁盘共有4个盘片，每个盘片有2个盘面，因此磁头号字段至少占 log式4x2) = 3 位；
由于每个磁道有 500 个扇区， 因此扇区号字段至少占「log2 5001 = 9 位。`,score:null},{no:2,stem:"一个扇区的平均访问时间约为多少？",answer:`一个扇区的访问时间由寻道时间、延迟时间、传输时间三部分组成。平均寻道时间为5ms,
平均 延迟时间等于磁盘转半圈所需要的时间，平均 传输时间等于一个扇区划过磁头下方所
需要的时间。 而该磁盘转 一圈的时间为60X 103 /7200 叭 8.33ms， 因此一个扇区的平均访问
时间约为5 + 8.33/2 + 8.33/500 还 9.18ms。`,score:null},{no:3,stem:`若采用周期挪用DMA方式进行磁盘与主机之间的数据传送， 磁盘控制器中的数据缓冲区
大小为 64 位， 则在 一个扇区读写过程中， DMA控制器向CPU发送了多少次总线请求？
若CPU检测到DMA控制器的总线请求信号时也需要访问主存，则DMA控制器是否可以
获得总线使用权？为什么？`,answer:`磁盘控制器中的数据缓冲区每充满 一次， DMA控制器就需要发出 一 次总线请求，． 将这
64bit数据通过总线传送到主存，因此，在一个扇区读写过程中， DMA控制器向CPU发送
了512B/64bit = 64次总线请求。由于采用周期挪用DMA方式，因此当CPU和DMA控制
器都需要访问主存时， DMA控制器可以优先获得总线使用权。 因为一旦磁盘开始读写，
就必须按时完成数据传送， 否则数据缓冲区中的数据会发生丢失。`,score:null}]},{id:"2022-a45",type:"applied",year:2022,no:45,subject:"操作系统",paper:"408",stem:`某文件系统的磁盘块大小为 4KB, 目录项由文件名和
索引结点号构成， 每个索引结点占 256 字节， 其中包含直接
地址项 10 个， 一级、 二级和三级间接地址项各 1 个， 每个地
址项占 4 字节。 该文件系统中子目录 stu 的结构如题 45(a)图
所示， stu 包含子目录 course 和文件 doc, course 子目录包含
文件 coursel 和 course2。各 文件的文件名 、索 引结点号、 占
用磁盘块的块号如题 45(b)图所示。
请回答下列问题。
Stu
course I
course2 、
doc
题45(a)图`,explanation:"",totalScore:7,parts:[{no:1,stem:"目录文件stu中每个目录项的内容是什么？",answer:`在该文件系统中， 目录项由文件名和索引结点号构成。 由图a 可知， Stu 目录下有两个文
件， 分别是course和doc。 由图b可知， 这两个文件分别对应索引结点号2和10。因 此，
目录文件 stu 中两个目录项的内容是
文件名 索引结点号 |
course 2
doc 10`,score:null},{no:2,stem:"文件 doc 占用的磁盘块的块号x的值是多少？",answer:`由图b可知， 文件doc和文件course]对应的索引结点号都是10。 说明doc和courseI两
个目录项共享同 一个索引结点，本质上对应同 一个文件。而文件courseI存储在30号磁盘
块， 因此文件doc占用的磁盘块的块号x为30。`,score:null},{no:3,stem:`若目录文件 course 的内容已在内存， 则打开文
件 coursel 并将其读入内存， 需要读几个磁盘
块？说明理由。`,answer:`需要读2个磁盘块。 先读course)的索引结点所在的磁盘块， 再读course!的内容所在的
磁盘块。 目录文件course的内容已在内存中， 即course!、 course2对应的目录项已在内存
中， 根据coursel对应的目录项可以知道其索引结点号， 即可读入coursel的索引结点所
在的磁盘块；根据course!的索引结点可知该文件存储在30号磁盘块， 因此可再读入
course!的内容所在的磁盘块。`,score:null},{no:4,stem:`若文件 course2 的大小增长到6MB, 则为了存
取 course2 需要使用该文件索引结点的哪几级
间接地址项？说明理由。
文件名
Stu
course
course I
course2
doc
索引结点号 磁盘块号
l 10
2 20
10 30
100 40
10 X
题 45(b)图`,answer:`存取course2需要使用索引结点的一级和二级间接地址项。 6MB大小的文件需要占用
6MB/4KB = 1536个磁盘块。直接地址项可以记录10个磁盘块号， 一级间接地址块可以记
录4KB/4B = 1024个磁盘块号，二级间接地址块可以记录1024x1024个磁盘块号，而10 +
1024 < 1536 < 10 + 1024 + 1024xI024。 因此， 6MB大小的文件， 需要使用 一级间接地址
项和二级间接地址项（拓展：若文件的总大小超出10 + 1024 + 1024xl024块， 则还需使
用三级间接地址项）。`,score:null}]},{id:"2022-a46",type:"applied",year:2022,no:46,subject:"操作系统",paper:"408",stem:`某进程的两个线程 Tl 和 T2 并发执行 A、 B、 C、 D、 E
和 F 共 6 个操作，其中 Tl 执行 A、 E 和 F, T2 执行 B、 C 和 D。 (A
题 46 图表示上述 6 个操作的执行顺序所必须满足的约束： C在
A和B完成后执行， D和E在 C完成后执行，F在E完成后执 (B
行。请使用信号量的 wait(）、 signal(）操作描述 Tl 和 T2 之间的同
步关系， 并说明所用信号量的作用及其初值。 题 46 图`,explanation:"",totalScore:8,parts:[{no:1,stem:`某进程的两个线程 Tl 和 T2 并发执行 A、 B、 C、 D、 E
和 F 共 6 个操作，其中 Tl 执行 A、 E 和 F, T2 执行 B、 C 和 D。 (A
题 46 图表示上述 6 个操作的执行顺序所必须满足的约束： C在
A和B完成后执行， D和E在 C完成后执行，F在E完成后执 (B
行。请使用信号量的 wait(）、 signal(）操作描述 Tl 和 T2 之间的同
步关系， 并说明所用信号量的作用及其初值。 题 46 图`,answer:`进程Tl要依次执行A、 E、 F。 进程T2要执行B、 C、 D。 由图可知， T2执行C必须在Tl
执行完A之后；Tl执行E必须在T2执行完C之后。 因此，有两对同步关系。信号量的定义
和同步关系的描述如下：
Semaphore SAc = O; //描述A、 C之间的同步关系
Semaphore ScE = O; II描述C、 E之间的同步关系
Tl: T2:
signal(SAc); wait(SAc);
wait(ScE); C;
E; signal(ScE);`,score:8}]},{id:"2022-a47",type:"applied",year:2022,no:47,subject:"计算机网络",paper:"408",stem:`某网络拓扑如题 47 图所示， R 为路由器， S 为以太网交换机， AP 是 802.11 接入点，
路由器的 EO 接口和 DHCP 服务器的 IP 地址配置如图中所示； Hl 与 H2 属于同 一个广播域，
但不属于同 一个冲突域； H2 和 H3 属于同 一个冲突域； H4 和 H5 已经接入网络，并通过 DHCP
动态获取了 1P 地址。 现有路由器、 lOOBaseT 以太网交换机和 lOOBaseT 集线器(Hub)三类
设备各若干台。
题 47 图
请回答下列问题。`,explanation:"",totalScore:9,parts:[{no:1,stem:`设备 1 和设备 2 应该分别选择哪类设备？
H4忑
192. I 68.0.3/25
00-11-11-11-11-DI
H5心专
192.168.0.4/25
00-11-11-11-11-EI`,answer:`设备1选择IOOBaseT以太网交换机，设备2选择IOOBaseT集线器。因为物理层设备既不
能隔离冲突域也不能隔离广播域， 链路层设备可以隔离冲突域但不能隔离广播域。`,score:null},{no:2,stem:`若信号传播速度为 2x108 mis, 以太网最小帧长为 64 B, 信号通过设备 2 时会产生额外的
1.51 µs的时间延迟， 则H2 与 H3 之间可以相距的最远距离是多少？`,answer:`假设H2与H3之间的最远距离是D, 根据CSMNCD协议的工作原理 有
最短帧长＝总线传播时延x数据传输速率x2
本题中由于使用lOOBaseT局域网标准， 所以 数据传输速率 为lOOMbps, 总线传播时延由
两部分组成， 一 部分是信号传播时延 ，另 一部分是信号通过设备 2 时产生的额外l.51µs
时间延迟。代入公式为64B = (1.51µs + D/(2xI0 8m/s))xIOOMbps, 注意单位换算， 最终解
得D=210m。`,score:null},{no:3,stem:`在 H4 通过 DHCP 动态获取 IP 地址过程中， H4 首先发送了 DHCP 报文 M, M 是哪种
DHCP 报文？路由器 EO 接口能否收到封装 M 的以太网帧？S 向 DHCP 服务器转发的封装
M的以太网帧的目的MAC地址是什么？`,answer:`M是DHCP 发现报文(DISCOVER报文）。路由器EO 接口能收到封装M的以太网帧，由
于H4 发送的DHCP发现报文是广播的形式，所以同 一个广播域内的所有设备和接口都可
以收到该以太网帧。 由于是广播帧， 所以目的MAC地址是全1, s 向DHCP服务器转发
的封装M的以太网帧的目的MAC地址是FF -FF-FF-FF-FF-FF。`,score:null},{no:4,stem:`若 H4 向 H5 发送一个 1P 分组 P, 则 H5 收到的封装 P 的 802.11 帧的地址 l、地 址 2 和地
址 3 分别是什么？`,answer:`在H5收到的帧中 ，地 址1、地址2 和地址3分别是00-11-11-11-11-E l、00-11-11-11-11-C1
和00-11-11-11-11-Dl 。该 帧来自A P， 地址l代表接收端的地址， 地址2代表 AP的地址，
地址3 是发送端的地址。`,score:null}]},{id:"2023-a41",type:"applied",year:2023,no:41,subject:"数据结构",paper:"408",stem:`已知有向图 G 采用邻接矩阵存储，类型定义如下：
typedef struct    //图的类型定义
int numVertices， numEdges； //图的顶点数和有向边数
char VerticesList[ MAXV ]； //顶点表，MAXV 为已定义常量
int Edge[ MAXV ][ MAXV ]； //邻接矩阵
} MGraph；
将图中出度大于入度的顶点称为 K 顶点。例如题 41 图中，顶点 a 和顶点 b 为 K 顶点。
请设计算法：int printVertices(MGraph G)， 对给定的任意非空有向图G， 输出图G 中所有的
K 顶点，并返回 K 顶点的个数。要求：`,explanation:"",totalScore:13,parts:[{no:1,stem:"给出算法的基本设计思想。",answer:`算法的基本设计思想
采用邻接矩阵表示有向图时， 一行中1 的个数为该行对应顶点的出度， 一列中1 的个数为该列
对应顶点的入度。使用一个初值为 0 的计数器记录 K 顶点的个数。对图 G 的每个顶点，根据
邻接矩阵计算其出度 outdegree 和入度 inde-gree 。若 outdegree-indegree>0，则输出该顶点且
计数器加 1。最后返回计数器的值。`,score:null},{no:2,stem:"根据设计思想，采用 C 或 C++语言描述算法，关键之处给出注释。",answer:`用 C 语言描述的算法：
int print Vertices(MGraph G)   //采用邻接矩阵存储，输出K 顶点，
//返回个数
int indegree, outdegree, k, m, count=0;
for (k=0; k<G.numVertices; k++)
indegree=outdegree=0;
for(m=0;m<G.numVertices; m++)//计算顶点的出度
outdegree+=G.Edge[k][m];
for(m=0;m<G.numVertices; m++)//计算顶点的入度
indegree+= G.Edge[m][k];
if(outdegree>indegree)
printf(“%c”, G.VerticesList[k]);
count++;
return  count;   //返回K 顶点的个数`,score:null}]},{id:"2023-a42",type:"applied",year:2023,no:42,subject:"数据结构",paper:"408",stem:`对含有 n(n>0)个记录的文件进行外部排序，采用置换-选择排序生成初始归并段时
需要使用一个工作，工作区中能保存 m 个记录，请回答下列问题：`,explanation:"",totalScore:10,parts:[{no:1,stem:`若文件中含有 19 个记录，其关键字依次是 51，94，37，92，14，63，15，99，48，56，
23，60，31，17，43，8，90，166，100，当 m=4 时，可生成几个初始归并段？各是什么？`,answer:`可生成 3 个初始归并段，分别是：
37，51，63，92，94，99
14，15，23，31，48，56，60，90，166
8，17，43，100`,score:null},{no:2,stem:"对任意的 m(n>>m>0)，生成的第一个初始归并段的长度最大值和最小值分别是多少?",answer:"最大值为 n，最小值为 m。",score:null}]},{id:"2023-a43",type:"applied",year:2023,no:43,subject:"计算机组成原理",paper:"408",stem:`已知计算机 M 字长为 32 位，按字节编址，采用请求调页策略的虚拟存储管理方
式，虚拟地址 32 位，页面大小为 4KB；数据 Cache 采用 4 路组相联映射方式，数据区大小为
8KB，主存块大小为 32B。现有 C 语言程序段如下：
int a[ 24 ][ 64 ]；
for（ i=0；i<24；i++ ）
for（ j=0； j<64； j++）a[ i ][ j ]=10；
已知二维数组 a 按行优先存放， 在虚拟地址空间中分配的起始地址为0042 2000H，sizeof（int）
=4。假定在 M 上执行上述程序段之前数组 a 不在主存，且在该程序执行过程中不会发生页面
置换。请回答下列问题：`,explanation:"",totalScore:14,parts:[{no:1,stem:`数组分布在几个页面中？对于数组 a 的访问，会发生几次缺页异常？页故障地址各是什
么？`,answer:`数 组a 分布在 2 个页面中。 缺页异常次数为2。 两个页故障地址分别是0042 2000H、0042
3000H。`,score:null},{no:2,stem:"不考虑变量 i 和 j，该程序段的数据访问是否具有时间局部性？为什么？",answer:"该程序段的数据访问没有时间局部性。因为每个数组元素仅访问 1 次。",score:null},{no:3,stem:`计算机M 的虚拟地址(A31~A0)中哪几位用作块内地址？哪几位用作 Cache 组号？a[1][0]
的虚拟地址是多少？其所在主存块对应的 Cache 组号是多少？`,answer:`虚拟地址中低5 位(A4~A0)用作块内地址； 低11 位虚拟地址中高 6 位(A10~A5)用作 Cache
组号。a[1][0]的虚拟地址为 0042 2000H+1 ×64×4+0×4=0042 2100H。
a[1][0]所在主存块对应的 Cache 组号为 001000B=8。`,score:null},{no:4,stem:`数组 a 占用多少主存块?假设上述程序段执行过程中数组 a 的访问不会和其他数据发生
Cache 访问冲突，则数组 a 的 Cache 命中率是多少?若将循环中 i 和 j 的次序按如下方式调换：
for（ j=0； j<64；j++ )
for（ i=0；i<24；i++ ）a[ I ][ j ]=10；
则数组 a 的 Cache 命中率又是多少？`,answer:`数 组a 占 24×64×4B/32B=192 个主存块。 每个主存块存放32B/4B=8 个数组元素， 访问数
组 a 的 Cache 命中率为(8-1)/8=87.5%。8 行数组元素占 8×64×4B/32B=64 个主存块，分别映射
到 64 个 Cache 组的某 Cache 行， 数组a 共有 24 行， 因此每个Cache 组中只有 24/8=3 个 Cache
行存放数组 a 中的数据，而每个 Cache 组有 4 行，因而不会发生替换，访问数组a 的 Cache 命
中率为 7/8=87.5%。`,score:null}]},{id:"2023-a44",type:"applied",year:2023,no:44,subject:"计算机组成原理",paper:"408",stem:`43 题中 C 程序段在计算机 M 上的部分机器级代码如下，每个机器级代码行中依次
包含指令序号、虚拟地址、机器指令和汇编指令。
for ( i=0；i<24；i++)
1   00401072  C7 45 F8 00 00 00 00   mov [ebp –8]，0
2   00401079  EB 09      jmp 00401084h
3   0040107B  8B 55 F 8     mov eax，[ebp-8]
7   00401088  7D 32     jpe 004010bch
for ( j=0；j<64；j++)
8   0040108A  C7 45 FC 00 00 00 00    mov [ebp –4]，0
a[ i ][ j ]=10；
19  004010AE  C7 84 82 00 20 42 00 0A   mov [eex + edx * 4+
 00 00 00        00422000h]，0Ah
20  …  …      …
请回答下列问题。`,explanation:"",totalScore:9,parts:[{no:1,stem:"第 20 条指令的虚拟地址是多少？",answer:"第 20 条指令的虚拟地址为 0040  10B9H 。",score:null},{no:2,stem:`已知第2 条 jmp 和第 7 条 jge 都是跳转指令， 其操作码分别是EBH 和 7DH， 跳转目标地
址分别为 0040 1084H 、0040 10BCH,这两条指令分别采用什么寻址方式？请给出第 2 条指令
jmp 的跳转目标地址计算过程。`,answer:`第 2 条 jmp 和第 7 条 jge 指令都采用相对寻址方式。
第 2 条指令 jmp 的跳转目标地址=0040 1079H+2+09H=0040 1084H。`,score:null},{no:3,stem:`已知第 19 条 mov 指令的功能是“a[ i ][ j ]←10”，其中 ecx 和 edx 为寄存器名，0042
2000H 是数组 a 的首地址，指令中源操作数采用什么寻址方式？已知 edx 中存放的是变量 j，
ecx 中存放的是什么？根据该指令的机器码判断计算机 M 采用的是大端还是小端方式。`,answer:`第 19 条指令中源操作数采用立即( 数)寻址方式。
根据汇编指令中给出的计算公式 ecx +edx*4+00422000h 可知，ecx 中存放的是 i×256。M 采
用小端方式。`,score:null},{no:4,stem:"第 1 次执行第 19 条指令时，取指令过程中是否会发生缺页异常？为什么？",answer:`第一次执行第 19 条指令时，取指令过程中不会发生缺页异常。因为第 19 条指令所在的
程序段都在页号为 00401H 的同一个页面中，执行第 19 条指令时，该页已在主存，因而取指
令过程中不会发生缺页异常。`,score:null}]},{id:"2023-a45",type:"applied",year:2023,no:45,subject:"操作系统",paper:"408",stem:`现要求学生使用 swap 指令和布尔型变量 lock，实现临界区互斥。lock 为线程间共
享的变量。lock 的值为 TRUE 时线程不能进入临界区，为 FALSE 时，线程能进入临界区。某
同学编写的实现临界区互斥的伪代码如题 45（a）图所示：
某同学编写的伪代码  newSwap()的代码
Bool lock=FALSE;  //共享变量
Bool key=TRUE
If (key== TRUE)
  Swap key,lock; //交换 key 和 lock 的值
进入区
临界区
Lock= TRUE; 退出区

 Void newSwap(bool*a, bool*b)
 bool temp=*a
*b=temp
请回答下列问题：`,explanation:"",totalScore:7,parts:[{no:1,stem:"题 45(a)图的伪代码中哪些语句存在错误?将其改为正确的语句（不增加语句条数）。",answer:`进入区中的语句“if (key == TRUE) swap key，lock ”存在错误，修改为“while (key ==
TRUE)swap key, lock”。退出区中的语句“lock=TRUE”存在错误，修改为“lock=FALSE”。`,score:null},{no:2,stem:`题 45(b)图给 出了两个变量值的函数 newSwap( ) 的代码， 是否可以用函数调用语句
“newSwap(&key，&lock)”代替指令“swap key，lock”以实现临界区的互斥?为什么?`,answer:`否。因为多个线程可以并发执行newSwap()，newSwap()执行时传递给形参 b 的是共享变
量 lock 的地址，在 newSwap()中对 lock 既有读操作又有写操作，并发执行时不能保证实现两
个变量值的原子交换，从而会导致并发执行的线程同时进入临界区。`,score:null}]},{id:"2023-a46",type:"applied",year:2023,no:46,subject:"操作系统",paper:"408",stem:`进程P 通过执行系统调用从键盘接收一个字符的输入， 已知此过程中与进程P 相关
的操作包括：
①将进程 P 插入就绪队列；②将进程 P 插入阻塞队列；③将字符从键盘控制器读入系统缓冲
区； ④启动键盘中断处理程序；
⑤进程 P 系统调用返回； ⑥用户在键盘上输入字符。 以上编号
①~⑥仅用于标记操作，与操作的先后顺序无关，请回答下列问题。`,explanation:"",totalScore:8,parts:[{no:1,stem:`按照正确的操作顺序，操作①的前一个和后一个操作分别是上述操作中的哪一个？操作
⑥的后一个操作是上述操作中的哪一个？`,answer:"在操作①的前操作是③，后一个操作是⑤。操作⑥的后一个操作是④。",score:null},{no:2,stem:`在上述哪个操作之后 CPU 一定从进程 P 切换到其他进程？在上述哪个操作之后 CPU 调
度程序才能选中进程 P 执行？`,answer:`在操作②之后 CPU 一定从进程 P 切换到其他进程。在操作①之后 CPU 调度程序才能选
中进程 P 执行。`,score:null},{no:3,stem:"完成上述哪个操作的代码属于键盘驱动程序？",answer:"完成操作③的代码属于键盘驱动程序。",score:null},{no:4,stem:"键盘中断处理程序执行时，进程 P 处于什么状态？CPU 处于内核态还是用户态？",answer:"进程 P 处于阻塞状态。CPU 处于内核态。",score:null}]},{id:"2023-a47",type:"applied",year:2023,no:47,subject:"计算机网络",paper:"408",stem:`某网络拓扑如题 47 图所示，主机 H 登录 FTP 服务器后，向服务器上传一个大小为
18000B 的文件 F。假设 H 为传输 F 建立数据连接时，选择的初始序号为 100，MSS=1000B，
拥塞控制初始阈值为 4MSS，RTT=10ms，忽略 TCP 段的传输时延；在 F 的传输过程中，H 均
以 MSS 段向服务器发送数据，且未发生差错、丢包和乱序现象。
请回答下列问题。`,explanation:"",totalScore:9,parts:[{no:1,stem:`FTP 的控制连接是持久的还是非持久的？FTP 的数据连接是持久的还是非持久的？H 登
录 FTP 服务器时，建立的 TCP 连接是控制连接还是数据连接？`,answer:`FTP 的控制连接是持久的； 数据连接是非持久的；H 登录 FTP 服务器时， 建立的TCP 连
接是控制连接。`,score:null},{no:2,stem:`H 通过数据连接发送 F 时，F 的第 1 个字节的序号是多少？在断开数据连接的过程中，
FTP 服务器发送的第二次挥手 ACK 段的确认序号是多少？`,answer:"F 的第 1 个字节的序号是 101；第二次挥手 ACK 段的确认序号是 18102。",score:null},{no:3,stem:`H 通过数据连接发送 F 时，当 H 收到确认序号为 2101 的确认段时，H 的拥塞窗口调整
为多少？收到确认序号为 7101 的确认段时，H 的拥塞窗口调整为多少？`,answer:`当 H 收到确认序号为 2101 的确认段时，H 的拥塞窗口调整为 3MSS；收到确认序号为
7101 的确认段时，H 的拥塞窗口调整为 5MSS。`,score:null},{no:4,stem:`H 从请求建立数据连接开始，到确认 F 己被服务全部接收为止，至少需要多长时间？期
间应用层数据的平均发送速率是多少？`,answer:`H 从请求建立数据连接开始，到确认 F 已被服务器全部接收为止，至少需要
6RTT=6*10ms=60ms；期间应用层数据平均发送速率是 18000B/60ms=300*103B/s=0.3MB/s=
2.4Mb/s。`,score:null}]}];export{t as r};
